// Class Killstreak.AkPoolComponent
// Size: 0x148 (Inherited: 0xd0)
struct UAkPoolComponent : public UBasePoolComponent {
	char UnknownData_D0[0x8]; // 0xd0(0x08)
	struct UAkComponent* PooledAkComponentClass; // 0xd8(0x08)
	struct TArray<struct UAkComponent*> UnusedComponentsArray; // 0xe0(0x10)
	struct TSet<struct UAkComponent*> UsedComponentsSet; // 0xf0(0x50)
	struct UAkComponent* PeekedAkComponent; // 0x140(0x08)
};

// Class Killstreak.ItemCollection
// Size: 0x98 (Inherited: 0x30)
struct UItemCollection : public UPrimaryDataAsset {
	struct FPrimaryAssetRules Rules; // 0x30(0x0c)
	char UnknownData_3C[0x4]; // 0x3c(0x04)
	struct FGameplayTagQuery CollectionQuery; // 0x40(0x48)
	struct FName PrimaryAssetType; // 0x88(0x08)
	char UnknownData_90[0x8]; // 0x90(0x08)
};

// Class Killstreak.ApparelCollection
// Size: 0xd8 (Inherited: 0x98)
struct UApparelCollection : public UItemCollection {
	struct FText ApparelCollectionName; // 0x98(0x18)
	struct FText ApparelCollectionDescription; // 0xb0(0x18)
	char UnknownData_C8[0x10]; // 0xc8(0x10)
};

// Class Killstreak.AttachmentCollection
// Size: 0x148 (Inherited: 0x98)
struct UAttachmentCollection : public UItemCollection {
	struct FText AttachmentCollectionName; // 0x98(0x18)
	struct FText AttachmentCollectionDescription; // 0xb0(0x18)
	char UnknownData_C8[0x80]; // 0xc8(0x80)

	void GetCompatibleAttachmentsForWeaponType(struct FGameplayTag WeaponType, struct TArray<struct TSoftObjectPtr<struct UKSWeaponAttachment>> OutCompatibleAttachments); // Function Killstreak.AttachmentCollection.GetCompatibleAttachmentsForWeaponType
};

// Class Killstreak.BakedOcclusionLUT
// Size: 0xb0 (Inherited: 0x28)
struct UBakedOcclusionLUT : public UObject {
	struct TMap<uint32_t, char> LUT; // 0x28(0x50)
	struct TArray<uint16_t> OctreeSampleMap; // 0x78(0x10)
	struct TArray<struct FIntVector> OctreeLocations; // 0x88(0x10)
	float DistanceOutputMin; // 0x98(0x04)
	float DistanceOutputMax; // 0x9c(0x04)
	float DistanceMin; // 0xa0(0x04)
	float DistanceMax; // 0xa4(0x04)
	float fOcclusionMultiplier; // 0xa8(0x04)
	float fOcclusionDistanceMultiplier; // 0xac(0x04)
};

// Class Killstreak.AudioOcclusionComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UAudioOcclusionComponent : public UActorComponent {
	struct UBakedOcclusionLUT* LUT; // 0xb0(0x08)

	float GetPathedOcclusion(struct FVector Other); // Function Killstreak.AudioOcclusionComponent.GetPathedOcclusion
};

// Class Killstreak.EnvironmentListenerComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UEnvironmentListenerComponent : public UActorComponent {
	struct FName CurrentEnvironmentTag; // 0xb0(0x08)
	struct FName StartingEnvironment; // 0xb8(0x08)
	struct FWeakObjectPtr<struct UEnvironmentTrackerComponent> LastTrackerComponent; // 0xc0(0x08)

	void ViewTargetEnvironmentChanged(struct FName OldEnvironmentTag, struct FName NewEnvironmentTag); // Function Killstreak.EnvironmentListenerComponent.ViewTargetEnvironmentChanged
	void OnEnvironmentChanged(struct FName OldEnvironmentTag); // Function Killstreak.EnvironmentListenerComponent.OnEnvironmentChanged
	struct FName GetCurrentEnvironment(); // Function Killstreak.EnvironmentListenerComponent.GetCurrentEnvironment
};

// Class Killstreak.EnvironmentTrackerComponent
// Size: 0x138 (Inherited: 0xb0)
struct UEnvironmentTrackerComponent : public UActorComponent {
	struct TArray<struct UObject*> EnvironmentVolumes; // 0xb0(0x10)
	struct TMap<struct FName, int32_t> CachedEnvironmentCounts; // 0xc0(0x50)
	struct FName CachedCurrentEnvironment; // 0x110(0x08)
	struct FName LastEnvironment; // 0x118(0x08)
	struct FName DefaultEnvironment; // 0x120(0x08)
	struct FMulticastInlineDelegate OnEnvironmentChanged; // 0x128(0x10)

	struct FName ReevalulateEnvironment(); // Function Killstreak.EnvironmentTrackerComponent.ReevalulateEnvironment
	void OnRep_CurrentEnvironment(); // Function Killstreak.EnvironmentTrackerComponent.OnRep_CurrentEnvironment
	struct FName GetCurrentEnvironment(); // Function Killstreak.EnvironmentTrackerComponent.GetCurrentEnvironment
	void EndTouchingOwnerUpdatedComponent(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Killstreak.EnvironmentTrackerComponent.EndTouchingOwnerUpdatedComponent
	void BlueprintEnvironmentChanged(struct FName OldEnvironment); // Function Killstreak.EnvironmentTrackerComponent.BlueprintEnvironmentChanged
	void BeginTouchingOwnerUpdatedComponent(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Killstreak.EnvironmentTrackerComponent.BeginTouchingOwnerUpdatedComponent
};

// Class Killstreak.EnvironmentVolume
// Size: 0x268 (Inherited: 0x258)
struct AEnvironmentVolume : public ATriggerVolume {
	char UnknownData_258[0x8]; // 0x258(0x08)
	struct FName EnvironmentTag; // 0x260(0x08)
};

// Class Killstreak.PreviewActorLoadoutComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UPreviewActorLoadoutComponent : public UActorComponent {
	struct AKSJobSelectPreviewActor* PreviewActorOwner; // 0xb0(0x08)
};

// Class Killstreak.RogueScreenLoadoutComponent
// Size: 0x120 (Inherited: 0xb8)
struct URogueScreenLoadoutComponent : public UPreviewActorLoadoutComponent {
	struct UKSJobItem* CurrentJob; // 0xb8(0x08)
	struct UKSSkinBundle* OverrideSkin; // 0xc0(0x08)
	struct TMap<struct UKSItem*, struct UKSItem*> SkinMap; // 0xc8(0x50)
	bool bBoundToLoadoutFactory; // 0x118(0x01)
	char UnknownData_119[0x3]; // 0x119(0x03)
	int32_t LastLoadoutId; // 0x11c(0x04)

	void LoadoutDeleted(int32_t InLoadoutId); // Function Killstreak.RogueScreenLoadoutComponent.LoadoutDeleted
	void LoadoutChanged(struct UPUMG_Loadout* InLoadout); // Function Killstreak.RogueScreenLoadoutComponent.LoadoutChanged
};

// Class Killstreak.FavoritePreviewLoadoutComponent
// Size: 0x148 (Inherited: 0x120)
struct UFavoritePreviewLoadoutComponent : public URogueScreenLoadoutComponent {
	struct TSoftObjectPtr<struct UKSJobItem> FailSafeFavoriteJob; // 0x120(0x28)

	void CheckForPreferredJobChange(struct UPUMG_Loadout* InLoadout); // Function Killstreak.FavoritePreviewLoadoutComponent.CheckForPreferredJobChange
};

// Class Killstreak.JobCollection
// Size: 0xd8 (Inherited: 0x98)
struct UJobCollection : public UItemCollection {
	struct FText CollectionName; // 0x98(0x18)
	struct FText CollectionDescription; // 0xb0(0x18)
	char UnknownData_C8[0x10]; // 0xc8(0x10)
};

// Class Killstreak.KSJobRole
// Size: 0x78 (Inherited: 0x30)
struct UKSJobRole : public UDataAsset {
	struct FText JobRoleDisplayName; // 0x30(0x18)
	struct FName JobRoleName; // 0x48(0x08)
	struct FText JobRoleDescription; // 0x50(0x18)
	int32_t JobRoleSortOrder; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
	struct UTexture2D* JobRoleIcon; // 0x70(0x08)

	struct UTexture2D* GetRoleIcon(); // Function Killstreak.KSJobRole.GetRoleIcon
};

// Class Killstreak.KickbackModuleRandom
// Size: 0x40 (Inherited: 0x28)
struct UKickbackModuleRandom : public UKickbackModule {
	float MinAmplitude; // 0x28(0x04)
	float MaxAmplitude; // 0x2c(0x04)
	float MinDuration; // 0x30(0x04)
	float MaxDuration; // 0x34(0x04)
	float MaxOffsetFromVertical; // 0x38(0x04)
	char UnknownData_3C[0x4]; // 0x3c(0x04)
};

// Class Killstreak.KillstreakGameSingleton
// Size: 0x88 (Inherited: 0x28)
struct UKillstreakGameSingleton : public UPlatformGameSingleton {
	char UnknownData_28[0x60]; // 0x28(0x60)
};

// Class Killstreak.KSAccoladeTracker
// Size: 0x98 (Inherited: 0x28)
struct UKSAccoladeTracker : public UObject {
	char UnknownData_28[0x10]; // 0x28(0x10)
	struct FAccoladeDisplayInfo AccoladeDisplayInfo; // 0x38(0x60)

	void StartTracking(); // Function Killstreak.KSAccoladeTracker.StartTracking
	void ResetTracker(); // Function Killstreak.KSAccoladeTracker.ResetTracker
	void NativeHandleElimEvent(struct FCombatEventInfo ElimEvent); // Function Killstreak.KSAccoladeTracker.NativeHandleElimEvent
	void NativeHandleDownEvent(struct FCombatEventInfo DownEvent); // Function Killstreak.KSAccoladeTracker.NativeHandleDownEvent
	void HandleElimEvent(struct FCombatEventInfo ElimEvent); // Function Killstreak.KSAccoladeTracker.HandleElimEvent
	void HandleDownEvent(struct FCombatEventInfo DownEvent); // Function Killstreak.KSAccoladeTracker.HandleDownEvent
	struct FAccoladeDisplayInfo GetPrimaryAccoladeDisplayInfo(); // Function Killstreak.KSAccoladeTracker.GetPrimaryAccoladeDisplayInfo
	bool GetOwningGameMode(struct AKSGameMode* OutGameMode); // Function Killstreak.KSAccoladeTracker.GetOwningGameMode
	void DispatchGameStateAccoladeDisplay(struct AKSPlayerState* RelevantPlayer, struct FAccoladeDisplayInfo AccoladeToDisplay, bool IgnoreRelevantPlayerId); // Function Killstreak.KSAccoladeTracker.DispatchGameStateAccoladeDisplay
};

// Class Killstreak.KSAcquisition
// Size: 0x50 (Inherited: 0x28)
struct UKSAcquisition : public UObject {
	struct TArray<struct UPUMG_StoreItem*> AcquisitionItems; // 0x28(0x10)
	char UnknownData_38[0x18]; // 0x38(0x18)

	bool IsVoucherAcquisition(); // Function Killstreak.KSAcquisition.IsVoucherAcquisition
	bool IsPurchase(); // Function Killstreak.KSAcquisition.IsPurchase
	bool IsBundleAcquisition(); // Function Killstreak.KSAcquisition.IsBundleAcquisition
};

// Class Killstreak.KSAcquisitionManager
// Size: 0x88 (Inherited: 0x50)
struct UKSAcquisitionManager : public UPUMG_AcquisitionManager {
	char UnknownData_50[0x8]; // 0x50(0x08)
	struct FMulticastInlineDelegate OnAcquisitionReady; // 0x58(0x10)
	struct TArray<struct UKSAcquisition*> QueuedAcquisitions; // 0x68(0x10)
	struct UKSAcquisition* PendingAcquisition; // 0x78(0x08)
	bool bIsDisplayingAcquisition; // 0x80(0x01)
	char UnknownData_81[0x7]; // 0x81(0x07)

	struct UKSAcquisition* GetNextAcquistion(bool KeepAcquistionsBlocked); // Function Killstreak.KSAcquisitionManager.GetNextAcquistion
	void CreateAcquisitionForItem(struct UPUMG_StoreItem* StoreItem); // Function Killstreak.KSAcquisitionManager.CreateAcquisitionForItem
};

// Class Killstreak.KSActivityInstanceManager
// Size: 0xc8 (Inherited: 0x28)
struct UKSActivityInstanceManager : public UObject {
	char UnknownData_28[0xa0]; // 0x28(0xa0)
};

// Class Killstreak.KSActivity
// Size: 0x2b0 (Inherited: 0xf8)
struct UKSActivity : public UPlatformInventoryItem {
	int64_t ProgressLootId; // 0xf8(0x08)
	int64_t RemoveProgressLootId; // 0x100(0x08)
	int64_t RewardVendorId; // 0x108(0x08)
	int64_t RewardXpTableId; // 0x110(0x08)
	struct TArray<int64_t> EntitlementItemIds; // 0x118(0x10)
	struct TArray<struct TSoftObjectPtr<struct UKSActivity>> ChildActivities; // 0x128(0x10)
	SoftClassProperty TrackerClass; // 0x138(0x28)
	struct TMap<struct FString, float> TrackerConfig; // 0x160(0x50)
	struct TMap<struct FString, struct FString> TrackerStringConfig; // 0x1b0(0x50)
	bool bIsClientAuthority; // 0x200(0x01)
	bool bCreateTrackerIfFinished; // 0x201(0x01)
	bool bAlwaysAllowProgress; // 0x202(0x01)
	bool bRequireAchievements; // 0x203(0x01)
	bool bRequireRewards; // 0x204(0x01)
	bool bRequireRanked; // 0x205(0x01)
	bool bAlwaysPackageActivityIfCreated; // 0x206(0x01)
	char UnknownData_207[0x1]; // 0x207(0x01)
	struct FActivityAchievementInfo AchievementInfo; // 0x208(0x58)
	enum class EKSActivityProgressDisplayType ProgressDisplayPreference; // 0x260(0x01)
	enum class EKSActivityClientNotifyFrequency ClientNotifyFrequency; // 0x261(0x01)
	char UnknownData_262[0x6]; // 0x262(0x06)
	struct TArray<struct FActivityTierStructure> ActivityTierData; // 0x268(0x10)
	bool bShowInPostMatchLobby; // 0x278(0x01)
	char UnknownData_279[0x7]; // 0x279(0x07)
	struct FActivityReference Reference; // 0x280(0x30)

	void InitNewlyCreatedActivity(int64_t InItemId, int64_t InProgressLootId, int64_t InRewardXpTableId, int64_t InRewardVendorId); // Function Killstreak.KSActivity.InitNewlyCreatedActivity
	bool GetTierDataForProgress(int32_t Progress, struct FActivityTierStructure TierData); // Function Killstreak.KSActivity.GetTierDataForProgress
	struct UKSActivityInstance* GetInstanceForPlayer(struct UObject* WorldContextObject, struct AKSPlayerController* Player); // Function Killstreak.KSActivity.GetInstanceForPlayer
};

// Class Killstreak.KSJobActivity
// Size: 0x2d8 (Inherited: 0x2b0)
struct UKSJobActivity : public UKSActivity {
	struct TSoftObjectPtr<struct UKSJobItem> ReferenceJob; // 0x2b0(0x28)
};

// Class Killstreak.KSMapActivity
// Size: 0x2d0 (Inherited: 0x2b0)
struct UKSMapActivity : public UKSActivity {
	struct FString ReferenceMap; // 0x2b0(0x10)
	struct FString ReferenceGameMode; // 0x2c0(0x10)
};

// Class Killstreak.KSActivityInstance
// Size: 0x1c8 (Inherited: 0x28)
struct UKSActivityInstance : public UObject {
	struct FMulticastInlineDelegate OnProgressIncremented; // 0x28(0x10)
	struct FMulticastInlineDelegate OnProgressTierReached; // 0x38(0x10)
	struct FMulticastInlineDelegate OnProgressCompleted; // 0x48(0x10)
	struct FMulticastInlineDelegate OnProgressInitialized; // 0x58(0x10)
	struct UKSEventTracker* TrackerInstance; // 0x68(0x08)
	int32_t ProgressCount; // 0x70(0x04)
	char UnknownData_74[0x4]; // 0x74(0x04)
	struct TArray<struct FActivityTier> ActivityTiers; // 0x78(0x10)
	char UnknownData_88[0x20]; // 0x88(0x20)
	struct FWeakObjectPtr<struct AKSPlayerController> PlayerController; // 0xa8(0x08)
	struct UKSActivity* Activity; // 0xb0(0x08)
	struct TArray<struct UKSActivityInstance*> ChildActivityInstances; // 0xb8(0x10)
	struct FWeakObjectPtr<struct UKSActivityManagerBase> ActivityManager; // 0xc8(0x08)
	bool bIsInitialized; // 0xd0(0x01)
	char UnknownData_D1[0x1]; // 0xd1(0x01)
	bool bIsChildActivity; // 0xd2(0x01)
	char UnknownData_D3[0x1]; // 0xd3(0x01)
	int32_t ProgressEarned; // 0xd4(0x04)
	struct TMap<struct FString, double> PlatformProgressPerAchievement; // 0xd8(0x50)
	struct TMap<enum class ERewardSource, float> ProgressEarnedBySource; // 0x128(0x50)
	struct TMap<struct FString, float> ProgressEarnedByEvent; // 0x178(0x50)

	void UpdateActivityTiers(); // Function Killstreak.KSActivityInstance.UpdateActivityTiers
	void OnEventTrackerTriggered(int32_t Count); // Function Killstreak.KSActivityInstance.OnEventTrackerTriggered
	bool IsUnlocked(); // Function Killstreak.KSActivityInstance.IsUnlocked
	bool IsFinished(); // Function Killstreak.KSActivityInstance.IsFinished
	bool IsActive(); // Function Killstreak.KSActivityInstance.IsActive
	bool IncrementProgress(int32_t Count); // Function Killstreak.KSActivityInstance.IncrementProgress
	bool HasAuthority(); // Function Killstreak.KSActivityInstance.HasAuthority
	void GetTiersForXpRange(struct TArray<struct FActivityTier> Tiers, int32_t StartingCount, int32_t EndingCount); // Function Killstreak.KSActivityInstance.GetTiersForXpRange
	void GetTiers(struct TArray<struct FActivityTier> Tiers); // Function Killstreak.KSActivityInstance.GetTiers
	bool GetTierDataForProgress(int32_t Progress, struct FActivityTierStructure TierData); // Function Killstreak.KSActivityInstance.GetTierDataForProgress
	bool GetTierCompletionTime(struct UObject* WorldContextObject, struct FActivityTier Tier, struct FDateTime TimeCompleted); // Function Killstreak.KSActivityInstance.GetTierCompletionTime
	struct FActivityTier GetProgressTierForSpecifiedProgressCount(int32_t SpecifiedCount); // Function Killstreak.KSActivityInstance.GetProgressTierForSpecifiedProgressCount
	struct FActivityTier GetProgressTier(); // Function Killstreak.KSActivityInstance.GetProgressTier
	bool GetProgressPercentageToNextTier(float ProgressPercentage); // Function Killstreak.KSActivityInstance.GetProgressPercentageToNextTier
	bool GetProgressPercentageToMaxTier(float ProgressPercentage); // Function Killstreak.KSActivityInstance.GetProgressPercentageToMaxTier
	float GetProgressFromSource(enum class ERewardSource Source); // Function Killstreak.KSActivityInstance.GetProgressFromSource
	float GetProgressFromEvent(struct FString EventName); // Function Killstreak.KSActivityInstance.GetProgressFromEvent
	int32_t GetProgressEarned(); // Function Killstreak.KSActivityInstance.GetProgressEarned
	struct FText GetProgressDisplayText(enum class EKSActivityProgressDisplayType DisplayType); // Function Killstreak.KSActivityInstance.GetProgressDisplayText
	int32_t GetProgressCount(); // Function Killstreak.KSActivityInstance.GetProgressCount
	int64_t GetPlayerId(); // Function Killstreak.KSActivityInstance.GetPlayerId
	struct FActivityTier GetNextTier(); // Function Killstreak.KSActivityInstance.GetNextTier
	bool GetMaxTier(struct FActivityTier MaxTier); // Function Killstreak.KSActivityInstance.GetMaxTier
	struct FDateTime GetLastProgressTime(); // Function Killstreak.KSActivityInstance.GetLastProgressTime
	int32_t GetInventoryProgressCount(); // Function Killstreak.KSActivityInstance.GetInventoryProgressCount
	struct FInventoryId GetInventoryId(); // Function Killstreak.KSActivityInstance.GetInventoryId
	void CreateTracker(); // Function Killstreak.KSActivityInstance.CreateTracker
};

// Class Killstreak.KSActivityManagerBase
// Size: 0x210 (Inherited: 0x28)
struct UKSActivityManagerBase : public UObject {
	struct FWeakObjectPtr<struct UKSGameInstance> GameInstance; // 0x28(0x08)
	struct FWeakObjectPtr<struct AKSGameMode> GameMode; // 0x30(0x08)
	char UnknownData_38[0x140]; // 0x38(0x140)
	int32_t VendorsLoadGroupId; // 0x178(0x04)
	char UnknownData_17C[0x4]; // 0x17c(0x04)
	struct TArray<struct TSoftObjectPtr<struct UKSActivity>> Activities; // 0x180(0x10)
	struct TArray<struct FWeakObjectPtr<struct AKSPlayerController>> PlayerControllers; // 0x190(0x10)
	char UnknownData_1A0[0x50]; // 0x1a0(0x50)
	enum class EKSActivityManagerSetupPhase SetupPhase; // 0x1f0(0x01)
	char UnknownData_1F1[0x1f]; // 0x1f1(0x1f)

	void RequestActivitiesLoad(); // Function Killstreak.KSActivityManagerBase.RequestActivitiesLoad
	bool QueryActivityInstancesByTime(struct TArray<struct UKSActivityInstance*> ActivityInstances, struct FTimespan TimeWindow, struct TArray<struct UKSActivityInstance*> Results, enum class EKSActivityTimeQueryType QueryType, struct AKSPlayerController* Player); // Function Killstreak.KSActivityManagerBase.QueryActivityInstancesByTime
	bool QueryActivityInstances(struct TArray<struct UKSActivityInstance*> ActivityInstances, enum class EKSActivityInstanceQueryType QueryType, struct TArray<struct UKSActivityInstance*> Results); // Function Killstreak.KSActivityManagerBase.QueryActivityInstances
	void OnStoreVendorsLoaded(int32_t GroupId, struct TArray<int32_t> VendorIds); // Function Killstreak.KSActivityManagerBase.OnStoreVendorsLoaded
	void OnSetupPhaseStarted(enum class EKSActivityManagerSetupPhase Phase); // Function Killstreak.KSActivityManagerBase.OnSetupPhaseStarted
	void OnSetupPhaseFinished(enum class EKSActivityManagerSetupPhase Phase); // Function Killstreak.KSActivityManagerBase.OnSetupPhaseFinished
	void OnServerPlayerPostLogin(struct AGameModeBase* InGameMode, struct APlayerController* NewPlayer); // Function Killstreak.KSActivityManagerBase.OnServerPlayerPostLogin
	void OnServerPlayerLogout(struct AGameModeBase* InGameMode, struct AController* Player); // Function Killstreak.KSActivityManagerBase.OnServerPlayerLogout
	void OnGameModePhaseChanged(struct FName PreviousPhaseName, struct FName NewPhaseName); // Function Killstreak.KSActivityManagerBase.OnGameModePhaseChanged
	void OnGameModeInitialized(struct AGameModeBase* InGameMode); // Function Killstreak.KSActivityManagerBase.OnGameModeInitialized
	void OnClientLoggedIn(); // Function Killstreak.KSActivityManagerBase.OnClientLoggedIn
	void OnAllActivitiesLoaded(); // Function Killstreak.KSActivityManagerBase.OnAllActivitiesLoaded
	bool IsSetupFinished(); // Function Killstreak.KSActivityManagerBase.IsSetupFinished
	void GoToNextSetupPhase(); // Function Killstreak.KSActivityManagerBase.GoToNextSetupPhase
	bool GetActivityInstances(struct TArray<struct UKSActivityInstance*> ActivityInstances, struct AKSPlayerController* Player); // Function Killstreak.KSActivityManagerBase.GetActivityInstances
	struct UKSActivityInstance* GetActivityInstanceByItemId(int64_t ItemId, struct AKSPlayerController* Player); // Function Killstreak.KSActivityManagerBase.GetActivityInstanceByItemId
	struct UKSActivityInstance* GetActivityInstance(struct FInventoryId InventoryId); // Function Killstreak.KSActivityManagerBase.GetActivityInstance
	struct UKSActivity* FindActivity(int64_t ReferenceValue1, int64_t ReferenceValue2, int64_t ReferenceValue3); // Function Killstreak.KSActivityManagerBase.FindActivity
	bool FindActivitiesByJob(struct UKSJobItem* JobItem, struct TArray<struct UKSJobActivity*> JobActivities); // Function Killstreak.KSActivityManagerBase.FindActivitiesByJob
	bool DoesRequireSetupPhase(enum class EKSActivityManagerSetupPhase Phase); // Function Killstreak.KSActivityManagerBase.DoesRequireSetupPhase
	void AttemptInitialActivityCreation(); // Function Killstreak.KSActivityManagerBase.AttemptInitialActivityCreation
};

// Class Killstreak.KSActivityTestManager
// Size: 0x248 (Inherited: 0x220)
struct AKSActivityTestManager : public AActor {
	struct TArray<struct UKSActivity*> Activities; // 0x220(0x10)
	bool bInitializeOnBeginPlay; // 0x230(0x01)
	char UnknownData_231[0x7]; // 0x231(0x07)
	struct TArray<struct UKSActivityInstance*> ActivityInstances; // 0x238(0x10)

	void DirectlySetupActivityTrackingForPlayer(struct AKSPlayerController* PlayerController); // Function Killstreak.KSActivityTestManager.DirectlySetupActivityTrackingForPlayer
};

// Class Killstreak.KSLagCompensatedActor
// Size: 0x260 (Inherited: 0x220)
struct AKSLagCompensatedActor : public AActor {
	struct AKSLagCompensatedActor* RealActor; // 0x220(0x08)
	struct AKSLagCompensatedActor* FakeActor; // 0x228(0x08)
	float PredictedSpawnTimeoutTime; // 0x230(0x04)
	bool bDestroyFakeOnYieldToReal; // 0x234(0x01)
	char UnknownData_235[0x3]; // 0x235(0x03)
	int32_t DefaultTeamNum; // 0x238(0x04)
	char UnknownData_23C[0x4]; // 0x23c(0x04)
	struct FSerializedMctsNetId InstigatorId; // 0x240(0x08)
	uint64_t LagCompActorID; // 0x248(0x08)
	char UnknownData_250[0x10]; // 0x250(0x10)

	void YieldToRealActor(); // Function Killstreak.KSLagCompensatedActor.YieldToRealActor
	void TryToDestroy(); // Function Killstreak.KSLagCompensatedActor.TryToDestroy
	void SetLagCompActorIDFromWeapon(struct AKSWeapon* SpawningWeapon); // Function Killstreak.KSLagCompensatedActor.SetLagCompActorIDFromWeapon
	void SetLagCompActorIDFromParentProjectile(struct AKSProjectile* ParentProjectile, int32_t Index); // Function Killstreak.KSLagCompensatedActor.SetLagCompActorIDFromParentProjectile
	void SetLagCompActorIDFromParentAgent(struct AKSAgentBase* ParentAgent, int32_t Index); // Function Killstreak.KSLagCompensatedActor.SetLagCompActorIDFromParentAgent
	void SetLagCompActorIDFromModInstance(struct UKSPlayerModInstance* SpawningModInst); // Function Killstreak.KSLagCompensatedActor.SetLagCompActorIDFromModInstance
	void RealActorTakeOver(); // Function Killstreak.KSLagCompensatedActor.RealActorTakeOver
	void RealActorDestroyed(struct AActor* Real); // Function Killstreak.KSLagCompensatedActor.RealActorDestroyed
	void OnTakeOverAsRealActor(); // Function Killstreak.KSLagCompensatedActor.OnTakeOverAsRealActor
	void OnRep_LagCompActorID(); // Function Killstreak.KSLagCompensatedActor.OnRep_LagCompActorID
	void OnRealActorSpawn(struct AKSLagCompensatedActor* Real); // Function Killstreak.KSLagCompensatedActor.OnRealActorSpawn
	void OnPlayerStateChanged(struct APlayerState* InPlayerState); // Function Killstreak.KSLagCompensatedActor.OnPlayerStateChanged
	void OnPlayerSpawned(struct AKSCharacterBase* InCharacter); // Function Killstreak.KSLagCompensatedActor.OnPlayerSpawned
	bool IsClientPredictedActor(); // Function Killstreak.KSLagCompensatedActor.IsClientPredictedActor
	bool IsActiveRealActor(); // Function Killstreak.KSLagCompensatedActor.IsActiveRealActor
	void InitializeRealActor(); // Function Killstreak.KSLagCompensatedActor.InitializeRealActor
	void InitializeFakeActor(); // Function Killstreak.KSLagCompensatedActor.InitializeFakeActor
	void FakeDestroyCleanup(); // Function Killstreak.KSLagCompensatedActor.FakeDestroyCleanup
};

// Class Killstreak.KSAgentBase
// Size: 0x2c8 (Inherited: 0x260)
struct AKSAgentBase : public AKSLagCompensatedActor {
	char UnknownData_260[0x8]; // 0x260(0x08)
	struct FMulticastInlineDelegate OnAgentRefund; // 0x268(0x10)
	bool BeginMissionOnPlay; // 0x278(0x01)
	char UnknownData_279[0x7]; // 0x279(0x07)
	struct UInterpToMovementComponent* MovementComponent; // 0x280(0x08)
	struct UBoxComponent* CollisionBox; // 0x288(0x08)
	struct FWeakObjectPtr<struct AController> OwningPlayer; // 0x290(0x08)
	float MaxHealth; // 0x298(0x04)
	enum class EAgentRefundMethod RefundMethod; // 0x29c(0x01)
	char UnknownData_29D[0x3]; // 0x29d(0x03)
	struct UKSWeaponAsset* AssociatedWeaponAsset; // 0x2a0(0x08)
	float CurrentHealth; // 0x2a8(0x04)
	char UnknownData_2AC[0x4]; // 0x2ac(0x04)
	struct FMulticastInlineDelegate OnHealthUpdate; // 0x2b0(0x10)
	int32_t OriginalOwnerId; // 0x2c0(0x04)
	char UnknownData_2C4[0x4]; // 0x2c4(0x04)

	void RefundAgentAsset(); // Function Killstreak.KSAgentBase.RefundAgentAsset
	void OnRep_CurrentHealth(); // Function Killstreak.KSAgentBase.OnRep_CurrentHealth
	void OnMissionBegin(); // Function Killstreak.KSAgentBase.OnMissionBegin
	void MovementPlaybackStop(struct FHitResult ImpactResult, float Time); // Function Killstreak.KSAgentBase.MovementPlaybackStop
	void BroadcastMissionBegin(); // Function Killstreak.KSAgentBase.BroadcastMissionBegin
};

// Class Killstreak.KSAgent_Aimed
// Size: 0x3a0 (Inherited: 0x2c8)
struct AKSAgent_Aimed : public AKSAgentBase {
	bool bDisplayAimTargeter; // 0x2c8(0x01)
	char UnknownData_2C9[0x7]; // 0x2c9(0x07)
	SoftClassProperty AimTargeterWidget; // 0x2d0(0x28)
	struct FAimData CachedAim; // 0x2f8(0x50)
	struct UKSWeaponAsset* WeaponAsset; // 0x348(0x08)
	struct UKSWeaponAsset_WithProjectile* CachedProjectileAsset; // 0x350(0x08)
	struct FTimerHandle StateTransitionHandle; // 0x358(0x08)
	float ExpectedTransitionEndTime; // 0x360(0x04)
	int32_t CurrentAmmo; // 0x364(0x04)
	int32_t CurrentBurstCount; // 0x368(0x04)
	enum class EWeaponStateNew FiringState; // 0x36c(0x01)
	char UnknownData_36D[0x3]; // 0x36d(0x03)
	int32_t NextShotId; // 0x370(0x04)
	struct FVector TargeterLocation; // 0x374(0x0c)
	float ProjectileSimFrequency; // 0x380(0x04)
	float MaxSimTime; // 0x384(0x04)
	char UnknownData_388[0x18]; // 0x388(0x18)

	void StartPreFire(); // Function Killstreak.KSAgent_Aimed.StartPreFire
	void StartPostFire(); // Function Killstreak.KSAgent_Aimed.StartPostFire
	void StartIdle(); // Function Killstreak.KSAgent_Aimed.StartIdle
	void StartFire(); // Function Killstreak.KSAgent_Aimed.StartFire
	void StartCooldown(); // Function Killstreak.KSAgent_Aimed.StartCooldown
	void StartBuildup(); // Function Killstreak.KSAgent_Aimed.StartBuildup
	bool ShouldShowTargeter(); // Function Killstreak.KSAgent_Aimed.ShouldShowTargeter
	void SetWeaponAsset(struct UKSWeaponAsset* InAsset); // Function Killstreak.KSAgent_Aimed.SetWeaponAsset
	void SetCachedAim(struct FAimData NewAim); // Function Killstreak.KSAgent_Aimed.SetCachedAim
	void RefillAmmo(); // Function Killstreak.KSAgent_Aimed.RefillAmmo
	void OnRep_WeaponAsset(); // Function Killstreak.KSAgent_Aimed.OnRep_WeaponAsset
	void OnRep_FiringState(); // Function Killstreak.KSAgent_Aimed.OnRep_FiringState
	void OnFiringStateChanged(enum class EWeaponStateNew NewState); // Function Killstreak.KSAgent_Aimed.OnFiringStateChanged
	void OnFiringComplete(); // Function Killstreak.KSAgent_Aimed.OnFiringComplete
	bool IsFiring(); // Function Killstreak.KSAgent_Aimed.IsFiring
	struct FVector GetWorldTargetingLocation(); // Function Killstreak.KSAgent_Aimed.GetWorldTargetingLocation
	void EndPostFire(); // Function Killstreak.KSAgent_Aimed.EndPostFire
	void ClearCachedAim(); // Function Killstreak.KSAgent_Aimed.ClearCachedAim
	bool BlueprintWantsToKeepFiring(); // Function Killstreak.KSAgent_Aimed.BlueprintWantsToKeepFiring
	bool AgentFire(struct FAimData AimData); // Function Killstreak.KSAgent_Aimed.AgentFire
};

// Class Killstreak.KSAgent_RevealDrone
// Size: 0x370 (Inherited: 0x2c8)
struct AKSAgent_RevealDrone : public AKSAgentBase {
	float MaxFlightSpeed; // 0x2c8(0x04)
	float DistanceToFly; // 0x2cc(0x04)
	float TimeBetweenPings; // 0x2d0(0x04)
	float RevealPeriodDuration; // 0x2d4(0x04)
	struct FPGame_ReplicatedTimer ReplicatedRevealTimer; // 0x2d8(0x38)
	float UpdateReplicatedTimerPeriod; // 0x310(0x04)
	bool bAppliesScrambleEffectToEnemies; // 0x314(0x01)
	char UnknownData_315[0x43]; // 0x315(0x43)
	struct TArray<struct AKSCharacter*> CurrentSweepFoundChars; // 0x358(0x10)
	char UnknownData_368[0x8]; // 0x368(0x08)

	void UpdateReplicatedTimer(); // Function Killstreak.KSAgent_RevealDrone.UpdateReplicatedTimer
	void StartNextReveal(); // Function Killstreak.KSAgent_RevealDrone.StartNextReveal
	void SetPlayerOwner(struct AKSCharacter* InOwner); // Function Killstreak.KSAgent_RevealDrone.SetPlayerOwner
	void ScrambleEnemies(); // Function Killstreak.KSAgent_RevealDrone.ScrambleEnemies
	void RevealOpposingTeam(struct AKSPlayerController* PlayerController, float Threshold); // Function Killstreak.KSAgent_RevealDrone.RevealOpposingTeam
	void Ping(int32_t Team, float Threshold, float SweepSpeed, float SweepTimeRemaining); // Function Killstreak.KSAgent_RevealDrone.Ping
	void GetRevealPeriodDuration(float Duration, float RemainingTime); // Function Killstreak.KSAgent_RevealDrone.GetRevealPeriodDuration
	void EndRevealPeriod(); // Function Killstreak.KSAgent_RevealDrone.EndRevealPeriod
};

// Class Killstreak.KSAgent_RevivalDrone
// Size: 0x390 (Inherited: 0x2c8)
struct AKSAgent_RevivalDrone : public AKSAgentBase {
	char UnknownData_2C8[0x50]; // 0x2c8(0x50)
	struct FMulticastInlineDelegate OnAbort; // 0x318(0x10)
	struct FMulticastInlineDelegate OnArrive; // 0x328(0x10)
	float MaxFlightSpeed; // 0x338(0x04)
	float InvisibleMovementTime; // 0x33c(0x04)
	float ReviveTime; // 0x340(0x04)
	float ReviveHealth; // 0x344(0x04)
	bool bDroneVisibility; // 0x348(0x01)
	bool bDroneVulnerability; // 0x349(0x01)
	bool bOngoingReviveEffectsActive; // 0x34a(0x01)
	char UnknownData_34B[0x1]; // 0x34b(0x01)
	struct FWeakObjectPtr<struct AKSCharacter> TargetCharacter; // 0x34c(0x08)
	enum class EReviveDroneState MovementStage; // 0x354(0x01)
	enum class EReviveDroneFlightPath FlightPath; // 0x355(0x01)
	char UnknownData_356[0x2]; // 0x356(0x02)
	float PreferredHoverHeight; // 0x358(0x04)
	float TransitHeight; // 0x35c(0x04)
	float HoverCorrectionTime; // 0x360(0x04)
	float DepartureHeight; // 0x364(0x04)
	bool bUseCustomReviveTime; // 0x368(0x01)
	char UnknownData_369[0x3]; // 0x369(0x03)
	float CustomReviveTime; // 0x36c(0x04)
	bool bInheritReviveTimeMods; // 0x370(0x01)
	bool DrawOutline; // 0x371(0x01)
	char OutlineStencilColor; // 0x372(0x01)
	char UnknownData_373[0x5]; // 0x373(0x05)
	struct UKSPlayerMod* ApplyOnReleaseMod; // 0x378(0x08)
	bool bDrawEnemyDroneOutline; // 0x380(0x01)
	char UnknownData_381[0x7]; // 0x381(0x07)
	struct UKSItemStimuliSourceComponent* StimuliSourceComponent; // 0x388(0x08)

	void TargetStartGuaranteedRevive(struct AKSCharacter* InCharacter); // Function Killstreak.KSAgent_RevivalDrone.TargetStartGuaranteedRevive
	void StartReviveEffects(); // Function Killstreak.KSAgent_RevivalDrone.StartReviveEffects
	void SetOutlineVisibility(bool UseOutline); // Function Killstreak.KSAgent_RevivalDrone.SetOutlineVisibility
	void SetFriendlyOutlineVisibility(bool UseOutline); // Function Killstreak.KSAgent_RevivalDrone.SetFriendlyOutlineVisibility
	void OnTargetKilled(struct AKSCharacterBase* Killer, struct AKSCharacterBase* Killed); // Function Killstreak.KSAgent_RevivalDrone.OnTargetKilled
	void OnReviveEnd(struct AKSCharacter* RevivingCharacter, bool SuccessfulRevive); // Function Killstreak.KSAgent_RevivalDrone.OnReviveEnd
	void OnRep_OngoingReviveEffectsActive(); // Function Killstreak.KSAgent_RevivalDrone.OnRep_OngoingReviveEffectsActive
	void OnRep_DroneVulnerability(); // Function Killstreak.KSAgent_RevivalDrone.OnRep_DroneVulnerability
	void OnRep_DroneVisibility(); // Function Killstreak.KSAgent_RevivalDrone.OnRep_DroneVisibility
	float GetReviveProgress(); // Function Killstreak.KSAgent_RevivalDrone.GetReviveProgress
	enum class EReviveDroneState GetMovementStage(); // Function Killstreak.KSAgent_RevivalDrone.GetMovementStage
	enum class EReviveDroneFlightPath GetFlightPath(); // Function Killstreak.KSAgent_RevivalDrone.GetFlightPath
	void EventStartReviveEffects(); // Function Killstreak.KSAgent_RevivalDrone.EventStartReviveEffects
	void EventOngoingReviveEffectsStarted(); // Function Killstreak.KSAgent_RevivalDrone.EventOngoingReviveEffectsStarted
	void EventEndReviveEffects(); // Function Killstreak.KSAgent_RevivalDrone.EventEndReviveEffects
	void BroadcastMovementState(enum class EReviveDroneState State); // Function Killstreak.KSAgent_RevivalDrone.BroadcastMovementState
	void BroadcastEndReviveEffects(); // Function Killstreak.KSAgent_RevivalDrone.BroadcastEndReviveEffects
	void BroadcastDroneVulnerability(bool Vulnerable); // Function Killstreak.KSAgent_RevivalDrone.BroadcastDroneVulnerability
	void BroadcastDroneVisibility(bool Visible); // Function Killstreak.KSAgent_RevivalDrone.BroadcastDroneVisibility
	void BeginRevive(); // Function Killstreak.KSAgent_RevivalDrone.BeginRevive
	void ApplyDroneVulnerabilityInternal(); // Function Killstreak.KSAgent_RevivalDrone.ApplyDroneVulnerabilityInternal
	void ApplyDroneVisibilityInternal(); // Function Killstreak.KSAgent_RevivalDrone.ApplyDroneVisibilityInternal
	void ActivateDroneOngoingEffects(); // Function Killstreak.KSAgent_RevivalDrone.ActivateDroneOngoingEffects
};

// Class Killstreak.KSAIActorCollection
// Size: 0xe0 (Inherited: 0xb0)
struct UKSAIActorCollection : public UActorComponent {
	struct TArray<struct AKSDropLocation*> DropLocations; // 0xb0(0x10)
	struct UDataTable* BotNameTable; // 0xc0(0x08)
	char UnknownData_C8[0x18]; // 0xc8(0x18)
};

// Class Killstreak.KSAIActorCollection_Extraction
// Size: 0xf0 (Inherited: 0xe0)
struct UKSAIActorCollection_Extraction : public UKSAIActorCollection {
	struct TArray<struct AKSDefensePoint*> DefensePoints; // 0xe0(0x10)
};

// Class Killstreak.KSAIController
// Size: 0x5b0 (Inherited: 0x328)
struct AKSAIController : public AAIController {
	char UnknownData_328[0x50]; // 0x328(0x50)
	struct AKSCharacterBase* KSCharacter; // 0x378(0x08)
	struct AKSCharacter* CachedKSCharacter; // 0x380(0x08)
	struct AKSWayPointSet* WayPointSet; // 0x388(0x08)
	bool bShouldReverseWayPointSetDirection; // 0x390(0x01)
	char UnknownData_391[0x17]; // 0x391(0x17)
	struct AKSPlayerShop* Shop; // 0x3a8(0x08)
	char UnknownData_3B0[0x30]; // 0x3b0(0x30)
	struct AActor* StartPointToSpawnAt; // 0x3e0(0x08)
	struct AKSCharacter* CharacterToSpawn; // 0x3e8(0x08)
	struct UBehaviorTree* TreeToRun; // 0x3f0(0x08)
	struct UKSBTDifficulty* InitialDifficulty; // 0x3f8(0x08)
	struct UKSBTDifficulty* CachedDifficulty; // 0x400(0x08)
	char UnknownData_408[0x8]; // 0x408(0x08)
	struct UDataTable* DifficultyTable; // 0x410(0x08)
	struct FKSBTDifficultyConfig SpawnDifficultyConfig; // 0x418(0x78)
	struct UDataTable* ObjectivePriorityTable; // 0x490(0x08)
	struct UDataTable* ItemPriorityTable; // 0x498(0x08)
	struct UDataTable* AbilityTable; // 0x4a0(0x08)
	struct FKSInitialLoadout InitialLoadout; // 0x4a8(0x10)
	char UnknownData_4B8[0x18]; // 0x4b8(0x18)
	struct UKSAIPerceptionComponent* KSAIPerception; // 0x4d0(0x08)
	char UnknownData_4D8[0x28]; // 0x4d8(0x28)
	struct AActor* ActorForFocalOffset; // 0x500(0x08)
	char UnknownData_508[0x10]; // 0x508(0x10)
	float CrowdCollisionQueryRange; // 0x518(0x04)
	float CrowdPathOptimizationRange; // 0x51c(0x04)
	float CrowdAvoidanceRangeMultiplier; // 0x520(0x04)
	float CrowdSeparationWeight; // 0x524(0x04)
	bool bStartWithCrowdFollowing; // 0x528(0x01)
	char UnknownData_529[0x3]; // 0x529(0x03)
	int32_t TeamNumber; // 0x52c(0x04)
	char UnknownData_530[0x30]; // 0x530(0x30)
	struct FGameplayTagQuery AllowedJobQuery; // 0x560(0x48)
	char UnknownData_5A8[0x8]; // 0x5a8(0x08)

	void SetNavigationInteractTarget(struct TSoftObjectPtr<struct AActor> InteractTargetIn); // Function Killstreak.KSAIController.SetNavigationInteractTarget
	void OnPawnKilled(struct AKSCharacterBase* KillerCharacter, struct AKSCharacterBase* KilledCharacter); // Function Killstreak.KSAIController.OnPawnKilled
	void OnCosmeticLoadoutComplete(); // Function Killstreak.KSAIController.OnCosmeticLoadoutComplete
	void HandleTeamSidesFlipped(); // Function Killstreak.KSAIController.HandleTeamSidesFlipped
	void HandleJobChanged(); // Function Killstreak.KSAIController.HandleJobChanged
	struct AKSCharacter* GetOwnedCharacter(); // Function Killstreak.KSAIController.GetOwnedCharacter
	struct AActor* GetNavigationInteractTarget(); // Function Killstreak.KSAIController.GetNavigationInteractTarget
	struct UKSAIPerceptionComponent* GetKSPerceptionComponent(); // Function Killstreak.KSAIController.GetKSPerceptionComponent
	void ClearNavigationInteractTarget(); // Function Killstreak.KSAIController.ClearNavigationInteractTarget
};

// Class Killstreak.KSAIDifficultyComponent
// Size: 0x1d0 (Inherited: 0xb0)
struct UKSAIDifficultyComponent : public UActorComponent {
	struct UKSBTDifficulty* Difficulty; // 0xb0(0x08)
	struct UDataTable* DifficultyTable; // 0xb8(0x08)
	bool AllowDynamicDifficulty; // 0xc0(0x01)
	char UnknownData_C1[0x7]; // 0xc1(0x07)
	struct FKSBTDifficultyConfig DifficultySpawnConfig; // 0xc8(0x78)
	float AccuracyMultiplierStandard; // 0x140(0x04)
	float AccuracyMultiplierThrownMelee; // 0x144(0x04)
	float AccuracyMultiplierWhenBlinded; // 0x148(0x04)
	float AccuracyMultiplierWhenCrosshairHidden; // 0x14c(0x04)
	float NewTargetAccuracyMultiplier; // 0x150(0x04)
	float NewTargetTime; // 0x154(0x04)
	float AttackDelayClipPercentMin; // 0x158(0x04)
	float AttackDelayClipPercentMax; // 0x15c(0x04)
	float AttackDelay; // 0x160(0x04)
	float DamageDealtMultiplier; // 0x164(0x04)
	float HeadshotDamageDealtMultiplier; // 0x168(0x04)
	float DamageTakenMultiplier; // 0x16c(0x04)
	float HeadshotDamageTakenMultiplier; // 0x170(0x04)
	float AimForHeadshotProbability; // 0x174(0x04)
	float DodgeRollProbability; // 0x178(0x04)
	float StrafeProbability; // 0x17c(0x04)
	float ThrowGrenadeProbability; // 0x180(0x04)
	float ThrowMeleeProbability; // 0x184(0x04)
	float PerceptionStrengthMin; // 0x188(0x04)
	float PerceptionStrengthMax; // 0x18c(0x04)
	float PerceptionStrength; // 0x190(0x04)
	char UnknownData_194[0x4]; // 0x194(0x04)
	struct TArray<struct UKSBTAction*> AllowedActions; // 0x198(0x10)
	struct TArray<struct UKSBTAction*> DisallowedActions; // 0x1a8(0x10)
	float SpeedMultiplier; // 0x1b8(0x04)
	struct FWeakObjectPtr<struct AKSWeapon> LastFiredWeapon; // 0x1bc(0x08)
	int32_t AttacksSinceLastAttackDelay; // 0x1c4(0x04)
	int32_t AttacksNeededToTriggerAttackDelay; // 0x1c8(0x04)
	char UnknownData_1CC[0x4]; // 0x1cc(0x04)

	struct UKSBTDifficulty* GetCurrentDifficulty(); // Function Killstreak.KSAIDifficultyComponent.GetCurrentDifficulty
	void ChangeDifficulty(struct UKSBTDifficulty* DifficultyIn); // Function Killstreak.KSAIDifficultyComponent.ChangeDifficulty
};

// Class Killstreak.KSAIItemPriorityComponent
// Size: 0xc0 (Inherited: 0xb0)
struct UKSAIItemPriorityComponent : public UActorComponent {
	struct TArray<struct FKSBTItemPriorityTableRow> ItemPriorities; // 0xb0(0x10)

	void InsertPriority(struct FKSBTItemPriorityTableRow ItemPriority); // Function Killstreak.KSAIItemPriorityComponent.InsertPriority
	void InsertPriorities(struct UDataTable* ItemPriorityTable); // Function Killstreak.KSAIItemPriorityComponent.InsertPriorities
	float GetWeightByName(struct FString ItemName); // Function Killstreak.KSAIItemPriorityComponent.GetWeightByName
	float GetWeight(struct TSoftObjectPtr<struct UKSItem> Item); // Function Killstreak.KSAIItemPriorityComponent.GetWeight
	float GetShopPurchaseWeightByName(struct FString ItemName); // Function Killstreak.KSAIItemPriorityComponent.GetShopPurchaseWeightByName
	float GetShopPurchaseWeight(struct TSoftObjectPtr<struct UKSItem> Item); // Function Killstreak.KSAIItemPriorityComponent.GetShopPurchaseWeight
	float GetShopPriorityGroupByName(struct FString ItemName); // Function Killstreak.KSAIItemPriorityComponent.GetShopPriorityGroupByName
	float GetShopPriorityGroup(struct TSoftObjectPtr<struct UKSItem> Item); // Function Killstreak.KSAIItemPriorityComponent.GetShopPriorityGroup
	float GetPriorityMultiplierByName(struct FString ItemName); // Function Killstreak.KSAIItemPriorityComponent.GetPriorityMultiplierByName
	float GetPriorityMultiplier(struct TSoftObjectPtr<struct UKSItem> Item); // Function Killstreak.KSAIItemPriorityComponent.GetPriorityMultiplier
	void ClearPriorities(); // Function Killstreak.KSAIItemPriorityComponent.ClearPriorities
};

// Class Killstreak.KSAimAssistActor
// Size: 0x2b0 (Inherited: 0x220)
struct AKSAimAssistActor : public AActor {
	char UnknownData_220[0x10]; // 0x220(0x10)
	int32_t TeamNumOverride; // 0x230(0x04)
	char UnknownData_234[0x4]; // 0x234(0x04)
	struct UKSAimAssistAnchorComponent* AimAssistAnchor; // 0x238(0x08)
	char UnknownData_240[0x8]; // 0x240(0x08)
	struct TMap<struct FName, enum class EHitLocationType> BoneToHitLocationTypeMap; // 0x248(0x50)
	bool bCanBeKilled; // 0x298(0x01)
	char UnknownData_299[0x3]; // 0x299(0x03)
	float MaxHealth; // 0x29c(0x04)
	bool bLocallyKilled; // 0x2a0(0x01)
	char UnknownData_2A1[0x3]; // 0x2a1(0x03)
	struct FAimAssistActorHealthInfo HealthInfo; // 0x2a4(0x08)
	char UnknownData_2AC[0x4]; // 0x2ac(0x04)

	void ResetHealth(); // Function Killstreak.KSAimAssistActor.ResetHealth
	void OnRep_HealthInfo(); // Function Killstreak.KSAimAssistActor.OnRep_HealthInfo
	void OnKilled(); // Function Killstreak.KSAimAssistActor.OnKilled
	float ModifyIncomingDamageTaken(float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser, struct AActor* DamagedActor); // Function Killstreak.KSAimAssistActor.ModifyIncomingDamageTaken
	bool IsValidIncomingDamage(struct UDamageType* DamageTypeClass, struct AController* EventInstigator, struct AActor* DamageCauser, struct AActor* DamagedActor); // Function Killstreak.KSAimAssistActor.IsValidIncomingDamage
	struct FVector GetAAHeadLocation(); // Function Killstreak.KSAimAssistActor.GetAAHeadLocation
	struct FVector GetAABodyLocation(); // Function Killstreak.KSAimAssistActor.GetAABodyLocation
	bool CanBeHitByWeapon(struct UKSWeaponAsset* Weapon); // Function Killstreak.KSAimAssistActor.CanBeHitByWeapon
	bool AimAssistRightNow(struct AKSPlayerController* PlayerController); // Function Killstreak.KSAimAssistActor.AimAssistRightNow
};

// Class Killstreak.KSAimAssistAnchorComponent
// Size: 0x460 (Inherited: 0x450)
struct UKSAimAssistAnchorComponent : public USphereComponent {
	float AimAssistPriority; // 0x450(0x04)
	char UnknownData_454[0xc]; // 0x454(0x0c)
};

// Class Killstreak.KSAimAssistComponent
// Size: 0x140 (Inherited: 0xb0)
struct UKSAimAssistComponent : public UActorComponent {
	struct AKSPlayerController* PlayerOwner; // 0xb0(0x08)
	struct TArray<struct FRankedAimAssistTarget> AssistTargetStack; // 0xb8(0x10)
	float CurrentTargetWeightStickiness; // 0xc8(0x04)
	float ProjectionSpaceStackBoundary; // 0xcc(0x04)
	bool bUseStackBoundaryFovScaling; // 0xd0(0x01)
	char UnknownData_D1[0x3]; // 0xd1(0x03)
	float FovBaseline; // 0xd4(0x04)
	struct UCurveFloat* AimAssistEffectivenessCurve; // 0xd8(0x08)
	enum class EKSAimAssistActivationType ActivationType; // 0xe0(0x01)
	enum class EKSAimAssistInputFlag FrictionAllowedInputMode; // 0xe1(0x01)
	enum class EKSAimAssistInputFlag LockAllowedInputMode; // 0xe2(0x01)
	enum class EKSAimAssistInputFlag SnapAllowedInputMode; // 0xe3(0x01)
	enum class EKSAimAssistInputFlag CorrectionAllowedInputMode; // 0xe4(0x01)
	char UnknownData_E5[0x7]; // 0xe5(0x07)
	bool bAssistGadgets; // 0xec(0x01)
	bool bAimLockUsesTargetVelocity; // 0xed(0x01)
	bool bAimLockMeshSmoothCompensation; // 0xee(0x01)
	bool bAimLockUsesOwnVelocity; // 0xef(0x01)
	bool bComplexAimLockDeltaRotCalculation; // 0xf0(0x01)
	bool bComplexLookLocationCalculation; // 0xf1(0x01)
	char UnknownData_F2[0x2]; // 0xf2(0x02)
	float MaxAimLockEvaluationInterval; // 0xf4(0x04)
	bool bOldLockValid; // 0xf8(0x01)
	char UnknownData_F9[0x3]; // 0xf9(0x03)
	struct FRotator OldLockDeltaRot; // 0xfc(0x0c)
	struct FVector OldLockRelativeLocation; // 0x108(0x0c)
	struct FRotator OldInputRot; // 0x114(0x0c)
	struct UObject* LastAimAssistTarget; // 0x120(0x08)
	bool bLastTargetCrouching; // 0x128(0x01)
	char UnknownData_129[0x3]; // 0x129(0x03)
	struct FVector2D LastLockAssistPosition; // 0x12c(0x08)
	float LastBoundaryFactor; // 0x134(0x04)
	float AimAssistVisibilityUpdatePeriod; // 0x138(0x04)
	char UnknownData_13C[0x4]; // 0x13c(0x04)

	bool GetScaledProjectionBoundsForActor(struct APlayerController* Player, struct AActor* InActor, struct FBox2D OutBounds); // Function Killstreak.KSAimAssistComponent.GetScaledProjectionBoundsForActor
	float GetProjectionSpaceStackBoundary(); // Function Killstreak.KSAimAssistComponent.GetProjectionSpaceStackBoundary
	struct AKSPlayerController* GetPlayerOwner(); // Function Killstreak.KSAimAssistComponent.GetPlayerOwner
	float GetAssistRingScreenSize(struct APlayerController* Player, float ProjectionSpaceSize); // Function Killstreak.KSAimAssistComponent.GetAssistRingScreenSize
	bool GetActorScreenBoundsForActor(struct APlayerController* Player, struct AActor* InActor, struct FBox2D OutBounds); // Function Killstreak.KSAimAssistComponent.GetActorScreenBoundsForActor
};

// Class Killstreak.KSAimAssistDataBase
// Size: 0x38 (Inherited: 0x30)
struct UKSAimAssistDataBase : public UDataAsset {
	enum class EControllerInputType JoyConFallback; // 0x30(0x01)
	enum class EControllerInputType JoyConADSFallback; // 0x31(0x01)
	enum class EControllerInputType TouchFallback; // 0x32(0x01)
	enum class EControllerInputType TouchADSFallback; // 0x33(0x01)
	enum class EControllerInputType PCGamepadADSFallback; // 0x34(0x01)
	char UnknownData_35[0x3]; // 0x35(0x03)
};

// Class Killstreak.KSAimCorrectionData
// Size: 0x128 (Inherited: 0x38)
struct UKSAimCorrectionData : public UKSAimAssistDataBase {
	struct TMap<enum class EControllerInputType, bool> AllowAimCorrection; // 0x38(0x50)
	struct TMap<enum class EControllerInputType, float> AimCorrectionOffset; // 0x88(0x50)
	struct TMap<enum class EControllerInputType, float> AimCorrectionRange; // 0xd8(0x50)
};

// Class Killstreak.KSAimFrictionData
// Size: 0x128 (Inherited: 0x38)
struct UKSAimFrictionData : public UKSAimAssistDataBase {
	struct TMap<enum class EControllerInputType, bool> RequireInputForAimFriction; // 0x38(0x50)
	struct TMap<enum class EControllerInputType, struct UCurveVector*> AimFrictionCurve; // 0x88(0x50)
	struct TMap<enum class EControllerInputType, struct UCurveFloat*> AimFrictionDistanceCurve; // 0xd8(0x50)
};

// Class Killstreak.KSAimLockData
// Size: 0x128 (Inherited: 0x38)
struct UKSAimLockData : public UKSAimAssistDataBase {
	struct TMap<enum class EControllerInputType, bool> RequireInputForAimLock; // 0x38(0x50)
	struct TMap<enum class EControllerInputType, struct UCurveVector*> AimLockCurve; // 0x88(0x50)
	struct TMap<enum class EControllerInputType, struct UCurveFloat*> AimLockDistanceCurve; // 0xd8(0x50)
};

// Class Killstreak.KSAimSnapData
// Size: 0x128 (Inherited: 0x38)
struct UKSAimSnapData : public UKSAimAssistDataBase {
	struct TMap<enum class EControllerInputType, struct FRotator> MaxAimSnapRotation; // 0x38(0x50)
	struct TMap<enum class EControllerInputType, struct UCurveFloat*> AimSnapDistanceCurve; // 0x88(0x50)
	struct TMap<enum class EControllerInputType, struct UCurveVector*> AimSnapCurve; // 0xd8(0x50)
};

// Class Killstreak.KSAIObjectivePriorityComponent
// Size: 0x118 (Inherited: 0xb0)
struct UKSAIObjectivePriorityComponent : public UActorComponent {
	struct UDataTable* ObjectivePriorityTable; // 0xb0(0x08)
	struct TMap<struct FName, struct FKSBTObjectivePriorityTableRow> ObjectivePriorities; // 0xb8(0x50)
	struct TArray<struct FKSBTObjectivePriorityTableRow> SortedPriorities; // 0x108(0x10)

	void UpdatePriority(struct FName Key, struct FKSBTObjectivePriorityTableRow ObjectivePriority, bool ShouldResort); // Function Killstreak.KSAIObjectivePriorityComponent.UpdatePriority
	void UpdatePriorities(struct UDataTable* ObjectivePriorityTableIn); // Function Killstreak.KSAIObjectivePriorityComponent.UpdatePriorities
	void Setup(struct UDataTable* ObjectivePriorityTableIn); // Function Killstreak.KSAIObjectivePriorityComponent.Setup
	void InsertPriority(struct FName Key, struct FKSBTObjectivePriorityTableRow ObjectivePriority, bool ShouldResort); // Function Killstreak.KSAIObjectivePriorityComponent.InsertPriority
	void InsertPriorities(struct UDataTable* ObjectivePriorityTableIn); // Function Killstreak.KSAIObjectivePriorityComponent.InsertPriorities
	float GetPriority(struct FName Key); // Function Killstreak.KSAIObjectivePriorityComponent.GetPriority
	void ClearPriorities(); // Function Killstreak.KSAIObjectivePriorityComponent.ClearPriorities
	void ApplyPrioritiesFromDifficulty(struct UDataTable* ObjectivePriorityTableIn); // Function Killstreak.KSAIObjectivePriorityComponent.ApplyPrioritiesFromDifficulty
};

// Class Killstreak.KSAISense_MapPoint
// Size: 0x90 (Inherited: 0x80)
struct UKSAISense_MapPoint : public UAISense {
	struct TArray<struct FKSAIMapPointStimulusEvent> RegisteredEvents; // 0x80(0x10)
};

// Class Killstreak.KSAISense_Objective
// Size: 0xf8 (Inherited: 0xe8)
struct UKSAISense_Objective : public UAISense_Hearing {
	struct TArray<struct FAIObjectiveEvent> ObjectiveEvents; // 0xe8(0x10)

	void ReportObjectiveEvent(struct UObject* WorldContextObject, struct FVector ObjectiveLocation, float Loudness, struct AActor* Instigator, float MaxRange, struct FName Tag); // Function Killstreak.KSAISense_Objective.ReportObjectiveEvent
};

// Class Killstreak.KSAISense_Player
// Size: 0x90 (Inherited: 0x80)
struct UKSAISense_Player : public UAISense {
	struct TArray<struct FKSAIPlayerStimulusEvent> RegisteredEvents; // 0x80(0x10)
};

// Class Killstreak.KSAISense_Team
// Size: 0x90 (Inherited: 0x80)
struct UKSAISense_Team : public UAISense {
	struct TArray<struct FKSAITeamStimulusEvent> RegisteredEvents; // 0x80(0x10)
};

// Class Killstreak.KSAISenseEvent_Objective
// Size: 0x58 (Inherited: 0x28)
struct UKSAISenseEvent_Objective : public UAISenseEvent {
	struct FAIObjectiveEvent Event; // 0x28(0x30)
};

// Class Killstreak.KSAkComponent
// Size: 0x430 (Inherited: 0x3f0)
struct UKSAkComponent : public UAkComponent {
	enum class EOcclusionType OcclusionType; // 0x3f0(0x01)
	char UnknownData_3F1[0x3]; // 0x3f1(0x03)
	float MinTimeBetweenOcclusionUpdates; // 0x3f4(0x04)
	float OcclusionDistanceMultiplier; // 0x3f8(0x04)
	int32_t OcclusionInterpolationMilliseconds; // 0x3fc(0x04)
	float CurrentObstruction; // 0x400(0x04)
	float CurrentOcclusion; // 0x404(0x04)
	char UnknownData_408[0x4]; // 0x408(0x04)
	bool RequiresListenerDistance; // 0x40c(0x01)
	char UnknownData_40D[0x3]; // 0x40d(0x03)
	float MinTimeBetweenDistanceUpdates; // 0x410(0x04)
	char UnknownData_414[0x4]; // 0x414(0x04)
	bool RequiresListenerDirection; // 0x418(0x01)
	char UnknownData_419[0x3]; // 0x419(0x03)
	float MinTimeBetweenDirectionUpdates; // 0x41c(0x04)
	char UnknownData_420[0x8]; // 0x420(0x08)
	struct UBakedOcclusionLUT* LUT; // 0x428(0x08)
};

// Class Killstreak.KSAkAmbientSound
// Size: 0x260 (Inherited: 0x220)
struct AKSAkAmbientSound : public AActor {
	struct UAkAudioEvent* AkAudioEvent; // 0x220(0x08)
	struct UKSAkAmbientComponent* AkComponent; // 0x228(0x08)
	bool StopWhenOwnerIsDestroyed; // 0x230(0x01)
	bool AutoPost; // 0x231(0x01)
	bool ForceNoTickingOnAkComponent; // 0x232(0x01)
	char UnknownData_233[0x2d]; // 0x233(0x2d)

	void StopAmbientSound(); // Function Killstreak.KSAkAmbientSound.StopAmbientSound
	void StopAllKSAmbientSounds(struct UObject* WorldContextObject); // Function Killstreak.KSAkAmbientSound.StopAllKSAmbientSounds
	void StartAmbientSound(); // Function Killstreak.KSAkAmbientSound.StartAmbientSound
	void StartAllKSAmbientSounds(struct UObject* WorldContextObject); // Function Killstreak.KSAkAmbientSound.StartAllKSAmbientSounds
};

// Class Killstreak.KSItemDrop
// Size: 0x360 (Inherited: 0x220)
struct AKSItemDrop : public AActor {
	char UnknownData_220[0x18]; // 0x220(0x18)
	struct UKSInteractionBlockerManager* InteractionBlockerManager; // 0x238(0x08)
	char UnknownData_240[0x10]; // 0x240(0x10)
	struct TArray<struct AKSCharacter*> AllowedCharacters; // 0x250(0x10)
	float ItemDropInteractDuration; // 0x260(0x04)
	bool bIsInstantPickup; // 0x264(0x01)
	bool bAllowManualInstantPickup; // 0x265(0x01)
	char UnknownData_266[0x2]; // 0x266(0x02)
	struct UKSItemStimuliSourceComponent* StimuliSourceComponent; // 0x268(0x08)
	struct FVector SightOffset; // 0x270(0x0c)
	char UnknownData_27C[0x4]; // 0x27c(0x04)
	struct TArray<struct AActor*> ActorsSeenBy; // 0x280(0x10)
	struct UKSItem* ItemAsset; // 0x290(0x08)
	struct UKSInteractionType* InteractionType; // 0x298(0x08)
	bool bDestroyOnPickUp; // 0x2a0(0x01)
	char UnknownData_2A1[0x7]; // 0x2a1(0x07)
	struct FMulticastInlineDelegate OnItemPickup; // 0x2a8(0x10)
	char UnknownData_2B8[0x20]; // 0x2b8(0x20)
	struct AKSCharacter* PendingPickupCharacter; // 0x2d8(0x08)
	struct UKSInteractionManager* CurrentInteractionManager; // 0x2e0(0x08)
	struct UKSStaticMeshComponent* CollisionMesh; // 0x2e8(0x08)
	char UnknownData_2F0[0x3]; // 0x2f0(0x03)
	enum class EPlayerSilhouetteType InactiveStencilValue; // 0x2f3(0x01)
	enum class EPlayerSilhouetteType ActiveStencilValue; // 0x2f4(0x01)
	char UnknownData_2F5[0x3]; // 0x2f5(0x03)
	struct FRotator LootSiteSpawnRotation; // 0x2f8(0x0c)
	char UnknownData_304[0x4]; // 0x304(0x04)
	struct FGameplayTagContainer SkinTagContainer; // 0x308(0x20)
	char UnknownData_328[0x18]; // 0x328(0x18)
	struct AController* DropHidePlayer; // 0x340(0x08)
	bool bClientDropUnhide; // 0x348(0x01)
	char UnknownData_349[0x3]; // 0x349(0x03)
	int32_t OriginalOwnerId; // 0x34c(0x04)
	bool bIsPlayerDrop; // 0x350(0x01)
	char UnknownData_351[0x7]; // 0x351(0x07)
	struct UAkAudioEvent* PickupSound; // 0x358(0x08)

	bool ShouldShowViewedItemLabel(); // Function Killstreak.KSItemDrop.ShouldShowViewedItemLabel
	void SetInactiveStencilValue(enum class EPlayerSilhouetteType Value); // Function Killstreak.KSItemDrop.SetInactiveStencilValue
	void SetActiveStencilValue(enum class EPlayerSilhouetteType Value); // Function Killstreak.KSItemDrop.SetActiveStencilValue
	void PlayDestroyedEffects(); // Function Killstreak.KSItemDrop.PlayDestroyedEffects
	bool Pickup(struct AKSCharacter* Receiver, bool bActivate); // Function Killstreak.KSItemDrop.Pickup
	void OverridePickupFunction(struct FDelegate ItemPickupOverride); // Function Killstreak.KSItemDrop.OverridePickupFunction
	void OnRootMeshDetached(struct UKSStaticMeshComponent* ResponsibleMesh); // Function Killstreak.KSItemDrop.OnRootMeshDetached
	void OnRep_PendingPickupCharacter(); // Function Killstreak.KSItemDrop.OnRep_PendingPickupCharacter
	void OnRep_ItemAsset(); // Function Killstreak.KSItemDrop.OnRep_ItemAsset
	void OnRep_DropHidePlayer(); // Function Killstreak.KSItemDrop.OnRep_DropHidePlayer
	struct FDelegate GetPickupDelegate(); // Function Killstreak.KSItemDrop.GetPickupDelegate
	struct AKSCharacter* GetPendingPickupCharacter(); // Function Killstreak.KSItemDrop.GetPendingPickupCharacter
	struct FRotator GetLootSiteSpawnRotation(); // Function Killstreak.KSItemDrop.GetLootSiteSpawnRotation
	bool GetLabelInfoForSecondaryTitle(struct FText LabelText); // Function Killstreak.KSItemDrop.GetLabelInfoForSecondaryTitle
	bool GetLabelInfoForPrimaryTitle(struct FText LabelText); // Function Killstreak.KSItemDrop.GetLabelInfoForPrimaryTitle
	struct UKSItem* GetItemAsset(); // Function Killstreak.KSItemDrop.GetItemAsset
	void EndOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Killstreak.KSItemDrop.EndOverlap
	bool CanBePickedUpByCharacterInternal(struct AKSCharacter* Receiver); // Function Killstreak.KSItemDrop.CanBePickedUpByCharacterInternal
	bool CanBePickedUpByCharacter(struct AKSCharacter* Receiver); // Function Killstreak.KSItemDrop.CanBePickedUpByCharacter
	void CalculateRandomImpulse(struct FVector LinearImpulse, struct FVector AngularImpulse); // Function Killstreak.KSItemDrop.CalculateRandomImpulse
	void BeginOverlap(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Killstreak.KSItemDrop.BeginOverlap
	void AsyncItemGiveComplete(struct UKSItem* Item, struct UObject* GivenObject, struct FGiveItemParameters InGiveItemParameters, bool bSuccess); // Function Killstreak.KSItemDrop.AsyncItemGiveComplete
	void ApplyRandomImpulse(); // Function Killstreak.KSItemDrop.ApplyRandomImpulse
	void AllowPickup(struct AKSCharacter* Character); // Function Killstreak.KSItemDrop.AllowPickup
};

// Class Killstreak.KSAmmoDrop
// Size: 0x368 (Inherited: 0x360)
struct AKSAmmoDrop : public AKSItemDrop {
	int32_t Amount; // 0x360(0x04)
	char UnknownData_364[0x4]; // 0x364(0x04)
};

// Class Killstreak.KSItem
// Size: 0x168 (Inherited: 0xf8)
struct UKSItem : public UPlatformInventoryItem {
	SoftClassProperty ItemDropClass; // 0xf8(0x28)
	int32_t ItemPrice; // 0x120(0x04)
	char UnknownData_124[0x4]; // 0x124(0x04)
	struct UTexture2D* DefaultItemIcon; // 0x128(0x08)
	SoftClassProperty SpecialItemWidgetClass; // 0x130(0x28)
	struct FColor ColorCode; // 0x158(0x04)
	struct FPrimaryAssetRules Rules; // 0x15c(0x0c)

	bool SoftGiveToAsync(struct TSoftObjectPtr<struct UKSItem> Item, struct AActor* Owner, struct FGiveItemParameters InGiveItemParameters, struct FDelegate GivenToEvent); // Function Killstreak.KSItem.SoftGiveToAsync
	bool SoftCreateDropAsync(struct TSoftObjectPtr<struct UKSItem> Item, struct FTransform SpawnTransform, struct UObject* WorldContextObject, struct FDropItemParameters InDropItemParameters, struct FDelegate ItemDroppedEvent, bool bEnablePhysics, struct FVector InSpawnLinearVelocity, struct FVector InSpawnAngularVelocity); // Function Killstreak.KSItem.SoftCreateDropAsync
	void InitNewlyCreatedItem(int64_t InItemId); // Function Killstreak.KSItem.InitNewlyCreatedItem
	bool GiveToAsync(struct UKSItem* Item, struct AActor* Owner, struct FGiveItemParameters InGiveItemParameters, struct FDelegate GivenToEvent); // Function Killstreak.KSItem.GiveToAsync
	bool GiveTo(struct UKSItem* Item, struct AActor* Owner, struct FGiveItemParameters InGiveItemParameters, struct UObject* OutObject); // Function Killstreak.KSItem.GiveTo
	SoftClassProperty GetSpecialItemWidgetClass(); // Function Killstreak.KSItem.GetSpecialItemWidgetClass
	struct TSoftObjectPtr<struct UTexture2D> GetPurchasePreviewIcon(); // Function Killstreak.KSItem.GetPurchasePreviewIcon
	int32_t GetItemPrice(); // Function Killstreak.KSItem.GetItemPrice
	SoftClassProperty GetItemDropClass(); // Function Killstreak.KSItem.GetItemDropClass
	struct TArray<struct FItemDisplayStat> GetItemDisplayStats(); // Function Killstreak.KSItem.GetItemDisplayStats
	struct FText GetItemCategoryText(); // Function Killstreak.KSItem.GetItemCategoryText
	struct FColor GetColorCode(); // Function Killstreak.KSItem.GetColorCode
	bool CreateDropAsync(struct UKSItem* Item, struct FTransform SpawnTransform, struct UObject* WorldContextObject, struct FDropItemParameters InDropItemParameters, struct FDelegate ItemDroppedEvent, bool bEnablePhysics, struct FVector InSpawnLinearVelocity, struct FVector InSpawnAngularVelocity); // Function Killstreak.KSItem.CreateDropAsync
	struct AKSItemDrop* CreateDrop(struct UKSItem* Item, struct FTransform SpawnTransform, struct UObject* WorldContextObject, struct FDropItemParameters InDropItemParameters); // Function Killstreak.KSItem.CreateDrop
	bool CanBePickedUpByCharacter(struct AKSCharacter* PotentialOwner); // Function Killstreak.KSItem.CanBePickedUpByCharacter
	bool CanBePickedUpBy(struct AActor* PotentialOwner); // Function Killstreak.KSItem.CanBePickedUpBy
};

// Class Killstreak.KSAmmoDropAsset
// Size: 0x170 (Inherited: 0x168)
struct UKSAmmoDropAsset : public UKSItem {
	enum class EAmmoType AmmoType; // 0x168(0x01)
	char UnknownData_169[0x3]; // 0x169(0x03)
	int32_t AmmoCount; // 0x16c(0x04)

	enum class EAmmoType GetAmmoType(); // Function Killstreak.KSAmmoDropAsset.GetAmmoType
};

// Class Killstreak.KSAnalogStickFilter
// Size: 0x38 (Inherited: 0x28)
struct UKSAnalogStickFilter : public UObject {
	enum class EKSAnalogStickType StickType; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)
	struct UKSPlayerInput* PlayerInput; // 0x30(0x08)
};

// Class Killstreak.KSAnimationAuditComponent
// Size: 0xb8 (Inherited: 0xb0)
struct UKSAnimationAuditComponent : public UActorComponent {
	struct UKSAnimInstance* CurrentAnimInst; // 0xb0(0x08)

	void AnimAuditStop(struct UKSAnimInstance* AnimInst, bool bExportImmediately); // Function Killstreak.KSAnimationAuditComponent.AnimAuditStop
	void AnimAuditStart(struct UKSAnimInstance* AnimInst); // Function Killstreak.KSAnimationAuditComponent.AnimAuditStart
	void AnimAuditClear(struct UKSAnimInstance* AnimInst); // Function Killstreak.KSAnimationAuditComponent.AnimAuditClear
};

// Class Killstreak.KSAnimInstance
// Size: 0x290 (Inherited: 0x270)
struct UKSAnimInstance : public USkinnedAnimInstance {
	bool bIsInLobbyViewer; // 0x270(0x01)
	bool bRecordAnimStats; // 0x271(0x01)
	char UnknownData_272[0x6]; // 0x272(0x06)
	struct UKSAnimationAuditComponent* AuditingComponent; // 0x278(0x08)
	char UnknownData_280[0x10]; // 0x280(0x10)

	void SetLobbyState(bool bInModelViewer); // Function Killstreak.KSAnimInstance.SetLobbyState
	void Montage_JumpToRandomSection(struct TArray<struct FName> SectionNames, struct UAnimMontage* Montage, bool bDisallowCurrentSection); // Function Killstreak.KSAnimInstance.Montage_JumpToRandomSection
};

// Class Killstreak.KSAnimNotify_EmotionDuration
// Size: 0x40 (Inherited: 0x38)
struct UKSAnimNotify_EmotionDuration : public UAnimNotify {
	enum class EKSEmotion Emotion; // 0x38(0x01)
	char UnknownData_39[0x3]; // 0x39(0x03)
	float Duration; // 0x3c(0x04)
};

// Class Killstreak.KSAnimNotify_PlayParticleEffect
// Size: 0xa0 (Inherited: 0x90)
struct UKSAnimNotify_PlayParticleEffect : public UAnimNotify_PlayParticleEffect {
	struct FName SkinTableRowName; // 0x90(0x08)
	char UnknownData_98[0x8]; // 0x98(0x08)
};

// Class Killstreak.KSAnimNotifyState_Emotion
// Size: 0x38 (Inherited: 0x30)
struct UKSAnimNotifyState_Emotion : public UAnimNotifyState {
	enum class EKSEmotion Emotion; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
};

// Class Killstreak.KSAnimNotifyState_Prop
// Size: 0x78 (Inherited: 0x30)
struct UKSAnimNotifyState_Prop : public UAnimNotifyState {
	struct USkeletalMesh* SkeletalMesh; // 0x30(0x08)
	struct UAnimInstance* AnimClass; // 0x38(0x08)
	struct UStaticMesh* StaticMesh; // 0x40(0x08)
	struct FPoolAttachmentInfo PropAttachmentInfo; // 0x48(0x30)
};

// Class Killstreak.KSAnimNotifyState_Trail
// Size: 0x60 (Inherited: 0x58)
struct UKSAnimNotifyState_Trail : public UAnimNotifyState_Trail {
	struct FName SkinTableRowName; // 0x58(0x08)
};

// Class Killstreak.KSAnimNotifyState_WeaponProp
// Size: 0x98 (Inherited: 0x30)
struct UKSAnimNotifyState_WeaponProp : public UAnimNotifyState {
	struct FSoftObjectPath WeaponAsset; // 0x30(0x18)
	struct FName AnimClassRowNameOverride; // 0x48(0x08)
	struct UAnimMontage* ActivationMontage; // 0x50(0x08)
	struct FName PropIdentifier; // 0x58(0x08)
	float ExtendedLifetime; // 0x60(0x04)
	struct FPoolAttachmentInfo PropAttachmentInfo; // 0x64(0x30)
	char UnknownData_94[0x4]; // 0x94(0x04)
};

// Class Killstreak.KSAnnouncer
// Size: 0x458 (Inherited: 0x220)
struct AKSAnnouncer : public AInfo {
	char UnknownData_220[0x18]; // 0x220(0x18)
	struct UAkComponent* AnnouncerAkComponent; // 0x238(0x08)
	struct TMap<struct FName, struct FTimeAnnouncementList> PhaseTimeAnnouncements; // 0x240(0x50)
	struct UAkAudioEvent* SuddenDeathAnnouncement; // 0x290(0x08)
	char UnknownData_298[0x2]; // 0x298(0x02)
	uint16_t RemainingKillThreshold; // 0x29a(0x02)
	uint16_t RemainingKillThresholdAlly; // 0x29c(0x02)
	char UnknownData_29E[0x2]; // 0x29e(0x02)
	struct TMap<uint16_t, struct UAkAudioEvent*> EliminationAnnouncements; // 0x2a0(0x50)
	struct TMap<uint16_t, struct UAkAudioEvent*> EliminationAnnouncementsAlly; // 0x2f0(0x50)
	struct UAkAudioEvent* FallbackEliminationAnnouncement; // 0x340(0x08)
	struct UAkAudioEvent* FallbackEliminationAnnouncementAlly; // 0x348(0x08)
	char UnknownData_350[0x70]; // 0x350(0x70)
	struct FAnnouncementList AnnouncementList; // 0x3c0(0x88)
	char UnknownData_448[0x8]; // 0x448(0x08)
	float MaxAnnouncementDuration; // 0x450(0x04)
	char UnknownData_454[0x4]; // 0x454(0x04)

	bool ShouldPlayTimeAnnouncementFromGroup(struct TArray<struct FName> Groups); // Function Killstreak.KSAnnouncer.ShouldPlayTimeAnnouncementFromGroup
	void QueueAnnouncementStruct(struct FAnnouncement Announcement, int32_t TeamNum, bool DelayProcessing); // Function Killstreak.KSAnnouncer.QueueAnnouncementStruct
	void QueueAnnouncement(struct UAkAudioEvent* AkEvent, struct UAkAudioEvent* AltAkEvent, float Priority, float Lifetime, float Delay, float Lockout, int32_t TeamNum, bool DelayProcessing, struct AKSPlayerState* TargetPlayer, struct UAkAudioEvent* TargetPlayerAkEvent); // Function Killstreak.KSAnnouncer.QueueAnnouncement
	void ProcessTimeAnnouncementList(struct FTimeAnnouncementList TimeAnnouncementList, float Time, int32_t TeamNum); // Function Killstreak.KSAnnouncer.ProcessTimeAnnouncementList
	void ProcessQueue(); // Function Killstreak.KSAnnouncer.ProcessQueue
	void OnObjectiveTimerZero(); // Function Killstreak.KSAnnouncer.OnObjectiveTimerZero
	void OnMatchTimerUpdate(float TimeInWholeSeconds); // Function Killstreak.KSAnnouncer.OnMatchTimerUpdate
	void OnLockoutComplete(); // Function Killstreak.KSAnnouncer.OnLockoutComplete
	void OnLocalViewTargetMovementModeChanged(char OldMode, char OldCustomMode, char NewMode, char NewCustomMode); // Function Killstreak.KSAnnouncer.OnLocalViewTargetMovementModeChanged
	void OnLocalViewTargetChanged(struct AKSPlayerController* Controller, struct AActor* OldViewTarget, struct AActor* NewViewTarget); // Function Killstreak.KSAnnouncer.OnLocalViewTargetChanged
	void OnControlPointTimerUpdate(float Time); // Function Killstreak.KSAnnouncer.OnControlPointTimerUpdate
	void LocalPlayerControllerDestroyed(struct AActor* PlayerController); // Function Killstreak.KSAnnouncer.LocalPlayerControllerDestroyed
	int32_t GetTeamOverrideForAnnouncementGroup(struct TArray<struct FName> Groups); // Function Killstreak.KSAnnouncer.GetTeamOverrideForAnnouncementGroup
	struct AKSPlayerController* GetPlayerController(); // Function Killstreak.KSAnnouncer.GetPlayerController
	void EventQueueInGame(); // Function Killstreak.KSAnnouncer.EventQueueInGame
	void EventLocalPlayerControllerDestroyed(struct AKSPlayerController* PlayerController); // Function Killstreak.KSAnnouncer.EventLocalPlayerControllerDestroyed
	void AnnouncePlayerDeath(struct FCombatEventInfo CombatEvent); // Function Killstreak.KSAnnouncer.AnnouncePlayerDeath
};

// Class Killstreak.KSApparelAsset
// Size: 0x1d8 (Inherited: 0x168)
struct UKSApparelAsset : public UKSItem {
	int32_t Priority; // 0x168(0x04)
	struct FGameplayTag ApparelSlot; // 0x16c(0x08)
	char UnknownData_174[0x4]; // 0x174(0x04)
	struct FGameplayTagContainer SlotsToOverride; // 0x178(0x20)
	char UnknownData_198[0x28]; // 0x198(0x28)
	int32_t AsyncLoadPriority; // 0x1c0(0x04)
	int32_t LocalPlayerAsyncLoadPriority; // 0x1c4(0x04)
	char UnknownData_1C8[0x10]; // 0x1c8(0x10)

	struct FGameplayTag GetSlot(); // Function Killstreak.KSApparelAsset.GetSlot
};

// Class Killstreak.KSApparelAsset_SkinDataTables
// Size: 0x1f8 (Inherited: 0x1d8)
struct UKSApparelAsset_SkinDataTables : public UKSApparelAsset {
	struct TArray<struct FSoftDataTableInfo> AssetDataTables; // 0x1d8(0x10)
	struct TArray<struct FName> ApparelObjectsToInfluence; // 0x1e8(0x10)
};

// Class Killstreak.KSApparelAsset_CustomComponent
// Size: 0x220 (Inherited: 0x1f8)
struct UKSApparelAsset_CustomComponent : public UKSApparelAsset_SkinDataTables {
	SoftClassProperty CustomComponentClass; // 0x1f8(0x28)
};

// Class Killstreak.KSApparelAsset_SkinnedMesh
// Size: 0x248 (Inherited: 0x1f8)
struct UKSApparelAsset_SkinnedMesh : public UKSApparelAsset_SkinDataTables {
	SoftClassProperty MeshClass; // 0x1f8(0x28)
	struct FName AttachPointName; // 0x220(0x08)
	struct FName CollisionProfile; // 0x228(0x08)
	bool bSlaveToCharacterMesh; // 0x230(0x01)
	bool bSimulatePhysics; // 0x231(0x01)
	char UnknownData_232[0x6]; // 0x232(0x06)
	struct TArray<struct FName> ApparelObjectsToListenTo; // 0x238(0x10)
};

// Class Killstreak.KSEquipment
// Size: 0x2b0 (Inherited: 0x220)
struct AKSEquipment : public AInfo {
	bool bInitialized; // 0x220(0x01)
	char UnknownData_221[0x3]; // 0x221(0x03)
	struct FKSEquipRepInfo EquipInfo; // 0x224(0x14)
	char UnknownData_238[0x18]; // 0x238(0x18)
	struct TScriptInterface<None> EquipmentManagerOwner; // 0x250(0x10)
	struct UKSEquipmentManagerComponent* EquipmentManagerComponent; // 0x260(0x08)
	char UnknownData_268[0x18]; // 0x268(0x18)
	struct FGiveItemParameters GiveParameters; // 0x280(0x0c)
	uint16_t EquipmentId; // 0x28c(0x02)
	char UnknownData_28E[0x2]; // 0x28e(0x02)
	struct UKSEquipmentCosmeticComponent* EquipmentCosmeticComponent; // 0x290(0x08)
	char UnknownData_298[0x8]; // 0x298(0x08)
	struct FMulticastInlineDelegate OnCosmeticComponentCreated; // 0x2a0(0x10)

	void Unequip(bool bLocal, bool bWillReequip); // Function Killstreak.KSEquipment.Unequip
	bool SetEquipPoint(struct FGameplayTag InEquipPoint); // Function Killstreak.KSEquipment.SetEquipPoint
	void OnUnequipped(bool bWillReequip); // Function Killstreak.KSEquipment.OnUnequipped
	void OnRep_EquipPoint(); // Function Killstreak.KSEquipment.OnRep_EquipPoint
	void OnRep_EquipmentId(); // Function Killstreak.KSEquipment.OnRep_EquipmentId
	void OnEquipped(); // Function Killstreak.KSEquipment.OnEquipped
	bool IsInitialized(); // Function Killstreak.KSEquipment.IsInitialized
	bool IsInAction(); // Function Killstreak.KSEquipment.IsInAction
	bool IsEquipped(); // Function Killstreak.KSEquipment.IsEquipped
	struct UKSItem* GetKSItem(); // Function Killstreak.KSEquipment.GetKSItem
	struct FGiveItemParameters GetGiveParameters(); // Function Killstreak.KSEquipment.GetGiveParameters
	struct FGameplayTag GetEquipPoint(); // Function Killstreak.KSEquipment.GetEquipPoint
	uint16_t GetEquipmentId(); // Function Killstreak.KSEquipment.GetEquipmentId
	struct UKSEquipmentCosmeticComponent* GetCosmeticComponent(); // Function Killstreak.KSEquipment.GetCosmeticComponent
	bool EquipNoPoint(); // Function Killstreak.KSEquipment.EquipNoPoint
	void Drop(); // Function Killstreak.KSEquipment.Drop
};

// Class Killstreak.KSWeapon
// Size: 0x6e8 (Inherited: 0x2b0)
struct AKSWeapon : public AKSEquipment {
	bool bCanSwapOnFire; // 0x2b0(0x01)
	bool bCanSwapOnDown; // 0x2b1(0x01)
	bool bCanSwapOutOnInteraction; // 0x2b2(0x01)
	bool bCanSwapOutWhileAimingDownSights; // 0x2b3(0x01)
	char UnknownData_2B4[0x14]; // 0x2b4(0x14)
	struct AKSItemDrop* LoadedDropClass; // 0x2c8(0x08)
	char UnknownData_2D0[0x8]; // 0x2d0(0x08)
	bool bNoWeaponAsset; // 0x2d8(0x01)
	char UnknownData_2D9[0x7]; // 0x2d9(0x07)
	struct TSoftObjectPtr<struct UKSWeaponAsset> WeaponAssetPtr; // 0x2e0(0x28)
	struct UKSWeaponAsset* WeaponAsset; // 0x308(0x08)
	char UnknownData_310[0x10]; // 0x310(0x10)
	uint32_t AutoSwapOutWeaponId; // 0x320(0x04)
	char UnknownData_324[0x4]; // 0x324(0x04)
	struct FAuxiliaryWeaponInfo AuxiliaryWeaponInfo; // 0x328(0x10)
	struct TMap<struct FName, struct AKSWeapon*> AuxiliaryWeapons; // 0x338(0x50)
	struct FMulticastInlineDelegate OnCreatedDeployable; // 0x388(0x10)
	enum class EKSWeaponDestroyReason DestroyReason; // 0x398(0x01)
	char UnknownData_399[0x7]; // 0x399(0x07)
	struct AKSCharacter* CharacterOwner; // 0x3a0(0x08)
	bool bUseCompressStateTransmission; // 0x3a8(0x01)
	char UnknownData_3A9[0x17]; // 0x3a9(0x17)
	enum class EWeaponStateNew WeaponState; // 0x3c0(0x01)
	enum class EWeaponStateNew LocalWeaponState; // 0x3c1(0x01)
	char UnknownData_3C2[0x2]; // 0x3c2(0x02)
	float LastStateChangeTimeStamp; // 0x3c4(0x04)
	struct TArray<struct FWeaponStateChangeRequest> PendingStateChangeRequests; // 0x3c8(0x10)
	char UnknownData_3D8[0x2]; // 0x3d8(0x02)
	uint16_t NextStateRequestId; // 0x3da(0x02)
	char UnknownData_3DC[0x4]; // 0x3dc(0x04)
	struct FMulticastInlineDelegate OnWeaponStateChangedDel; // 0x3e0(0x10)
	char UnknownData_3F0[0x30]; // 0x3f0(0x30)
	bool bPendingFire; // 0x420(0x01)
	bool bBotPendingFire; // 0x421(0x01)
	bool bFireOnce; // 0x422(0x01)
	char UnknownData_423[0x1]; // 0x423(0x01)
	int32_t KickbackShotIndex; // 0x424(0x04)
	float KickbackResetTimeLeft; // 0x428(0x04)
	int32_t BurstShotIndex; // 0x42c(0x04)
	float MinCookTimeStamp; // 0x430(0x04)
	bool bUsingPostFireForgiveness; // 0x434(0x01)
	char UnknownData_435[0x3]; // 0x435(0x03)
	float PrefireStartTime; // 0x438(0x04)
	struct FKSActionRestrictor FireLockout; // 0x43c(0x0c)
	struct FMulticastInlineDelegate OnFire; // 0x448(0x10)
	struct FMulticastInlineDelegate OnReloadFailed; // 0x458(0x10)
	float DeathShotForgivenessTime; // 0x468(0x04)
	bool bTryToReloadEveryTickOnEmpty; // 0x46c(0x01)
	char UnknownData_46D[0x3]; // 0x46d(0x03)
	int32_t CachedReloadSize; // 0x470(0x04)
	int32_t AmmoInClip; // 0x474(0x04)
	int32_t ClipSize; // 0x478(0x04)
	int32_t AmmoConsumedSinceLastReload; // 0x47c(0x04)
	struct FWeaponStateChangeRequest LastReloadRequest; // 0x480(0x10)
	bool bWeaponStartsLoaded; // 0x490(0x01)
	enum class EReloadReplicationFlags ReloadReplicationFlags; // 0x491(0x01)
	char UnknownData_492[0x6]; // 0x492(0x06)
	struct FMulticastInlineDelegate OnExhaustedDel; // 0x498(0x10)
	bool bShouldResumeReload; // 0x4a8(0x01)
	bool bFirstReload; // 0x4a9(0x01)
	char UnknownData_4AA[0x6]; // 0x4aa(0x06)
	struct FMulticastInlineDelegate OnAmmoChangedDel; // 0x4b0(0x10)
	char UnknownData_4C0[0x18]; // 0x4c0(0x18)
	struct FMulticastInlineDelegate OnAmmoInClipConsumed; // 0x4d8(0x10)
	char UnknownData_4E8[0x8]; // 0x4e8(0x08)
	struct UDamageType* LoadedDamageTypeClass; // 0x4f0(0x08)
	struct FMulticastInlineDelegate OnHiddenInteractableUpdate; // 0x4f8(0x10)
	struct AActor* CachedHiddenInteractable; // 0x508(0x08)
	char UnknownData_510[0x18]; // 0x510(0x18)
	float NextExpectedTimerEndTime; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct FTimerHandle ActiveTimer; // 0x530(0x08)
	bool bCanEverInterruptSprinting; // 0x538(0x01)
	char UnknownData_539[0x3]; // 0x539(0x03)
	float SprintRecoveryRemaining; // 0x53c(0x04)
	bool bReleasedFireInSprintRecovery; // 0x540(0x01)
	bool bDodgeRollInterruptedReload; // 0x541(0x01)
	bool bSprintCanInterruptReload; // 0x542(0x01)
	bool bDodgeRollCanInterruptReload; // 0x543(0x01)
	float DodgeRollRecoveryRemaining; // 0x544(0x04)
	char UnknownData_548[0x18]; // 0x548(0x18)
	bool bInLockon; // 0x560(0x01)
	char UnknownData_561[0x3]; // 0x561(0x03)
	float LockonProgress; // 0x564(0x04)
	float LockonDuration; // 0x568(0x04)
	struct FRotator LockonStartRotation; // 0x56c(0x0c)
	struct FRotator LockonEndRotation; // 0x578(0x0c)
	char UnknownData_584[0x58]; // 0x584(0x58)
	struct FRandomStream WeaponRandomStream; // 0x5dc(0x08)
	char UnknownData_5E4[0x54]; // 0x5e4(0x54)
	struct UKSAimFrictionData* AimAssistFrictionData; // 0x638(0x08)
	struct UKSAimMagnetismData* AimAssistMagnetismData; // 0x640(0x08)
	struct UKSAimLockData* AimAssistLockData; // 0x648(0x08)
	struct UKSAimSnapData* AimAssistSnapData; // 0x650(0x08)
	bool bRequireInputForAimAssistFriction; // 0x658(0x01)
	bool bRequireInputForAimAssistMagnetism; // 0x659(0x01)
	bool bRequireInputForAimAssistLock; // 0x65a(0x01)
	char UnknownData_65B[0x5]; // 0x65b(0x05)
	struct UCurveVector* AimAssistFrictionCurve; // 0x660(0x08)
	struct UCurveFloat* AimAssistFrictionDistanceCurve; // 0x668(0x08)
	struct UCurveVector* AimAssistMagnetismCurve; // 0x670(0x08)
	struct UCurveFloat* AimAssistMagnetismDistanceCurve; // 0x678(0x08)
	struct UCurveVector* AimAssistLockCurve; // 0x680(0x08)
	struct UCurveFloat* AimAssistLockDistanceCurve; // 0x688(0x08)
	bool bRequireInputForHipAimAssistFriction; // 0x690(0x01)
	bool bRequireInputForHipAimAssistMagnetism; // 0x691(0x01)
	bool bRequireInputForHipAimAssistLock; // 0x692(0x01)
	char UnknownData_693[0x5]; // 0x693(0x05)
	struct UCurveVector* HipAimAssistFrictionCurve; // 0x698(0x08)
	struct UCurveFloat* HipAimAssistFrictionDistanceCurve; // 0x6a0(0x08)
	struct UCurveVector* HipAimAssistMagnetismCurve; // 0x6a8(0x08)
	struct UCurveFloat* HipAimAssistMagnetismDistanceCurve; // 0x6b0(0x08)
	struct UCurveVector* HipAimAssistLockCurve; // 0x6b8(0x08)
	struct UCurveFloat* HipAimAssistLockDistanceCurve; // 0x6c0(0x08)
	struct FRotator MaxAimAssistSnapRotation; // 0x6c8(0x0c)
	char UnknownData_6D4[0x4]; // 0x6d4(0x04)
	struct UCurveFloat* AimAssistSnapDistanceCurve; // 0x6d8(0x08)
	struct UCurveVector* AimAssistSnapCurve; // 0x6e0(0x08)

	void UpdateHiddenInteractable(); // Function Killstreak.KSWeapon.UpdateHiddenInteractable
	bool StopFireOnRelease(); // Function Killstreak.KSWeapon.StopFireOnRelease
	void StopFire(); // Function Killstreak.KSWeapon.StopFire
	void StopDefaultAim(); // Function Killstreak.KSWeapon.StopDefaultAim
	bool StopAltFire(); // Function Killstreak.KSWeapon.StopAltFire
	void StopAimOverShoulder(); // Function Killstreak.KSWeapon.StopAimOverShoulder
	void StopAimDownSights(); // Function Killstreak.KSWeapon.StopAimDownSights
	void StateRequestTimeoutExpired(); // Function Killstreak.KSWeapon.StateRequestTimeoutExpired
	bool StartRetrieving(); // Function Killstreak.KSWeapon.StartRetrieving
	bool StartReload(); // Function Killstreak.KSWeapon.StartReload
	bool StartHolstering(); // Function Killstreak.KSWeapon.StartHolstering
	bool StartFire(); // Function Killstreak.KSWeapon.StartFire
	void StartDefaultAim(); // Function Killstreak.KSWeapon.StartDefaultAim
	bool StartAltFire(); // Function Killstreak.KSWeapon.StartAltFire
	void StartAimOverShoulder(); // Function Killstreak.KSWeapon.StartAimOverShoulder
	void StartAimDownSights(); // Function Killstreak.KSWeapon.StartAimDownSights
	void SimulateConsumeAmmo(int32_t AmmoInClipAfterConsume, int32_t AmmoToConsumeFromInventory); // Function Killstreak.KSWeapon.SimulateConsumeAmmo
	bool ShouldStartReloadInterruptSprinting(); // Function Killstreak.KSWeapon.ShouldStartReloadInterruptSprinting
	bool ShouldStartHolsterInterruptSprinting(); // Function Killstreak.KSWeapon.ShouldStartHolsterInterruptSprinting
	bool ShouldStartFireInterruptSprinting(); // Function Killstreak.KSWeapon.ShouldStartFireInterruptSprinting
	bool ShouldStartFireInterruptAimDownSights(); // Function Killstreak.KSWeapon.ShouldStartFireInterruptAimDownSights
	bool ShouldQuickMeleeAsBackupFire(); // Function Killstreak.KSWeapon.ShouldQuickMeleeAsBackupFire
	bool ShouldEACRecordAsMeleeAttackNow(); // Function Killstreak.KSWeapon.ShouldEACRecordAsMeleeAttackNow
	bool ShouldConsumeAmmoDirectlyFromInventory(); // Function Killstreak.KSWeapon.ShouldConsumeAmmoDirectlyFromInventory
	bool ShouldBeRemovedWhenExhausted(); // Function Killstreak.KSWeapon.ShouldBeRemovedWhenExhausted
	void SetAutoSwapOutWeaponId(uint32_t OtherWeaponId); // Function Killstreak.KSWeapon.SetAutoSwapOutWeaponId
	void ServerRetrieveActiveWeaponCompressed(struct FWeaponStateChangeRequest request, uint16_t LastRequestId); // Function Killstreak.KSWeapon.ServerRetrieveActiveWeaponCompressed
	void ServerRetrieveActiveWeapon(struct FWeaponStateChangeRequest request); // Function Killstreak.KSWeapon.ServerRetrieveActiveWeapon
	void ServerRequestStateChangeCompressed(struct FWeaponStateChangeRequest request, uint16_t LastRequestId); // Function Killstreak.KSWeapon.ServerRequestStateChangeCompressed
	void ServerRequestStateChange(struct FWeaponStateChangeRequest request); // Function Killstreak.KSWeapon.ServerRequestStateChange
	void ServerPostReloadCompressed(struct FWeaponStateChangeRequest request, int32_t AmmoDelta, uint16_t LastRequestId); // Function Killstreak.KSWeapon.ServerPostReloadCompressed
	void ServerPostReload(struct FWeaponStateChangeRequest request, int32_t AmmoDelta); // Function Killstreak.KSWeapon.ServerPostReload
	void ServerCookReleasedCompressed(struct FWeaponStateChangeRequest request, float AdditionalCookTime, uint16_t LastRequestId); // Function Killstreak.KSWeapon.ServerCookReleasedCompressed
	void ServerCookReleased(struct FWeaponStateChangeRequest request, float AdditionalCookTime); // Function Killstreak.KSWeapon.ServerCookReleased
	void Reload(); // Function Killstreak.KSWeapon.Reload
	void ProcessHits(struct FAimData ReceivedAim, struct TArray<struct FHitResult> Hits); // Function Killstreak.KSWeapon.ProcessHits
	void PreLoadAmmo(); // Function Killstreak.KSWeapon.PreLoadAmmo
	bool OwnerIsTransitioningAimState(); // Function Killstreak.KSWeapon.OwnerIsTransitioningAimState
	bool OwnerIsSwimming(); // Function Killstreak.KSWeapon.OwnerIsSwimming
	bool OwnerIsSprinting(); // Function Killstreak.KSWeapon.OwnerIsSprinting
	bool OwnerIsReloadingAnyWeapon(); // Function Killstreak.KSWeapon.OwnerIsReloadingAnyWeapon
	bool OwnerIsMovingOnGround(); // Function Killstreak.KSWeapon.OwnerIsMovingOnGround
	bool OwnerIsLocallyViewed(); // Function Killstreak.KSWeapon.OwnerIsLocallyViewed
	bool OwnerIsFreeFalling(); // Function Killstreak.KSWeapon.OwnerIsFreeFalling
	bool OwnerIsFiringMeleeWeapon(); // Function Killstreak.KSWeapon.OwnerIsFiringMeleeWeapon
	bool OwnerIsDowned(); // Function Killstreak.KSWeapon.OwnerIsDowned
	bool OwnerIsAlive(); // Function Killstreak.KSWeapon.OwnerIsAlive
	bool OwnerHasAmmo(); // Function Killstreak.KSWeapon.OwnerHasAmmo
	float OnStartRetrieving(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartRetrieving
	float OnStartReloadCooldown(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartReloadCooldown
	float OnStartPreReload(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartPreReload
	float OnStartPreFire(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartPreFire
	float OnStartPostReload(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartPostReload
	float OnStartPostFire(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartPostFire
	void OnStartInactive(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartInactive
	float OnStartHolstering(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartHolstering
	float OnStartCooldown(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartCooldown
	float OnStartBuildup(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnStartBuildup
	void OnRep_WeaponState(); // Function Killstreak.KSWeapon.OnRep_WeaponState
	void OnRep_WeaponAsset(); // Function Killstreak.KSWeapon.OnRep_WeaponAsset
	void OnRep_AuxiliaryWeaponInfo(); // Function Killstreak.KSWeapon.OnRep_AuxiliaryWeaponInfo
	void OnRep_AutoSwapOutWeaponId(); // Function Killstreak.KSWeapon.OnRep_AutoSwapOutWeaponId
	void OnRep_Ammo(); // Function Killstreak.KSWeapon.OnRep_Ammo
	void OnPostMantleLockoutEnd(); // Function Killstreak.KSWeapon.OnPostMantleLockoutEnd
	void OnOwnerMovementModeChangedNative(char OldMode, char OldCustomMode, char NewMode, char NewCustomMode); // Function Killstreak.KSWeapon.OnOwnerMovementModeChangedNative
	void OnOwnerMovementModeChanged(char OldMode, char OldCustomMode, char NewMode, char NewCustomMode); // Function Killstreak.KSWeapon.OnOwnerMovementModeChanged
	void OnEndRetrieving(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndRetrieving
	void OnEndReloadCooldown(enum class EWeaponStateNew NewState); // Function Killstreak.KSWeapon.OnEndReloadCooldown
	void OnEndPreReload(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndPreReload
	void OnEndPreFire(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndPreFire
	void OnEndPostReload(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndPostReload
	void OnEndPostFire(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndPostFire
	void OnEndInactive(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndInactive
	void OnEndIdleState(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndIdleState
	void OnEndHolstering(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndHolstering
	void OnEndCooldown(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndCooldown
	void OnEndBuildup(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.OnEndBuildup
	void OnBeginIdleState(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.OnBeginIdleState
	float ModifyDamageDealt(float DamageAmount, struct FDamageEvent DamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser, struct AActor* DamagedActor); // Function Killstreak.KSWeapon.ModifyDamageDealt
	bool IsRetrieving(); // Function Killstreak.KSWeapon.IsRetrieving
	bool IsReloading(); // Function Killstreak.KSWeapon.IsReloading
	bool IsInSprintRecovery(); // Function Killstreak.KSWeapon.IsInSprintRecovery
	bool IsInReloadingLoop(); // Function Killstreak.KSWeapon.IsInReloadingLoop
	bool IsInFiringLoop(); // Function Killstreak.KSWeapon.IsInFiringLoop
	bool IsInDodgeRollRecovery(); // Function Killstreak.KSWeapon.IsInDodgeRollRecovery
	bool IsHolstering(); // Function Killstreak.KSWeapon.IsHolstering
	bool IsFiring(); // Function Killstreak.KSWeapon.IsFiring
	bool IsExhausted(); // Function Killstreak.KSWeapon.IsExhausted
	bool IsEquippedMelee(); // Function Killstreak.KSWeapon.IsEquippedMelee
	bool IsEquippedMainWeapon(); // Function Killstreak.KSWeapon.IsEquippedMainWeapon
	bool IsEquippedGrenade(); // Function Killstreak.KSWeapon.IsEquippedGrenade
	bool IsClipFull(); // Function Killstreak.KSWeapon.IsClipFull
	bool IsClipEmpty(); // Function Killstreak.KSWeapon.IsClipEmpty
	bool IsActiveWeapon(); // Function Killstreak.KSWeapon.IsActiveWeapon
	bool InstantReload(); // Function Killstreak.KSWeapon.InstantReload
	bool HasAttachment(struct UKSWeaponAttachmentInstance* InAttachment); // Function Killstreak.KSWeapon.HasAttachment
	void HandleExhausted(); // Function Killstreak.KSWeapon.HandleExhausted
	enum class EWeaponStateNew GetWeaponState(); // Function Killstreak.KSWeapon.GetWeaponState
	struct UKSWeaponComponent* GetWeaponComponent(); // Function Killstreak.KSWeapon.GetWeaponComponent
	struct UKSWeaponAsset* GetWeaponAsset(); // Function Killstreak.KSWeapon.GetWeaponAsset
	float GetWalkSpeedModifier(); // Function Killstreak.KSWeapon.GetWalkSpeedModifier
	float GetReloadCooldownTime(); // Function Killstreak.KSWeapon.GetReloadCooldownTime
	float GetPreReloadTime(); // Function Killstreak.KSWeapon.GetPreReloadTime
	float GetPostReloadTime(); // Function Killstreak.KSWeapon.GetPostReloadTime
	float GetMovementAccuracyPenalty(); // Function Killstreak.KSWeapon.GetMovementAccuracyPenalty
	float GetMaxFiringAccuracyLoss(); // Function Killstreak.KSWeapon.GetMaxFiringAccuracyLoss
	float GetLimbDamageAmount(); // Function Killstreak.KSWeapon.GetLimbDamageAmount
	struct AKSPlayerState* GetKSPlayerState(); // Function Killstreak.KSWeapon.GetKSPlayerState
	float GetInAirAccuracyModifier(); // Function Killstreak.KSWeapon.GetInAirAccuracyModifier
	struct AActor* GetHiddenInteractable(); // Function Killstreak.KSWeapon.GetHiddenInteractable
	float GetHeadDamageAmount(); // Function Killstreak.KSWeapon.GetHeadDamageAmount
	struct AController* GetDamageInstigator(); // Function Killstreak.KSWeapon.GetDamageInstigator
	float GetDamageFalloffRangeScaler(); // Function Killstreak.KSWeapon.GetDamageFalloffRangeScaler
	float GetCrouchAccuracyModifier(); // Function Killstreak.KSWeapon.GetCrouchAccuracyModifier
	int32_t GetClipSize(); // Function Killstreak.KSWeapon.GetClipSize
	struct AKSCharacter* GetCharacterOwner(); // Function Killstreak.KSWeapon.GetCharacterOwner
	bool GetCanUseOffGround(); // Function Killstreak.KSWeapon.GetCanUseOffGround
	float GetBaseDamageAmount(); // Function Killstreak.KSWeapon.GetBaseDamageAmount
	float GetBaseAccuracy(); // Function Killstreak.KSWeapon.GetBaseAccuracy
	void GetAttachments(struct TArray<struct UKSWeaponAttachment*> OutWeaponAttachments); // Function Killstreak.KSWeapon.GetAttachments
	void GetAttachmentInstances(struct TArray<struct UKSWeaponAttachmentInstance*> OutWeaponAttachmentInstances); // Function Killstreak.KSWeapon.GetAttachmentInstances
	struct UKSWeaponAttachmentInstance* GetAttachment(struct FGameplayTag InAttachPoint); // Function Killstreak.KSWeapon.GetAttachment
	enum class EAmmoType GetAmmoType(); // Function Killstreak.KSWeapon.GetAmmoType
	int32_t GetAmmoInOwnerInventory(); // Function Killstreak.KSWeapon.GetAmmoInOwnerInventory
	int32_t GetAmmoInClip(); // Function Killstreak.KSWeapon.GetAmmoInClip
	float GetAimOverShoulderAccuracyModifier(); // Function Killstreak.KSWeapon.GetAimOverShoulderAccuracyModifier
	float GetAimDownSightsFOV(); // Function Killstreak.KSWeapon.GetAimDownSightsFOV
	float GetAccuracyReturnRate(); // Function Killstreak.KSWeapon.GetAccuracyReturnRate
	float GetAccuracyReturnDelay(); // Function Killstreak.KSWeapon.GetAccuracyReturnDelay
	float GetAccuracyLossPerShot(); // Function Killstreak.KSWeapon.GetAccuracyLossPerShot
	void FireWeapon(); // Function Killstreak.KSWeapon.FireWeapon
	void EndState(enum class EWeaponStateNew NextState); // Function Killstreak.KSWeapon.EndState
	void ConsumePendingFire(); // Function Killstreak.KSWeapon.ConsumePendingFire
	int32_t ConsumeAmmo(); // Function Killstreak.KSWeapon.ConsumeAmmo
	void ClientStateChangeRejected(uint16_t nRequestId, enum class EWeaponStateNew RestoreState); // Function Killstreak.KSWeapon.ClientStateChangeRejected
	void ClientStateChangeAccepted(uint16_t nRequestId); // Function Killstreak.KSWeapon.ClientStateChangeAccepted
	void ClientRecoverSeedMisalignment(uint16_t RequestID, struct FRandomStream ServerStream); // Function Killstreak.KSWeapon.ClientRecoverSeedMisalignment
	void ClientNotifyRecoveryFinish(); // Function Killstreak.KSWeapon.ClientNotifyRecoveryFinish
	void ClientForceUpdateAmmoInClip(int32_t NewAmmo); // Function Killstreak.KSWeapon.ClientForceUpdateAmmoInClip
	void ClientForceIdleFromFire(); // Function Killstreak.KSWeapon.ClientForceIdleFromFire
	void ClientFixLastReload(uint16_t RequestID, int32_t InAmmoInClip); // Function Killstreak.KSWeapon.ClientFixLastReload
	void ClientFireWeaponRejected(uint16_t nRequestId); // Function Killstreak.KSWeapon.ClientFireWeaponRejected
	void CheckExhausted(); // Function Killstreak.KSWeapon.CheckExhausted
	bool CheckDeathShotForgiveness(); // Function Killstreak.KSWeapon.CheckDeathShotForgiveness
	bool CanUseAnAimStateNow(); // Function Killstreak.KSWeapon.CanUseAnAimStateNow
	bool CanToggleOutOfAimDownSightsNow(); // Function Killstreak.KSWeapon.CanToggleOutOfAimDownSightsNow
	bool CanToggleIntoAimDownSightsNow(); // Function Killstreak.KSWeapon.CanToggleIntoAimDownSightsNow
	bool CanStartReloadNow(); // Function Killstreak.KSWeapon.CanStartReloadNow
	bool CanStartFireNow(); // Function Killstreak.KSWeapon.CanStartFireNow
	bool CanRetrieveNow(); // Function Killstreak.KSWeapon.CanRetrieveNow
	bool CanReloadNowCommon(); // Function Killstreak.KSWeapon.CanReloadNowCommon
	bool CanRefireNow(); // Function Killstreak.KSWeapon.CanRefireNow
	bool CanReceiveAttachment(struct UKSWeaponAttachment* InAttachment, struct FGameplayTagContainer AvailableAttachPoints); // Function Killstreak.KSWeapon.CanReceiveAttachment
	bool CanInteractWith(struct AActor* InteractableTarget); // Function Killstreak.KSWeapon.CanInteractWith
	bool CanHolsterNow(); // Function Killstreak.KSWeapon.CanHolsterNow
	bool CanFireNowCommon(); // Function Killstreak.KSWeapon.CanFireNowCommon
	bool CanEverReload(); // Function Killstreak.KSWeapon.CanEverReload
	bool CanEverAimOverShoulder(); // Function Killstreak.KSWeapon.CanEverAimOverShoulder
	bool CanEverAimDownSights(); // Function Killstreak.KSWeapon.CanEverAimDownSights
	bool CanEverAimAlternate(); // Function Killstreak.KSWeapon.CanEverAimAlternate
	bool CanDropNow(); // Function Killstreak.KSWeapon.CanDropNow
	bool CanCookNow(); // Function Killstreak.KSWeapon.CanCookNow
	bool CanContinueReloadNow(); // Function Killstreak.KSWeapon.CanContinueReloadNow
	bool CancelHolstering(); // Function Killstreak.KSWeapon.CancelHolstering
	bool CanBeSwappedTo(bool bByForce); // Function Killstreak.KSWeapon.CanBeSwappedTo
	bool CanBeSwappedFrom(); // Function Killstreak.KSWeapon.CanBeSwappedFrom
	bool CanBeInterruptedNow(); // Function Killstreak.KSWeapon.CanBeInterruptedNow
	float CalculateDamageFromHitInfo(struct FHitResult HitInfo); // Function Killstreak.KSWeapon.CalculateDamageFromHitInfo
	float CalculateDamageFalloffFromHitResults(struct FHitResult HitInfo); // Function Killstreak.KSWeapon.CalculateDamageFalloffFromHitResults
	float CalculateDamageFalloffFromDistance(float Distance); // Function Killstreak.KSWeapon.CalculateDamageFalloffFromDistance
	void BeginState(enum class EWeaponStateNew PreviousState); // Function Killstreak.KSWeapon.BeginState
	void AltFireInitiated(); // Function Killstreak.KSWeapon.AltFireInitiated
	void AltFireEnded(); // Function Killstreak.KSWeapon.AltFireEnded
	bool AllowZiplineRightNow(); // Function Killstreak.KSWeapon.AllowZiplineRightNow
	bool AllowSprintingRightNow(); // Function Killstreak.KSWeapon.AllowSprintingRightNow
	bool AllowDodgeRollRightNow(); // Function Killstreak.KSWeapon.AllowDodgeRollRightNow
	void AimTransitionComplete(enum class EKSCharacterAimMode NewAimState); // Function Killstreak.KSWeapon.AimTransitionComplete
	bool AbortReload(); // Function Killstreak.KSWeapon.AbortReload
	void AbortFire(); // Function Killstreak.KSWeapon.AbortFire
};

// Class Killstreak.KSArmor
// Size: 0x6f0 (Inherited: 0x6e8)
struct AKSArmor : public AKSWeapon {
	float Durability; // 0x6e8(0x04)
	bool bArmorIsBroken; // 0x6ec(0x01)
	char UnknownData_6ED[0x3]; // 0x6ed(0x03)

	bool ShouldDestroyOnBreak(); // Function Killstreak.KSArmor.ShouldDestroyOnBreak
	float RepairArmor(float DurabilityToAdd); // Function Killstreak.KSArmor.RepairArmor
	bool IsRepairableArmor(); // Function Killstreak.KSArmor.IsRepairableArmor
	bool IsArmorBeingRepaired(); // Function Killstreak.KSArmor.IsArmorBeingRepaired
	float GetMaxDurability(); // Function Killstreak.KSArmor.GetMaxDurability
	float GetDurability(); // Function Killstreak.KSArmor.GetDurability
	struct UKSArmorAsset* GetArmorAsset(); // Function Killstreak.KSArmor.GetArmorAsset
	bool CanArmorBeRepaired(); // Function Killstreak.KSArmor.CanArmorBeRepaired
	bool CanAbsorbDamageType(struct UDamageType* DamageTypeClass); // Function Killstreak.KSArmor.CanAbsorbDamageType
	float CalcAbsorbRadialDamage(float Damage, struct FRadialDamageEvent RadialDamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function Killstreak.KSArmor.CalcAbsorbRadialDamage
	float CalcAbsorbPointDamage(float Damage, struct FPointDamageEvent PointDamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function Killstreak.KSArmor.CalcAbsorbPointDamage
};

// Class Killstreak.KSWeaponAsset
// Size: 0x760 (Inherited: 0x168)
struct UKSWeaponAsset : public UKSItem {
	struct UDataTable* ItemDisplayStatParamsTable; // 0x168(0x08)
	struct FText WeaponDisplayName; // 0x170(0x18)
	struct FText WeaponDescription; // 0x188(0x18)
	struct FGameplayTag WeaponType; // 0x1a0(0x08)
	enum class EKSWeaponEquipType WeaponEquipType; // 0x1a8(0x01)
	char UnknownData_1A9[0x7]; // 0x1a9(0x07)
	SoftClassProperty WeaponClass; // 0x1b0(0x28)
	SoftClassProperty WeaponComponentClass; // 0x1d8(0x28)
	SoftClassProperty WeaponAmmoWidgetClass; // 0x200(0x28)
	SoftClassProperty WeaponDropClass; // 0x228(0x28)
	bool bUnique; // 0x250(0x01)
	bool bShouldBeRemovedWhenExhausted; // 0x251(0x01)
	bool bCanBeDropped; // 0x252(0x01)
	bool bForceUprightDrops; // 0x253(0x01)
	bool bDoesRestoreAmmo; // 0x254(0x01)
	bool bModsCanReplenishAmmo; // 0x255(0x01)
	bool bCanEverFire; // 0x256(0x01)
	bool bLagCompensatedFire; // 0x257(0x01)
	bool bIgnoreNoFire; // 0x258(0x01)
	bool bLimitNumInPlay; // 0x259(0x01)
	char UnknownData_25A[0x2]; // 0x25a(0x02)
	int32_t MaxNumInPlay; // 0x25c(0x04)
	bool bUsesEquipPoint; // 0x260(0x01)
	char UnknownData_261[0x7]; // 0x261(0x07)
	struct FGameplayTagContainer ValidEquipPoints; // 0x268(0x20)
	enum class EFireModeType FireModeType; // 0x288(0x01)
	enum class EWeaponCastType CastType; // 0x289(0x01)
	char UnknownData_28A[0x2]; // 0x28a(0x02)
	int32_t RoundsPerBurst; // 0x28c(0x04)
	bool bUseAltFire; // 0x290(0x01)
	bool bUseBuildupForCooking; // 0x291(0x01)
	char UnknownData_292[0x2]; // 0x292(0x02)
	float BuildupTime; // 0x294(0x04)
	float PreFireTime; // 0x298(0x04)
	float PreFireInterruptThreshold; // 0x29c(0x04)
	float AltPreFireTime; // 0x2a0(0x04)
	float PostFireTime; // 0x2a4(0x04)
	float AltPostFireTime; // 0x2a8(0x04)
	float PostFireForgivenessTime; // 0x2ac(0x04)
	bool bSwapAfterFire; // 0x2b0(0x01)
	char UnknownData_2B1[0x3]; // 0x2b1(0x03)
	float CooldownTime; // 0x2b4(0x04)
	bool bCanEverReload; // 0x2b8(0x01)
	bool bConsumeAmmoDirectlyFromInventory; // 0x2b9(0x01)
	char UnknownData_2BA[0x2]; // 0x2ba(0x02)
	int32_t ClipSize; // 0x2bc(0x04)
	enum class EReloadType ReloadType; // 0x2c0(0x01)
	char UnknownData_2C1[0x3]; // 0x2c1(0x03)
	float PreReloadTime; // 0x2c4(0x04)
	float PostReloadTime; // 0x2c8(0x04)
	float ReloadCooldownTime; // 0x2cc(0x04)
	bool bReloadOnEmptyWhileScoped; // 0x2d0(0x01)
	char UnknownData_2D1[0x3]; // 0x2d1(0x03)
	float FirstShotPreReloadTime; // 0x2d4(0x04)
	bool bCanInterruptPreReload; // 0x2d8(0x01)
	enum class EAmmoType AmmoType; // 0x2d9(0x01)
	char UnknownData_2DA[0x2]; // 0x2da(0x02)
	int32_t DefaultAmmo; // 0x2dc(0x04)
	bool bUnlimitedAmmo; // 0x2e0(0x01)
	bool bMuteEmptyClipWarnings; // 0x2e1(0x01)
	char UnknownData_2E2[0x2]; // 0x2e2(0x02)
	float HolsterTime; // 0x2e4(0x04)
	bool bShouldRestrictHolsterInPostFire; // 0x2e8(0x01)
	char UnknownData_2E9[0x3]; // 0x2e9(0x03)
	float RetriveTime; // 0x2ec(0x04)
	bool bCanFireFromRetrieve; // 0x2f0(0x01)
	enum class EReticleType ReticleType; // 0x2f1(0x01)
	char UnknownData_2F2[0x6]; // 0x2f2(0x06)
	struct FWeaponStateGraph WeaponStateGraph; // 0x2f8(0x140)
	bool bDoRadialDamage; // 0x438(0x01)
	bool bIsRadialDamageConical; // 0x439(0x01)
	char UnknownData_43A[0x2]; // 0x43a(0x02)
	float HeadDamageAmount; // 0x43c(0x04)
	float DamageAmount; // 0x440(0x04)
	float LimbDamageAmount; // 0x444(0x04)
	struct FInterpCurveFloat DamageFalloffCurve; // 0x448(0x18)
	struct FRadialDamageParams RadialDamageParams; // 0x460(0x14)
	bool bIgnoreFriendlies; // 0x474(0x01)
	bool bIgnoreSelf; // 0x475(0x01)
	bool bIgnoreWalls; // 0x476(0x01)
	char UnknownData_477[0x1]; // 0x477(0x01)
	float RadialConicalHalfAngle; // 0x478(0x04)
	char UnknownData_47C[0x4]; // 0x47c(0x04)
	SoftClassProperty DamageTypeClass; // 0x480(0x28)
	float CautionRadius; // 0x4a8(0x04)
	int32_t ShotPenetrationCount; // 0x4ac(0x04)
	float DefaultAimTransitionTime; // 0x4b0(0x04)
	bool bCanEverAimOverShoulder; // 0x4b4(0x01)
	char UnknownData_4B5[0x3]; // 0x4b5(0x03)
	float AimOverShoulderTransitionTime; // 0x4b8(0x04)
	bool bCanEverAimDownSights; // 0x4bc(0x01)
	char UnknownData_4BD[0x3]; // 0x4bd(0x03)
	float AimDownSightsTransitionTime; // 0x4c0(0x04)
	bool bLockoutAimStateInCooldown; // 0x4c4(0x01)
	char UnknownData_4C5[0x3]; // 0x4c5(0x03)
	float AimDownSightsFov; // 0x4c8(0x04)
	bool bCanEverAimAlternate; // 0x4cc(0x01)
	char UnknownData_4CD[0x3]; // 0x4cd(0x03)
	float AimAlternateTransitionTime; // 0x4d0(0x04)
	bool bPrefireLockon; // 0x4d4(0x01)
	char UnknownData_4D5[0x3]; // 0x4d5(0x03)
	float PrefireLockonAngle; // 0x4d8(0x04)
	float PrefireLockonDistance; // 0x4dc(0x04)
	bool bPrefireOverlapSkipsToFire; // 0x4e0(0x01)
	char UnknownData_4E1[0x7]; // 0x4e1(0x07)
	struct TArray<struct FPrefireSkipWindow> PrefireSkipWindows; // 0x4e8(0x10)
	float PrefireOverlapGracePeriod; // 0x4f8(0x04)
	enum class EThirdPersonAimOriginType ThirdPersonAimOriginType; // 0x4fc(0x01)
	char UnknownData_4FD[0x3]; // 0x4fd(0x03)
	struct FVector ThirdPersonFixedRelativeOffset; // 0x500(0x0c)
	struct FName ThirdPersonAimOriginSocketName; // 0x50c(0x08)
	float BaseAccuracy; // 0x514(0x04)
	float CrouchAccuracyModifier; // 0x518(0x04)
	float AimOverShoulderAccuracyModifier; // 0x51c(0x04)
	float InAirAccuracyModifier; // 0x520(0x04)
	float MovementAccuracyPenalty; // 0x524(0x04)
	float AccuracyLossPerShot; // 0x528(0x04)
	float MaxFiringAccuracyLoss; // 0x52c(0x04)
	float AccuracyReturnRate; // 0x530(0x04)
	float AccuracyReturnDelay; // 0x534(0x04)
	struct UKickbackModule* KickbackModule; // 0x538(0x08)
	float KickbackApplicationTimeOverride; // 0x540(0x04)
	bool bCanResetKickback; // 0x544(0x01)
	char UnknownData_545[0x3]; // 0x545(0x03)
	float KickbackResetTime; // 0x548(0x04)
	bool bUseKickbackRecovery; // 0x54c(0x01)
	char UnknownData_54D[0x3]; // 0x54d(0x03)
	float KickbackRecoveryDelay; // 0x550(0x04)
	float KickbackRecoveryRate; // 0x554(0x04)
	float KickbackRecoveryAcceleration; // 0x558(0x04)
	float MaxCumulativeKickbackVerticalAngle; // 0x55c(0x04)
	float GamepadKickbackScaling; // 0x560(0x04)
	float SprintRecoveryTime; // 0x564(0x04)
	bool bStartFireInterruptsSprinting; // 0x568(0x01)
	bool bStartReloadInterruptsSprinting; // 0x569(0x01)
	bool bStartHolsterInterruptsSprinting; // 0x56a(0x01)
	char UnknownData_56B[0x1]; // 0x56b(0x01)
	float DodgeRollRecoveryTime; // 0x56c(0x04)
	bool bShouldPreventDodgeRollDuringFire; // 0x570(0x01)
	bool bCanFireWhileInPowerSlide; // 0x571(0x01)
	bool bIsAudible; // 0x572(0x01)
	char UnknownData_573[0x1]; // 0x573(0x01)
	float AudibleRange; // 0x574(0x04)
	float WalkSpeedModifier; // 0x578(0x04)
	float ADSSpeedModifier; // 0x57c(0x04)
	bool bCanUseOffGround; // 0x580(0x01)
	char UnknownData_581[0x7]; // 0x581(0x07)
	struct FGameplayTagContainer ValidWeaponAttachmentPoints; // 0x588(0x20)
	struct TSet<struct TSoftObjectPtr<struct UKSWeaponAttachment>> ValidAttachments; // 0x5a8(0x50)
	int32_t AttachmentSlotCount; // 0x5f8(0x04)
	char UnknownData_5FC[0x4]; // 0x5fc(0x04)
	struct TMap<struct FName, struct TSoftObjectPtr<struct UKSWeaponAsset>> AuxiliaryWeapons; // 0x600(0x50)
	struct TSoftObjectPtr<struct UForceFeedbackEffect> VibrationEffect; // 0x650(0x28)
	struct TSoftObjectPtr<struct UForceFeedbackEffect> AlternativeVibrationEffect; // 0x678(0x28)
	struct TSoftObjectPtr<struct UForceFeedbackAttenuation> AlternativeVibrationAttenuation; // 0x6a0(0x28)
	struct TSoftObjectPtr<struct UKSWeaponAsset> WeaponUpgrade; // 0x6c8(0x28)
	struct TSoftObjectPtr<struct UTexture2D> ItemRenderImage; // 0x6f0(0x28)
	float ADSRollMultiplier; // 0x718(0x04)
	float ADSBumpStartStopMultiplier; // 0x71c(0x04)
	float ADSBumpLoopingMultiplier; // 0x720(0x04)
	struct FADSBlurValues ADSBlurValuesInfo; // 0x724(0x30)
	bool EnableCustomMask; // 0x754(0x01)
	char UnknownData_755[0x3]; // 0x755(0x03)
	struct UTexture2D* CustomMaskTexture; // 0x758(0x08)

	struct AKSWeapon* TryToEquipToCharacterNoPointGiven(struct UKSWeaponAsset* WeaponAsset, struct AKSCharacter* InOwner, struct FGiveItemParameters InGiveItemParameters, bool bAllowSyncLoad); // Function Killstreak.KSWeaponAsset.TryToEquipToCharacterNoPointGiven
	struct AKSWeapon* TryToEquipToCharacter(struct UKSWeaponAsset* WeaponAsset, struct AKSCharacter* InOwner, struct FGameplayTag EquipPoint, struct FGiveItemParameters InGiveItemParameters, bool bAllowSyncLoad); // Function Killstreak.KSWeaponAsset.TryToEquipToCharacter
	bool ShouldUseBuildupForCooking(); // Function Killstreak.KSWeaponAsset.ShouldUseBuildupForCooking
	bool ShouldStartReloadInterruptSprinting(); // Function Killstreak.KSWeaponAsset.ShouldStartReloadInterruptSprinting
	bool ShouldStartHolsterInterruptSprinting(); // Function Killstreak.KSWeaponAsset.ShouldStartHolsterInterruptSprinting
	bool ShouldStartFireInterruptSprinting(); // Function Killstreak.KSWeaponAsset.ShouldStartFireInterruptSprinting
	bool ShouldPreventDodgeRollDuringFire(); // Function Killstreak.KSWeaponAsset.ShouldPreventDodgeRollDuringFire
	bool ShouldPrefireOverlapSkipToFire(); // Function Killstreak.KSWeaponAsset.ShouldPrefireOverlapSkipToFire
	bool ShouldMuteEmptyClipWarnings(); // Function Killstreak.KSWeaponAsset.ShouldMuteEmptyClipWarnings
	bool ShouldLockonPrefire(); // Function Killstreak.KSWeaponAsset.ShouldLockonPrefire
	bool ShouldLagCompensateFire(struct AKSPlayerState* FiringPlayer); // Function Killstreak.KSWeaponAsset.ShouldLagCompensateFire
	bool ShouldForceUprightDrops(); // Function Killstreak.KSWeaponAsset.ShouldForceUprightDrops
	bool ShouldDoRadialDamage(); // Function Killstreak.KSWeaponAsset.ShouldDoRadialDamage
	bool ShouldBeRemovedWhenExhausted(); // Function Killstreak.KSWeaponAsset.ShouldBeRemovedWhenExhausted
	bool RequiresAnEquipPoint(); // Function Killstreak.KSWeaponAsset.RequiresAnEquipPoint
	struct FInterpCurveVector2D MakeKickbackCurve(int32_t nShotIndex, float AbsoluteMaxDuration); // Function Killstreak.KSWeaponAsset.MakeKickbackCurve
	bool LockoutAimStateInCooldown(); // Function Killstreak.KSWeaponAsset.LockoutAimStateInCooldown
	bool LimitNumInPlay(); // Function Killstreak.KSWeaponAsset.LimitNumInPlay
	bool IsUnique(); // Function Killstreak.KSWeaponAsset.IsUnique
	bool IsRadialDamageConical(); // Function Killstreak.KSWeaponAsset.IsRadialDamageConical
	bool IsGadget(); // Function Killstreak.KSWeaponAsset.IsGadget
	float IsAudible(); // Function Killstreak.KSWeaponAsset.IsAudible
	bool HasKickback(); // Function Killstreak.KSWeaponAsset.HasKickback
	struct TSoftObjectPtr<struct UKSWeaponAsset> GetWeaponUpgrade(); // Function Killstreak.KSWeaponAsset.GetWeaponUpgrade
	struct FGameplayTag GetWeaponType(); // Function Killstreak.KSWeaponAsset.GetWeaponType
	void GetWeaponStats(struct TArray<struct FString> OutStats); // Function Killstreak.KSWeaponAsset.GetWeaponStats
	struct FString GetWeaponNameAsString(); // Function Killstreak.KSWeaponAsset.GetWeaponNameAsString
	struct FText GetWeaponName(); // Function Killstreak.KSWeaponAsset.GetWeaponName
	struct FGameplayTag GetWeaponEquipType(); // Function Killstreak.KSWeaponAsset.GetWeaponEquipType
	SoftClassProperty GetWeaponDropClass(); // Function Killstreak.KSWeaponAsset.GetWeaponDropClass
	struct FString GetWeaponDescriptionAsString(); // Function Killstreak.KSWeaponAsset.GetWeaponDescriptionAsString
	struct FText GetWeaponDescription(); // Function Killstreak.KSWeaponAsset.GetWeaponDescription
	SoftClassProperty GetWeaponComponentClass(); // Function Killstreak.KSWeaponAsset.GetWeaponComponentClass
	SoftClassProperty GetWeaponClass(); // Function Killstreak.KSWeaponAsset.GetWeaponClass
	void GetWeaponAttachmentPoints(struct FGameplayTagContainer OutAttachPoints); // Function Killstreak.KSWeaponAsset.GetWeaponAttachmentPoints
	SoftClassProperty GetWeaponAmmoWidgetClass(); // Function Killstreak.KSWeaponAsset.GetWeaponAmmoWidgetClass
	float GetWalkSpeedModifier(); // Function Killstreak.KSWeaponAsset.GetWalkSpeedModifier
	struct TSoftObjectPtr<struct UForceFeedbackEffect> GetVibrationEffect(); // Function Killstreak.KSWeaponAsset.GetVibrationEffect
	struct FGameplayTagContainer GetValidEquipPoints(); // Function Killstreak.KSWeaponAsset.GetValidEquipPoints
	struct TSet<struct TSoftObjectPtr<struct UKSWeaponAttachment>> GetValidAttachments(); // Function Killstreak.KSWeaponAsset.GetValidAttachments
	bool GetUseAltFire(); // Function Killstreak.KSWeaponAsset.GetUseAltFire
	bool GetUnlimitedAmmo(); // Function Killstreak.KSWeaponAsset.GetUnlimitedAmmo
	struct FVector GetThirdPersonFixedRelativeOffset(); // Function Killstreak.KSWeaponAsset.GetThirdPersonFixedRelativeOffset
	bool GetSwapAfterFire(); // Function Killstreak.KSWeaponAsset.GetSwapAfterFire
	float GetSprintRecoveryTime(); // Function Killstreak.KSWeaponAsset.GetSprintRecoveryTime
	struct TSoftObjectPtr<struct UTexture2D> GetSoftItemRenderImage(); // Function Killstreak.KSWeaponAsset.GetSoftItemRenderImage
	int32_t GetShotPenetrationCount(); // Function Killstreak.KSWeaponAsset.GetShotPenetrationCount
	int32_t GetRoundsPerBurst(); // Function Killstreak.KSWeaponAsset.GetRoundsPerBurst
	float GetRetrieveTime(); // Function Killstreak.KSWeaponAsset.GetRetrieveTime
	enum class EReticleType GetReticleType(); // Function Killstreak.KSWeaponAsset.GetReticleType
	enum class EReloadType GetReloadType(); // Function Killstreak.KSWeaponAsset.GetReloadType
	float GetReloadCooldownTime(); // Function Killstreak.KSWeaponAsset.GetReloadCooldownTime
	bool GetRadialIgnoreWalls(); // Function Killstreak.KSWeaponAsset.GetRadialIgnoreWalls
	bool GetRadialIgnoreSelf(); // Function Killstreak.KSWeaponAsset.GetRadialIgnoreSelf
	bool GetRadialIgnoreFriendlies(); // Function Killstreak.KSWeaponAsset.GetRadialIgnoreFriendlies
	struct FRadialDamageParams GetRadialDamageParams(); // Function Killstreak.KSWeaponAsset.GetRadialDamageParams
	float GetRadialConicalHalfAngle(); // Function Killstreak.KSWeaponAsset.GetRadialConicalHalfAngle
	float GetPreReloadTime(); // Function Killstreak.KSWeaponAsset.GetPreReloadTime
	float GetPreFireTime(); // Function Killstreak.KSWeaponAsset.GetPreFireTime
	int32_t GetPrefireSkipWindowNum(); // Function Killstreak.KSWeaponAsset.GetPrefireSkipWindowNum
	struct FPrefireSkipWindow GetPrefireSkipWindow(int32_t Index); // Function Killstreak.KSWeaponAsset.GetPrefireSkipWindow
	float GetPrefireOverlapGracePeriod(); // Function Killstreak.KSWeaponAsset.GetPrefireOverlapGracePeriod
	float GetPrefireLockonDistance(); // Function Killstreak.KSWeaponAsset.GetPrefireLockonDistance
	float GetPrefireLockonAngle(); // Function Killstreak.KSWeaponAsset.GetPrefireLockonAngle
	float GetPreFireInterruptThreshold(); // Function Killstreak.KSWeaponAsset.GetPreFireInterruptThreshold
	float GetPostReloadTime(); // Function Killstreak.KSWeaponAsset.GetPostReloadTime
	float GetPostFireTime(); // Function Killstreak.KSWeaponAsset.GetPostFireTime
	float GetPostFireForgivenessTime(); // Function Killstreak.KSWeaponAsset.GetPostFireForgivenessTime
	float GetOuterRadius(); // Function Killstreak.KSWeaponAsset.GetOuterRadius
	float GetMovementAccuracyPenalty(); // Function Killstreak.KSWeaponAsset.GetMovementAccuracyPenalty
	int32_t GetMaxNumInPlay(); // Function Killstreak.KSWeaponAsset.GetMaxNumInPlay
	float GetMaxFiringAccuracyLoss(); // Function Killstreak.KSWeaponAsset.GetMaxFiringAccuracyLoss
	float GetMaxFalloffDistance(); // Function Killstreak.KSWeaponAsset.GetMaxFalloffDistance
	float GetMaxCumulativeKickbackVerticalAngle(); // Function Killstreak.KSWeaponAsset.GetMaxCumulativeKickbackVerticalAngle
	float GetLimbDamageAmount(); // Function Killstreak.KSWeaponAsset.GetLimbDamageAmount
	float GetKickbackResetTime(); // Function Killstreak.KSWeaponAsset.GetKickbackResetTime
	float GetKickbackRecoveryRate(); // Function Killstreak.KSWeaponAsset.GetKickbackRecoveryRate
	float GetKickbackRecoveryDelay(); // Function Killstreak.KSWeaponAsset.GetKickbackRecoveryDelay
	float GetKickbackRecoveryAcceleration(); // Function Killstreak.KSWeaponAsset.GetKickbackRecoveryAcceleration
	float GetKickbackApplicationOverride(); // Function Killstreak.KSWeaponAsset.GetKickbackApplicationOverride
	float GetInnerRadius(); // Function Killstreak.KSWeaponAsset.GetInnerRadius
	float GetInAirAccuracyModifier(); // Function Killstreak.KSWeaponAsset.GetInAirAccuracyModifier
	float GetHolsterTime(); // Function Killstreak.KSWeaponAsset.GetHolsterTime
	float GetHeadDamageAmount(); // Function Killstreak.KSWeaponAsset.GetHeadDamageAmount
	float GetGamepadKickbackScaling(); // Function Killstreak.KSWeaponAsset.GetGamepadKickbackScaling
	float GetFirstShotPreReloadTime(); // Function Killstreak.KSWeaponAsset.GetFirstShotPreReloadTime
	enum class EFireModeType GetFireModeType(); // Function Killstreak.KSWeaponAsset.GetFireModeType
	float GetDodgeRollRecoveryTime(); // Function Killstreak.KSWeaponAsset.GetDodgeRollRecoveryTime
	int32_t GetDefaultAmmo(); // Function Killstreak.KSWeaponAsset.GetDefaultAmmo
	float GetDefaultAimTransitionTime(); // Function Killstreak.KSWeaponAsset.GetDefaultAimTransitionTime
	SoftClassProperty GetDamageTypeClass(); // Function Killstreak.KSWeaponAsset.GetDamageTypeClass
	float GetDamageAmount(); // Function Killstreak.KSWeaponAsset.GetDamageAmount
	float GetCrouchAccuracyModifier(); // Function Killstreak.KSWeaponAsset.GetCrouchAccuracyModifier
	float GetCooldownDownTime(); // Function Killstreak.KSWeaponAsset.GetCooldownDownTime
	bool GetConsumeAmmoDirectlyFromInventory(); // Function Killstreak.KSWeaponAsset.GetConsumeAmmoDirectlyFromInventory
	void GetCompatibleAttachments(struct TArray<struct UKSWeaponAttachment*> OutAttachments); // Function Killstreak.KSWeaponAsset.GetCompatibleAttachments
	void GetCompatibleAttachmentAssets(struct TArray<struct TSoftObjectPtr<struct UKSWeaponAttachment>> OutAttachments); // Function Killstreak.KSWeaponAsset.GetCompatibleAttachmentAssets
	int32_t GetClipSize(); // Function Killstreak.KSWeaponAsset.GetClipSize
	float GetCautionRadius(); // Function Killstreak.KSWeaponAsset.GetCautionRadius
	enum class EWeaponCastType GetCastType(); // Function Killstreak.KSWeaponAsset.GetCastType
	bool GetCanUseOffGround(); // Function Killstreak.KSWeaponAsset.GetCanUseOffGround
	float GetCanFireWhileInPowerSlide(); // Function Killstreak.KSWeaponAsset.GetCanFireWhileInPowerSlide
	float GetBuildupTime(); // Function Killstreak.KSWeaponAsset.GetBuildupTime
	float GetBaseRadialDamage(); // Function Killstreak.KSWeaponAsset.GetBaseRadialDamage
	float GetBaseAccuracy(); // Function Killstreak.KSWeaponAsset.GetBaseAccuracy
	float GetAudibleRange(); // Function Killstreak.KSWeaponAsset.GetAudibleRange
	int32_t GetAttachmentSlotCount(); // Function Killstreak.KSWeaponAsset.GetAttachmentSlotCount
	enum class EAmmoType GetAmmoType(); // Function Killstreak.KSWeaponAsset.GetAmmoType
	struct TSoftObjectPtr<struct UForceFeedbackEffect> GetAlternativeVibrationEffect(); // Function Killstreak.KSWeaponAsset.GetAlternativeVibrationEffect
	struct TSoftObjectPtr<struct UForceFeedbackAttenuation> GetAlternativeVibrationAttenuation(); // Function Killstreak.KSWeaponAsset.GetAlternativeVibrationAttenuation
	float GetAlternatePreFireTime(); // Function Killstreak.KSWeaponAsset.GetAlternatePreFireTime
	float GetAlternatePostFireTime(); // Function Killstreak.KSWeaponAsset.GetAlternatePostFireTime
	float GetAimOverShoulderTransitionTime(); // Function Killstreak.KSWeaponAsset.GetAimOverShoulderTransitionTime
	float GetAimOverShoulderAccuracyModifier(); // Function Killstreak.KSWeaponAsset.GetAimOverShoulderAccuracyModifier
	float GetAimDownSightsTransitionTime(); // Function Killstreak.KSWeaponAsset.GetAimDownSightsTransitionTime
	float GetAimDownSightsFOV(); // Function Killstreak.KSWeaponAsset.GetAimDownSightsFOV
	float GetAimAlternateTransitionTime(); // Function Killstreak.KSWeaponAsset.GetAimAlternateTransitionTime
	float GetADSSpeedModifier(); // Function Killstreak.KSWeaponAsset.GetADSSpeedModifier
	float GetADSRollMultiplier(); // Function Killstreak.KSWeaponAsset.GetADSRollMultiplier
	float GetADSBumpStartStopMultiplier(); // Function Killstreak.KSWeaponAsset.GetADSBumpStartStopMultiplier
	float GetADSBumpLoopingMultiplier(); // Function Killstreak.KSWeaponAsset.GetADSBumpLoopingMultiplier
	struct FADSBlurValues GetADSBlurValuesInfo(); // Function Killstreak.KSWeaponAsset.GetADSBlurValuesInfo
	float GetAccuracyReturnRate(); // Function Killstreak.KSWeaponAsset.GetAccuracyReturnRate
	float GetAccuracyReturnDelay(); // Function Killstreak.KSWeaponAsset.GetAccuracyReturnDelay
	float GetAccuracyLossPerShot(); // Function Killstreak.KSWeaponAsset.GetAccuracyLossPerShot
	bool DoesScopingAllowAutoReload(); // Function Killstreak.KSWeaponAsset.DoesScopingAllowAutoReload
	bool DoesRestoreAmmo(); // Function Killstreak.KSWeaponAsset.DoesRestoreAmmo
	bool DoesIgnoreNoFire(); // Function Killstreak.KSWeaponAsset.DoesIgnoreNoFire
	struct AKSProjectile* CreateProjectile(struct UObject* WorldContextObject, struct UKSWeaponAsset* WeaponAsset, struct FVector SpawnLocation, struct FRotator SpawnRotation, struct FDropItemParameters InDropItemParameters, struct AKSWeapon* SpawningWeapon, struct AActor* SpawningOwner, struct APawn* SpawningInstigator, bool bDeferConstruction); // Function Killstreak.KSWeaponAsset.CreateProjectile
	struct AKSProjectile* CreateAndExplodeProjectile(struct UObject* WorldContextObject, struct UKSWeaponAsset* WeaponAsset, struct FVector SpawnLocation, struct FRotator SpawnRotation, struct FDropItemParameters InDropItemParameters, struct AKSWeapon* SpawningWeapon, struct AActor* SpawningOwner, struct APawn* SpawningInstigator, bool bDeferConstruction); // Function Killstreak.KSWeaponAsset.CreateAndExplodeProjectile
	float ConeHalfAngleToAccuracy(float HalfAngle); // Function Killstreak.KSWeaponAsset.ConeHalfAngleToAccuracy
	bool CanWeaponStateTransition(enum class EWeaponStateNew OldState, enum class EWeaponStateNew NewState); // Function Killstreak.KSWeaponAsset.CanWeaponStateTransition
	bool CanResetKickback(); // Function Killstreak.KSWeaponAsset.CanResetKickback
	bool CanRecoverFromKickback(); // Function Killstreak.KSWeaponAsset.CanRecoverFromKickback
	bool CanReceiveAttachment(struct UKSWeaponAttachment* InAttachment, struct FGameplayTagContainer AvailableAttachPoints); // Function Killstreak.KSWeaponAsset.CanReceiveAttachment
	bool CanModsReplenishAmmo(); // Function Killstreak.KSWeaponAsset.CanModsReplenishAmmo
	bool CanInterruptPreReload(); // Function Killstreak.KSWeaponAsset.CanInterruptPreReload
	bool CanEverReload(); // Function Killstreak.KSWeaponAsset.CanEverReload
	bool CanEverFire(); // Function Killstreak.KSWeaponAsset.CanEverFire
	bool CanEverAimOverShoulder(); // Function Killstreak.KSWeaponAsset.CanEverAimOverShoulder
	bool CanEverAimDownSights(); // Function Killstreak.KSWeaponAsset.CanEverAimDownSights
	bool CanEverAimAlternate(); // Function Killstreak.KSWeaponAsset.CanEverAimAlternate
	bool CanBeDropped(); // Function Killstreak.KSWeaponAsset.CanBeDropped
	float CalculateDamageFromProjectileHit(struct FHitResult HitInfo, struct AKSProjectile* Projectile); // Function Killstreak.KSWeaponAsset.CalculateDamageFromProjectileHit
	float CalculateDamageFromInstantHit(struct FHitResult HitInfo, float DamageFalloffRangeScaler); // Function Killstreak.KSWeaponAsset.CalculateDamageFromInstantHit
	float CalculateDamageFalloffFromProjectileHit(struct FHitResult HitInfo, struct AKSProjectile* Projectile); // Function Killstreak.KSWeaponAsset.CalculateDamageFalloffFromProjectileHit
	float CalculateDamageFalloffFromHitResults(struct FHitResult HitInfo, float FalloffRangeScaler); // Function Killstreak.KSWeaponAsset.CalculateDamageFalloffFromHitResults
	float CalculateDamageFalloffFromDistance(float Distance, float FalloffRangeScaler); // Function Killstreak.KSWeaponAsset.CalculateDamageFalloffFromDistance
	float AccuracyToConeHalfAngle(float Accuracy); // Function Killstreak.KSWeaponAsset.AccuracyToConeHalfAngle
};

// Class Killstreak.KSArmorAsset
// Size: 0x770 (Inherited: 0x760)
struct UKSArmorAsset : public UKSWeaponAsset {
	float Durability; // 0x760(0x04)
	float DamageAbsorbPercent; // 0x764(0x04)
	int32_t DisplayLevel; // 0x768(0x04)
	bool bAbsorbsHeadDamage; // 0x76c(0x01)
	bool bAbsorbsBreakingHit; // 0x76d(0x01)
	bool bArmorIsRepairable; // 0x76e(0x01)
	bool bDestroyOnBreak; // 0x76f(0x01)

	bool ShouldDestroyOnBreak(); // Function Killstreak.KSArmorAsset.ShouldDestroyOnBreak
	bool IsArmorRepairable(); // Function Killstreak.KSArmorAsset.IsArmorRepairable
	float GetMaxDurability(); // Function Killstreak.KSArmorAsset.GetMaxDurability
	int32_t GetDisplayLevel(); // Function Killstreak.KSArmorAsset.GetDisplayLevel
	float GetDamageAbsorbPercent(); // Function Killstreak.KSArmorAsset.GetDamageAbsorbPercent
	bool DoesAbsorbBreakingHit(); // Function Killstreak.KSArmorAsset.DoesAbsorbBreakingHit
	float CalcAbsorbRadialDamage(float Damage, struct FRadialDamageEvent RadialDamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function Killstreak.KSArmorAsset.CalcAbsorbRadialDamage
	float CalcAbsorbPointDamage(float Damage, struct FPointDamageEvent PointDamageEvent, struct AController* EventInstigator, struct AActor* DamageCauser); // Function Killstreak.KSArmorAsset.CalcAbsorbPointDamage
};

// Class Killstreak.KSWeaponAssetDrop
// Size: 0x7d8 (Inherited: 0x360)
struct AKSWeaponAssetDrop : public AKSItemDrop {
	char UnknownData_360[0x8]; // 0x360(0x08)
	struct FMulticastInlineDelegate OnProjectileSpawned; // 0x368(0x10)
	char UnknownData_378[0x18]; // 0x378(0x18)
	struct AKSProjectile* ReturnProjectile; // 0x390(0x08)
	char UnknownData_398[0x8]; // 0x398(0x08)
	struct UKSWeaponComponent* WeaponComponent; // 0x3a0(0x08)
	struct UKSWeaponAsset* WeaponAsset; // 0x3a8(0x08)
	uint16_t WeaponComponentEquipmentId; // 0x3b0(0x02)
	char UnknownData_3B2[0x6]; // 0x3b2(0x06)
	struct UKSWeaponAsset* CachedWeaponAsset; // 0x3b8(0x08)
	char UnknownData_3C0[0xe8]; // 0x3c0(0xe8)
	struct FBundledAmmoInfo BundledAmmo; // 0x4a8(0x0c)
	char UnknownData_4B4[0x4]; // 0x4b4(0x04)
	struct FKSWeaponDropAttachmentContainer AttachmentContainer; // 0x4b8(0x128)
	struct FKSEquipmentContainer EquipmentContainer; // 0x5e0(0x1f0)
	float CosmeticZOffset; // 0x7d0(0x04)
	char UnknownData_7D4[0x4]; // 0x7d4(0x04)

	void SetBundledAmmoToDefault(); // Function Killstreak.KSWeaponAssetDrop.SetBundledAmmoToDefault
	void OverrideDropAmmo(int32_t ReserveAmmo, int32_t AmmoInClip); // Function Killstreak.KSWeaponAssetDrop.OverrideDropAmmo
	void OnReturnProjectileStopped(struct FHitResult HitResult); // Function Killstreak.KSWeaponAssetDrop.OnReturnProjectileStopped
	void OnRep_ReturnProjectile(); // Function Killstreak.KSWeaponAssetDrop.OnRep_ReturnProjectile
	struct UKSWeaponComponent* GetWeaponComponent(); // Function Killstreak.KSWeaponAssetDrop.GetWeaponComponent
	struct UKSWeaponAsset* GetWeaponAsset(); // Function Killstreak.KSWeaponAssetDrop.GetWeaponAsset
	struct AKSProjectile* GetReturnProjectile(); // Function Killstreak.KSWeaponAssetDrop.GetReturnProjectile
	bool GetLabelInfoForFireModeType(enum class EFireModeType FireModeType); // Function Killstreak.KSWeaponAssetDrop.GetLabelInfoForFireModeType
	bool GetLabelInfoForAmmoType(enum class EAmmoType AmmoType); // Function Killstreak.KSWeaponAssetDrop.GetLabelInfoForAmmoType
	bool CanPickupReplenishAmmo(); // Function Killstreak.KSWeaponAssetDrop.CanPickupReplenishAmmo
	void BroadcastPickupFailedInventoryFull(struct AKSCharacter* Receiver); // Function Killstreak.KSWeaponAssetDrop.BroadcastPickupFailedInventoryFull
	bool AddAttachment(struct UKSWeaponAttachment* InAttachment); // Function Killstreak.KSWeaponAssetDrop.AddAttachment
};

// Class Killstreak.KSArmorAssetDrop
// Size: 0x7e0 (Inherited: 0x7d8)
struct AKSArmorAssetDrop : public AKSWeaponAssetDrop {
	float RemainingDurability; // 0x7d8(0x04)
	char UnknownData_7DC[0x4]; // 0x7dc(0x04)
};

// Class Killstreak.KSAssetManager
// Size: 0x678 (Inherited: 0x588)
struct UKSAssetManager : public UPInv_AssetManager {
	char UnknownData_588[0xf0]; // 0x588(0xf0)
};

// Class Killstreak.KSAssetQueryHelperComponent
// Size: 0x110 (Inherited: 0xb0)
struct UKSAssetQueryHelperComponent : public UActorComponent {
	struct FGameplayTagQuery PrimaryAssetQuery; // 0xb0(0x48)
	struct TArray<struct FPrimaryAssetId> AssetIds; // 0xf8(0x10)
	int32_t LastResolvedIndex; // 0x108(0x04)
	bool bHasInitalizedAssetIdList; // 0x10c(0x01)
	char UnknownData_10D[0x3]; // 0x10d(0x03)

	struct UObject* ResolvePreviousAssetId(); // Function Killstreak.KSAssetQueryHelperComponent.ResolvePreviousAssetId
	struct UObject* ResolveNextAssetId(); // Function Killstreak.KSAssetQueryHelperComponent.ResolveNextAssetId
	struct UObject* ResolveAssetIdAtIndex(int32_t Index); // Function Killstreak.KSAssetQueryHelperComponent.ResolveAssetIdAtIndex
	int32_t GetLastResolvedIndex(); // Function Killstreak.KSAssetQueryHelperComponent.GetLastResolvedIndex
};

// Class Killstreak.KSNeutralBombDrop
// Size: 0x938 (Inherited: 0x7d8)
struct AKSNeutralBombDrop : public AKSWeaponAssetDrop {
	char UnknownData_7D8[0x4]; // 0x7d8(0x04)
	float CurrentInteractionProgress; // 0x7dc(0x04)
	struct AKSCharacter* CurrentInteractor; // 0x7e0(0x08)
	float NeutralPickupTime; // 0x7e8(0x04)
	char UnknownData_7EC[0x4]; // 0x7ec(0x04)
	struct FText NeutralPickupPrompt; // 0x7f0(0x18)
	struct FText NeutralPickupProgressText; // 0x808(0x18)
	float DisarmTime; // 0x820(0x04)
	char UnknownData_824[0x4]; // 0x824(0x04)
	struct FText DisarmPrompt; // 0x828(0x18)
	struct FText DisarmProgressText; // 0x840(0x18)
	struct UKSInteractionType* DisarmInteractionType; // 0x858(0x08)
	float MaxDisarmInteractionDistance; // 0x860(0x04)
	char UnknownData_864[0x4]; // 0x864(0x04)
	SoftClassProperty MinimapDisplayWidget; // 0x868(0x28)
	SoftClassProperty FullmapDisplayWidget; // 0x890(0x28)
	SoftClassProperty OverlayDisplayWidget; // 0x8b8(0x28)
	struct FName DisarmCameraName; // 0x8e0(0x08)
	float DisarmCameraTransitionInTime; // 0x8e8(0x04)
	float DisarmCameraTransitionOutTime; // 0x8ec(0x04)
	bool bDisarmForceCameraShoulder; // 0x8f0(0x01)
	enum class ECameraShoulder DisarmCameraShoulder; // 0x8f1(0x01)
	char UnknownData_8F2[0x2]; // 0x8f2(0x02)
	float DisarmCameraMaxRotation; // 0x8f4(0x04)
	bool DisarmCameraRotationLockout; // 0x8f8(0x01)
	bool bLockPitch; // 0x8f9(0x01)
	bool bLockYaw; // 0x8fa(0x01)
	bool bDisarmCameraShake; // 0x8fb(0x01)
	char UnknownData_8FC[0x4]; // 0x8fc(0x04)
	struct UCameraShake* DisarmCameraShake; // 0x900(0x08)
	char UnknownData_908[0x4]; // 0x908(0x04)
	int32_t TeamSpottingBitmask; // 0x90c(0x04)
	float MaxSpottingRange; // 0x910(0x04)
	float SpottingSweepRadius; // 0x914(0x04)
	float GroundCheckDistance; // 0x918(0x04)
	char UnknownData_91C[0xc]; // 0x91c(0x0c)
	struct FName SoundEventName; // 0x928(0x08)
	float SoundEventLoudness; // 0x930(0x04)
	float RepeatTimeToNotifyBots; // 0x934(0x04)

	void RequestBombReset(); // Function Killstreak.KSNeutralBombDrop.RequestBombReset
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Killstreak.KSNeutralBombDrop.OnOverlapBegin
	void OnNeutralBombStateChanged(struct FKSNeutralBombState NewState); // Function Killstreak.KSNeutralBombDrop.OnNeutralBombStateChanged
	void NotifyBots(); // Function Killstreak.KSNeutralBombDrop.NotifyBots
	bool IsSpottedByTeam(struct AKSTeamState* Team); // Function Killstreak.KSNeutralBombDrop.IsSpottedByTeam
	bool IsSpottedByPlayer(struct AController* Controller); // Function Killstreak.KSNeutralBombDrop.IsSpottedByPlayer
	float GetCurrentInteractionProgress(); // Function Killstreak.KSNeutralBombDrop.GetCurrentInteractionProgress
	void ExplodeCosmetic(); // Function Killstreak.KSNeutralBombDrop.ExplodeCosmetic
	void Explode(); // Function Killstreak.KSNeutralBombDrop.Explode
};

// Class Killstreak.KSObjectiveBase
// Size: 0x380 (Inherited: 0x220)
struct AKSObjectiveBase : public AActor {
	char UnknownData_220[0x10]; // 0x220(0x10)
	struct FMulticastInlineDelegate OnObjectiveUpdate; // 0x230(0x10)
	enum class EObjectiveIconType MapIconType; // 0x240(0x01)
	char UnknownData_241[0x3]; // 0x241(0x03)
	int32_t DisplayId; // 0x244(0x04)
	int32_t ActiveObjectiveIndex; // 0x248(0x04)
	bool bUsed; // 0x24c(0x01)
	char UnknownData_24D[0x3]; // 0x24d(0x03)
	struct FObjectiveState ObjectiveState; // 0x250(0x14)
	int32_t ObjectiveId; // 0x264(0x04)
	enum class EObjectiveType ObjectiveType; // 0x268(0x01)
	char UnknownData_269[0x3]; // 0x269(0x03)
	struct FName DefaultState; // 0x26c(0x08)
	struct FName InitialActivateState; // 0x274(0x08)
	char UnknownData_27C[0x4]; // 0x27c(0x04)
	struct FText DisplayName; // 0x280(0x18)
	struct FString ObjectiveDisplayLabel; // 0x298(0x10)
	bool bAppendActiveIndexToLabel; // 0x2a8(0x01)
	char UnknownData_2A9[0x1f]; // 0x2a9(0x1f)
	int32_t ObjectiveLootGroup; // 0x2c8(0x04)
	struct FVector NavigationLocation; // 0x2cc(0x0c)
	char UnknownData_2D8[0xc]; // 0x2d8(0x0c)
	bool UseNavLocationForDistance; // 0x2e4(0x01)
	char UnknownData_2E5[0x3]; // 0x2e5(0x03)
	SoftClassProperty MinimapDisplayWidget; // 0x2e8(0x28)
	SoftClassProperty FullmapDisplayWidget; // 0x310(0x28)
	SoftClassProperty OverlayDisplayWidget; // 0x338(0x28)
	struct UKSItemStimuliSourceComponent* StimuliSourceComponent; // 0x360(0x08)
	char UnknownData_368[0x8]; // 0x368(0x08)
	struct FName SoundEventName; // 0x370(0x08)
	float SoundEventLoudness; // 0x378(0x04)
	float RepeatTimeToNotifyBots; // 0x37c(0x04)

	void SetState(struct FName NewState, int32_t NewOwner); // Function Killstreak.KSObjectiveBase.SetState
	void ResetState(bool ClearOwner); // Function Killstreak.KSObjectiveBase.ResetState
	void OnRep_ObjectiveState(); // Function Killstreak.KSObjectiveBase.OnRep_ObjectiveState
	void OnRep_ObjectiveId(); // Function Killstreak.KSObjectiveBase.OnRep_ObjectiveId
	void NotifyBots(); // Function Killstreak.KSObjectiveBase.NotifyBots
	void HandleNewState(); // Function Killstreak.KSObjectiveBase.HandleNewState
	struct FName GetPreviousState(); // Function Killstreak.KSObjectiveBase.GetPreviousState
	int32_t GetOwningTeamOrPlayer(); // Function Killstreak.KSObjectiveBase.GetOwningTeamOrPlayer
	float GetObjectiveMeterProgressTotal(); // Function Killstreak.KSObjectiveBase.GetObjectiveMeterProgressTotal
	float GetObjectiveMeterProgress(); // Function Killstreak.KSObjectiveBase.GetObjectiveMeterProgress
	int32_t GetObjectiveId(); // Function Killstreak.KSObjectiveBase.GetObjectiveId
	struct FText GetObjectiveDisplayName(); // Function Killstreak.KSObjectiveBase.GetObjectiveDisplayName
	struct FString GetObjectiveDisplayLabel(); // Function Killstreak.KSObjectiveBase.GetObjectiveDisplayLabel
	struct FName GetCurrentState(); // Function Killstreak.KSObjectiveBase.GetCurrentState
	bool CanChangeState(struct FName NewState, int32_t NewOwner); // Function Killstreak.KSObjectiveBase.CanChangeState
	void CallOnTeamSidesFlipped(); // Function Killstreak.KSObjectiveBase.CallOnTeamSidesFlipped
	void AssignObjectiveId(int32_t NewId); // Function Killstreak.KSObjectiveBase.AssignObjectiveId
	void ActivateObjective(int32_t NewOwner); // Function Killstreak.KSObjectiveBase.ActivateObjective
};

// Class Killstreak.KSExtractionComputer
// Size: 0x468 (Inherited: 0x380)
struct AKSExtractionComputer : public AKSObjectiveBase {
	char UnknownData_380[0x8]; // 0x380(0x08)
	struct UKSInteractionBlockerManager* InteractionBlockerManager; // 0x388(0x08)
	char UnknownData_390[0x10]; // 0x390(0x10)
	int32_t FavoredSide; // 0x3a0(0x04)
	float TimeToHack; // 0x3a4(0x04)
	float TimeToDehack; // 0x3a8(0x04)
	float CurrentInteractionProgress; // 0x3ac(0x04)
	struct UKSInteractionManager* CurrentInteractionManager; // 0x3b0(0x08)
	struct AKSCharacter* ComputerUser; // 0x3b8(0x08)
	struct FText HackingInteractionProgressText; // 0x3c0(0x18)
	struct FText DehackingInteractionProgressText; // 0x3d8(0x18)
	struct FText HackingInteractionPromptText; // 0x3f0(0x18)
	struct FText DehackingInteractionPromptText; // 0x408(0x18)
	struct USphereComponent* InteractionRangeSphereComponent; // 0x420(0x08)
	struct FVector RelativeInteractionPoint; // 0x428(0x0c)
	struct FName CameraName; // 0x434(0x08)
	float CameraTransitionInTime; // 0x43c(0x04)
	float CameraTransitionOutTime; // 0x440(0x04)
	bool bForceCameraShoulder; // 0x444(0x01)
	enum class ECameraShoulder CameraShoulder; // 0x445(0x01)
	char UnknownData_446[0x2]; // 0x446(0x02)
	float CameraMaxRotation; // 0x448(0x04)
	bool CameraRotationLockout; // 0x44c(0x01)
	bool bLockPitch; // 0x44d(0x01)
	bool bLockYaw; // 0x44e(0x01)
	bool FacesInteract; // 0x44f(0x01)
	bool bCameraShake; // 0x450(0x01)
	char UnknownData_451[0x7]; // 0x451(0x07)
	struct UCameraShake* CameraShake; // 0x458(0x08)
	char UnknownData_460[0x8]; // 0x460(0x08)

	void LocalHoverStateChanged(bool bIsHovered); // Function Killstreak.KSExtractionComputer.LocalHoverStateChanged
	void InteractionEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Killstreak.KSExtractionComputer.InteractionEndOverlap
	void InteractionComplete(); // Function Killstreak.KSExtractionComputer.InteractionComplete
};

// Class Killstreak.KSAudioManager
// Size: 0x140 (Inherited: 0x28)
struct UKSAudioManager : public UObject {
	struct UKSAudioPlayerStateParameterData* AudioPlayerStateParameters; // 0x28(0x08)
	char UnknownData_30[0x20]; // 0x30(0x20)
	struct TMap<struct FString, struct UDataTable*> LoadedAudioDataTables; // 0x50(0x50)
	char UnknownData_A0[0x80]; // 0xa0(0x80)
	struct FWeakObjectPtr<struct UKSGameInstance> WeakGameInstance; // 0x120(0x08)
	char UnknownData_128[0x18]; // 0x128(0x18)

	void HandleTeamCinematicStarted(); // Function Killstreak.KSAudioManager.HandleTeamCinematicStarted
	void HandleSkydiveStarted(struct AKSCharacter* Diver); // Function Killstreak.KSAudioManager.HandleSkydiveStarted
	void HandleSkydiveSkipped(struct AKSCharacter* Diver); // Function Killstreak.KSAudioManager.HandleSkydiveSkipped
	void HandleSkydiveEnded(struct AKSCharacter* Diver); // Function Killstreak.KSAudioManager.HandleSkydiveEnded
	void HandleRoundHasEnded(int32_t RoundWinner, int32_t MatchWinner); // Function Killstreak.KSAudioManager.HandleRoundHasEnded
	void HandlePostSelectionPhaseBeginFadeOut(); // Function Killstreak.KSAudioManager.HandlePostSelectionPhaseBeginFadeOut
	void HandlePhaseChanged(struct FName NewPhaseName, struct FName PreviousPhaseName); // Function Killstreak.KSAudioManager.HandlePhaseChanged
	void HandleMatchTimerUpdate(float TimeInWholeSeconds); // Function Killstreak.KSAudioManager.HandleMatchTimerUpdate
	void HandleLoadingScreenEnded(); // Function Killstreak.KSAudioManager.HandleLoadingScreenEnded
	void HandleLoadingScreenBegan(); // Function Killstreak.KSAudioManager.HandleLoadingScreenBegan
	void HandleLeavingMap(); // Function Killstreak.KSAudioManager.HandleLeavingMap
	void HandleLastManStanding(struct AKSPlayerState* LastPlayer); // Function Killstreak.KSAudioManager.HandleLastManStanding
	void HandleKillcamStarted(); // Function Killstreak.KSAudioManager.HandleKillcamStarted
	void HandleGameStateEndPlay(struct AKSGameState* GameState); // Function Killstreak.KSAudioManager.HandleGameStateEndPlay
	void HandleGameStateBeginPlay(struct AKSGameState* GameState); // Function Killstreak.KSAudioManager.HandleGameStateBeginPlay
	void HandleGameModeReceived(); // Function Killstreak.KSAudioManager.HandleGameModeReceived
	void HandleDropshipDoorOpened(); // Function Killstreak.KSAudioManager.HandleDropshipDoorOpened
	void HandleControlPointCaptured(struct AKSTeamState* CapturingTeam); // Function Killstreak.KSAudioManager.HandleControlPointCaptured
	void HandleBombStateChanged(struct FKSNeutralBombState BombState); // Function Killstreak.KSAudioManager.HandleBombStateChanged
};

// Class Killstreak.KSAudioPlayer
// Size: 0x500 (Inherited: 0x220)
struct AKSAudioPlayer : public AInfo {
	struct TMap<enum class EGameplayAudioEvent, struct UKSAudioPlayerEventActionData*> GameplayEventActionMap; // 0x220(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> MapLevelStartEventActionMap; // 0x270(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> MapLevelEndEventActionMap; // 0x2c0(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> GameModeStartEventActionMap; // 0x310(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> GameModeEndEventActionMap; // 0x360(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> PlayerCharacterStartEventActionMap; // 0x3b0(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> PlayerCharacterEndEventActionMap; // 0x400(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> MusicPackStartEventActionMap; // 0x450(0x50)
	struct TMap<struct FString, struct UKSAudioPlayerEventActionData*> MusicPackEndEventActionMap; // 0x4a0(0x50)
	struct UKSAudioPlayerEventActionData* AudioPlayerBeginPlayEventActionData; // 0x4f0(0x08)
	struct UKSAudioPlayerEventActionData* AudioPlayerEndPlayEventActionData; // 0x4f8(0x08)

	struct TArray<struct FString> ComposeEventNamePriorityArray(struct FString EventName, struct UKSAudioPlayerStateParameterData* CurrentStateParameters); // Function Killstreak.KSAudioPlayer.ComposeEventNamePriorityArray
	struct TArray<struct FString> ComposeBankNamePriorityArray(struct FString BankPrefix, struct UKSAudioPlayerStateParameterData* CurrentStateParameters); // Function Killstreak.KSAudioPlayer.ComposeBankNamePriorityArray
};

// Class Killstreak.KSAudioPlayerEventActionData
// Size: 0xa0 (Inherited: 0x30)
struct UKSAudioPlayerEventActionData : public UDataAsset {
	struct TArray<struct FString> BanksToLoad; // 0x30(0x10)
	struct TArray<struct FString> BanksToUnload; // 0x40(0x10)
	struct TArray<struct FString> ContainersToPlay; // 0x50(0x10)
	struct TArray<struct FString> ContainersToStop; // 0x60(0x10)
	struct TArray<struct FString> TablesToLoad; // 0x70(0x10)
	struct TArray<struct FString> TablesToUnload; // 0x80(0x10)
	struct TArray<struct FString> EventsToPost; // 0x90(0x10)
};

// Class Killstreak.KSAudioPlayerStateParameterData
// Size: 0xb8 (Inherited: 0x28)
struct UKSAudioPlayerStateParameterData : public UObject {
	struct FString ActiveGameMode; // 0x28(0x10)
	struct FString ActiveMapLevel; // 0x38(0x10)
	struct FString ActiveMusicPack; // 0x48(0x10)
	struct FString ActivePlayerCharacter; // 0x58(0x10)
	bool IsSpectating; // 0x68(0x01)
	char UnknownData_69[0x7]; // 0x69(0x07)
	struct FString PreviousGameMode; // 0x70(0x10)
	struct FString PreviousMapLevel; // 0x80(0x10)
	struct FString PreviousMusicPack; // 0x90(0x10)
	struct FString PreviousPlayerCharacter; // 0xa0(0x10)
	bool PreviousIsSpectating; // 0xb0(0x01)
	char UnknownData_B1[0x7]; // 0xb1(0x07)

	bool HasActivePlayerCharacter(); // Function Killstreak.KSAudioPlayerStateParameterData.HasActivePlayerCharacter
	bool HasActiveMusicPack(); // Function Killstreak.KSAudioPlayerStateParameterData.HasActiveMusicPack
	bool HasActiveMapLevel(); // Function Killstreak.KSAudioPlayerStateParameterData.HasActiveMapLevel
	bool HasActiveGameMode(); // Function Killstreak.KSAudioPlayerStateParameterData.HasActiveGameMode
	struct FString GetPreviousPlayerCharacter(); // Function Killstreak.KSAudioPlayerStateParameterData.GetPreviousPlayerCharacter
	struct FString GetPreviousMusicPack(); // Function Killstreak.KSAudioPlayerStateParameterData.GetPreviousMusicPack
	struct FString GetPreviousMapLevel(); // Function Killstreak.KSAudioPlayerStateParameterData.GetPreviousMapLevel
	bool GetPreviousIsSpectating(); // Function Killstreak.KSAudioPlayerStateParameterData.GetPreviousIsSpectating
	struct FString GetPreviousGameMode(); // Function Killstreak.KSAudioPlayerStateParameterData.GetPreviousGameMode
	bool GetIsSpectating(); // Function Killstreak.KSAudioPlayerStateParameterData.GetIsSpectating
	struct FString GetActivePlayerCharacter(); // Function Killstreak.KSAudioPlayerStateParameterData.GetActivePlayerCharacter
	struct FString GetActiveMusicPack(); // Function Killstreak.KSAudioPlayerStateParameterData.GetActiveMusicPack
	struct FString GetActiveMapLevel(); // Function Killstreak.KSAudioPlayerStateParameterData.GetActiveMapLevel
	struct FString GetActiveGameMode(); // Function Killstreak.KSAudioPlayerStateParameterData.GetActiveGameMode
};

// Class Killstreak.KSAutoPickupComponent
// Size: 0x160 (Inherited: 0xb0)
struct UKSAutoPickupComponent : public UActorComponent {
	float AutoPickupMinPickupTimeSinceCreation; // 0xb0(0x04)
	float AutoPickupDistance; // 0xb4(0x04)
	float AutoPickupQueryInterval; // 0xb8(0x04)
	bool bActivateAutoPickups; // 0xbc(0x01)
	char UnknownData_BD[0x3]; // 0xbd(0x03)
	struct TMap<struct UKSItem*, int32_t> ItemPriorityMap; // 0xc0(0x50)
	bool bAutoPickupClusivityEnabled; // 0x110(0x01)
	char UnknownData_111[0x7]; // 0x111(0x07)
	struct FGameplayTagQuery ClusivityQuery; // 0x118(0x48)

	void OnOwnerPossessionChanged(struct AController* Controller); // Function Killstreak.KSAutoPickupComponent.OnOwnerPossessionChanged
	void OnAutoPickupPreferenceChanged(bool bAutoPickupEnabled); // Function Killstreak.KSAutoPickupComponent.OnAutoPickupPreferenceChanged
};

// Class Killstreak.KSAvatar
// Size: 0x190 (Inherited: 0x168)
struct UKSAvatar : public UKSItem {
	struct TSoftObjectPtr<struct UTexture2D> LargeAvatarIcon; // 0x168(0x28)

	struct TSoftObjectPtr<struct UTexture2D> GetSoftLargeAvatarIcon(); // Function Killstreak.KSAvatar.GetSoftLargeAvatarIcon
};

// Class Killstreak.KSAvenger
// Size: 0xb8 (Inherited: 0x98)
struct UKSAvenger : public UKSAccoladeTracker {
	char UnknownData_98[0x8]; // 0x98(0x08)
	struct TArray<struct FPlayerCombatInfo> PlayerTrackers; // 0xa0(0x10)
	float MaxTrackerTimer; // 0xb0(0x04)
	char UnknownData_B4[0x4]; // 0xb4(0x04)

	void StoreCombatInfo(struct FCombatEventInfo ElimEvent); // Function Killstreak.KSAvenger.StoreCombatInfo
	void RemoveTracker(struct FPlayerCombatInfo CurrentTrackPlayer); // Function Killstreak.KSAvenger.RemoveTracker
	bool CheckPlayerTrackers(struct AKSPlayerState* Instigator, struct AKSPlayerState* Victim); // Function Killstreak.KSAvenger.CheckPlayerTrackers
};

// Class Killstreak.KSBanner
// Size: 0x1b8 (Inherited: 0x168)
struct UKSBanner : public UKSItem {
	struct TSoftObjectPtr<struct UTexture2D> SmallBannerIcon; // 0x168(0x28)
	struct TSoftObjectPtr<struct UTexture2D> LargeBannerIcon; // 0x190(0x28)

	struct TSoftObjectPtr<struct UTexture2D> GetSoftSmallBannerIcon(); // Function Killstreak.KSBanner.GetSoftSmallBannerIcon
	struct TSoftObjectPtr<struct UTexture2D> GetSoftLargeBannerIcon(); // Function Killstreak.KSBanner.GetSoftLargeBannerIcon
};

// Class Killstreak.KSBattlePassProgressionActivity
// Size: 0x2b8 (Inherited: 0x2b0)
struct UKSBattlePassProgressionActivity : public UKSActivity {
	enum class EKSBattlePassProgressionActivityType ReferenceType; // 0x2b0(0x01)
	char UnknownData_2B1[0x7]; // 0x2b1(0x07)
};

// Class Killstreak.KSBattlePassProgressionManager
// Size: 0x220 (Inherited: 0x210)
struct UKSBattlePassProgressionManager : public UKSActivityManagerBase {
	struct FMulticastInlineDelegate OnMiniBattlePassProgressionActivityReady; // 0x210(0x10)

	bool ShouldDisplayMiniBattlePass(); // Function Killstreak.KSBattlePassProgressionManager.ShouldDisplayMiniBattlePass
	int32_t GetMiniBattlePassXpItemId(); // Function Killstreak.KSBattlePassProgressionManager.GetMiniBattlePassXpItemId
	struct UKSActivityInstance* GetActivityInstanceByType(enum class EKSBattlePassProgressionActivityType Type, struct AKSPlayerController* Player); // Function Killstreak.KSBattlePassProgressionManager.GetActivityInstanceByType
	struct UKSBattlePassProgressionActivity* FindActivityByType(enum class EKSBattlePassProgressionActivityType Type); // Function Killstreak.KSBattlePassProgressionManager.FindActivityByType
};

// Class Killstreak.KSPlayerBehaviorRuleComponent
// Size: 0xc8 (Inherited: 0xb0)
struct UKSPlayerBehaviorRuleComponent : public UKSBehaviorRuleBaseComponent {
	struct AController* FilteredPlayer; // 0xb0(0x08)
	struct AKSTeamState* FilteredTeam; // 0xb8(0x08)
	enum class EPlayerBehaviorChangeReact PlayerSetChangeReaction; // 0xc0(0x01)
	char UnknownData_C1[0x7]; // 0xc1(0x07)

	void SetTeamFilter(struct AKSTeamState* NewFilteredTeam); // Function Killstreak.KSPlayerBehaviorRuleComponent.SetTeamFilter
	void SetPlayerFilter(struct AController* NewFilteredPlayer); // Function Killstreak.KSPlayerBehaviorRuleComponent.SetPlayerFilter
	void OnPlayerFilterControllerLogout(bool bWasActive); // Function Killstreak.KSPlayerBehaviorRuleComponent.OnPlayerFilterControllerLogout
	void ClearTeamFilter(); // Function Killstreak.KSPlayerBehaviorRuleComponent.ClearTeamFilter
	void ClearPlayerFilter(); // Function Killstreak.KSPlayerBehaviorRuleComponent.ClearPlayerFilter
	void ClearBehaviorChange(struct TArray<struct AController*> Players); // Function Killstreak.KSPlayerBehaviorRuleComponent.ClearBehaviorChange
	void ApplyBehaviorChange(struct TArray<struct AController*> Players); // Function Killstreak.KSPlayerBehaviorRuleComponent.ApplyBehaviorChange
};

// Class Killstreak.KSFXCurveComponent
// Size: 0x130 (Inherited: 0xb0)
struct UKSFXCurveComponent : public UActorComponent {
	char UnknownData_B0[0x50]; // 0xb0(0x50)
	struct UMaterialInstanceDynamic* PostProcessMID; // 0x100(0x08)
	struct UMaterialInterface* PostProcessMIDParent; // 0x108(0x08)
	struct UParticleSystemComponent* ParticleSystem; // 0x110(0x08)
	struct UParticleSystem* ParticleSystemParent; // 0x118(0x08)
	bool bPlaying; // 0x120(0x01)
	bool bReversing; // 0x121(0x01)
	bool bLooping; // 0x122(0x01)
	char UnknownData_123[0x1]; // 0x123(0x01)
	float CurrentTime; // 0x124(0x04)
	char UnknownData_128[0x8]; // 0x128(0x08)

	void UpdateScalarTrack(struct FName TrackName, float TrackValue); // Function Killstreak.KSFXCurveComponent.UpdateScalarTrack
	void UpdateColorTrack(struct FName TrackName, struct FLinearColor TrackValue); // Function Killstreak.KSFXCurveComponent.UpdateColorTrack
	void Stop(); // Function Killstreak.KSFXCurveComponent.Stop
	void Reverse(); // Function Killstreak.KSFXCurveComponent.Reverse
	void ResetTime(); // Function Killstreak.KSFXCurveComponent.ResetTime
	void Play(); // Function Killstreak.KSFXCurveComponent.Play
	bool IsPlaying(); // Function Killstreak.KSFXCurveComponent.IsPlaying
	struct FName GetFxID(); // Function Killstreak.KSFXCurveComponent.GetFxID
	struct AKSCharacter* GetCharacterOwner(); // Function Killstreak.KSFXCurveComponent.GetCharacterOwner
};

// Class Killstreak.KSBloodSplatterComponent
// Size: 0x138 (Inherited: 0x130)
struct UKSBloodSplatterComponent : public UKSFXCurveComponent {
	float Damage; // 0x130(0x04)
	char UnknownData_134[0x4]; // 0x134(0x04)

	void AddDamageInstance(float DamageAmount, struct FVector DamageOrigin); // Function Killstreak.KSBloodSplatterComponent.AddDamageInstance
};

// Class Killstreak.KSBlueprintableInteractable
// Size: 0x2f0 (Inherited: 0x220)
struct AKSBlueprintableInteractable : public AActor {
	char UnknownData_220[0x8]; // 0x220(0x08)
	struct UKSInteractionBlockerManager* InteractionBlockerManager; // 0x228(0x08)
	float Duration; // 0x230(0x04)
	bool bCanInteractFromBehind; // 0x234(0x01)
	bool bCanInteractWhileDowned; // 0x235(0x01)
	bool bShouldDisplayInteractionProgress; // 0x236(0x01)
	char UnknownData_237[0x1]; // 0x237(0x01)
	struct FName InteractionName; // 0x238(0x08)
	int32_t MaxNumberOfInteractors; // 0x240(0x04)
	int32_t InteractionPriority; // 0x244(0x04)
	bool bInteractionAllowed; // 0x248(0x01)
	char UnknownData_249[0x7]; // 0x249(0x07)
	struct UKSInteractionType* InteractionType; // 0x250(0x08)
	struct TArray<struct UPrimitiveComponent*> OutlinedComponents; // 0x258(0x10)
	char UnknownData_268[0x10]; // 0x268(0x10)
	struct TArray<struct UKSInteractionManager*> ActiveInteractions; // 0x278(0x10)
	int32_t NumActiveInteractions; // 0x288(0x04)
	char UnknownData_28C[0x4]; // 0x28c(0x04)
	struct FText ProgressText; // 0x290(0x18)
	struct FText PromptText; // 0x2a8(0x18)
	struct FMulticastInlineDelegate OnInteractionStarted; // 0x2c0(0x10)
	struct FMulticastInlineDelegate OnInteractionEnded; // 0x2d0(0x10)
	struct FMulticastInlineDelegate OnInteractionComplete; // 0x2e0(0x10)

	void SetInteractability(bool NewInteractable); // Function Killstreak.KSBlueprintableInteractable.SetInteractability
	void InterruptInteraction(struct AKSCharacter* InteractingCharacter, bool bForce); // Function Killstreak.KSBlueprintableInteractable.InterruptInteraction
	void InterruptAllInteractions(bool bForce); // Function Killstreak.KSBlueprintableInteractable.InterruptAllInteractions
	bool InternalCanInteractOnPress(struct AKSCharacter* InteractingCharacter); // Function Killstreak.KSBlueprintableInteractable.InternalCanInteractOnPress
	bool InternalCanInteractOnHold(struct AKSCharacter* InteractingCharacter); // Function Killstreak.KSBlueprintableInteractable.InternalCanInteractOnHold
	void BlueprintInteractionStarted(struct AKSCharacter* InteractingCharacter, float InDuration); // Function Killstreak.KSBlueprintableInteractable.BlueprintInteractionStarted
	struct FVector BlueprintInteractionPoint(); // Function Killstreak.KSBlueprintableInteractable.BlueprintInteractionPoint
	void BlueprintInteractionEnded(struct AKSCharacter* InteractingCharacter); // Function Killstreak.KSBlueprintableInteractable.BlueprintInteractionEnded
	void AddOutlinedPrimitiveComponent(struct UPrimitiveComponent* InComponent); // Function Killstreak.KSBlueprintableInteractable.AddOutlinedPrimitiveComponent
};

// Class Killstreak.KSInteractionState
// Size: 0x30 (Inherited: 0x28)
struct UKSInteractionState : public UObject {
	enum class EKSInteractionResult Result; // 0x28(0x01)
	char UnknownData_29[0x7]; // 0x29(0x07)
};

// Class Killstreak.KSBorder
// Size: 0x1b8 (Inherited: 0x168)
struct UKSBorder : public UKSItem {
	struct TSoftObjectPtr<struct UTexture2D> SmallBorderIcon; // 0x168(0x28)
	struct TSoftObjectPtr<struct UTexture2D> LargeBorderIcon; // 0x190(0x28)

	struct TSoftObjectPtr<struct UTexture2D> GetSoftSmallBorderIcon(); // Function Killstreak.KSBorder.GetSoftSmallBorderIcon
	struct TSoftObjectPtr<struct UTexture2D> GetSoftLargeBorderIcon(); // Function Killstreak.KSBorder.GetSoftLargeBorderIcon
};

// Class Killstreak.KSBotDefinition
// Size: 0x1d8 (Inherited: 0x30)
struct UKSBotDefinition : public UDataAsset {
	struct FString FriendlySearchName; // 0x30(0x10)
	struct FBotSpawnTableRow Info; // 0x40(0x198)
};

// Class Killstreak.KSBotDefinitionCollection
// Size: 0x40 (Inherited: 0x30)
struct UKSBotDefinitionCollection : public UDataAsset {
	struct TArray<struct UKSBotDefinition*> BotDefinitions; // 0x30(0x10)
};

// Class Killstreak.KSBotEncounter
// Size: 0x68 (Inherited: 0x30)
struct UKSBotEncounter : public UDataAsset {
	int32_t BotSideNumber; // 0x30(0x04)
	bool bUseTeamInsteadOfSide; // 0x34(0x01)
	char UnknownData_35[0x3]; // 0x35(0x03)
	int32_t BotTeamNumber; // 0x38(0x04)
	char UnknownData_3C[0x4]; // 0x3c(0x04)
	struct TArray<struct UKSEncounterWave*> BotWaves; // 0x40(0x10)
	struct FName nmEncounterName; // 0x50(0x08)
	char UnknownData_58[0x8]; // 0x58(0x08)
	struct AKSTeamState* CachedTeamState; // 0x60(0x08)

	char GetTotalWaveNumber(); // Function Killstreak.KSBotEncounter.GetTotalWaveNumber
	struct FName GetEncounterName(); // Function Killstreak.KSBotEncounter.GetEncounterName
	char GetCurrentWaveNumber(); // Function Killstreak.KSBotEncounter.GetCurrentWaveNumber
	struct UKSEncounterWave* GetCurrentWave(); // Function Killstreak.KSBotEncounter.GetCurrentWave
	struct TArray<struct FName> ChooseNSpawnTableRows(int32_t nCount); // Function Killstreak.KSBotEncounter.ChooseNSpawnTableRows
	int32_t AdvanceWave(); // Function Killstreak.KSBotEncounter.AdvanceWave
};

// Class Killstreak.KSBotFactory
// Size: 0x338 (Inherited: 0x220)
struct AKSBotFactory : public AActor {
	bool bFinishPrecacheOnBeginPlay; // 0x220(0x01)
	bool bUseTeamInsteadOfSide; // 0x221(0x01)
	char UnknownData_222[0x2]; // 0x222(0x02)
	int32_t SideNum; // 0x224(0x04)
	int32_t TeamNum; // 0x228(0x04)
	enum class ECharacterBehaviorState InitialBehaviorState; // 0x22c(0x01)
	char UnknownData_22D[0x3]; // 0x22d(0x03)
	struct UKSBotDefinitionCollection* SpawnCollection; // 0x230(0x08)
	bool bSpawnHidden; // 0x238(0x01)
	bool bRandomBot; // 0x239(0x01)
	bool bWithoutReplacement; // 0x23a(0x01)
	bool bRandomLoadout; // 0x23b(0x01)
	bool bPreserveAIControllers; // 0x23c(0x01)
	bool OverrideTeamSizeFromQueue; // 0x23d(0x01)
	char UnknownData_23E[0x2]; // 0x23e(0x02)
	int32_t FillTeamTo; // 0x240(0x04)
	char UnknownData_244[0x4]; // 0x244(0x04)
	struct AKSWayPointSet* WayPointSet; // 0x248(0x08)
	bool ShouldReverseWayPointSetDirection; // 0x250(0x01)
	char UnknownData_251[0x7]; // 0x251(0x07)
	struct TArray<struct APlayerStart*> SpawnPoints; // 0x258(0x10)
	int32_t SpawnOnBeginPlay; // 0x268(0x04)
	int32_t SpawnOnRoundStart; // 0x26c(0x04)
	struct AKSDropShipLocation* AssociatedDropShipLocation; // 0x270(0x08)
	int32_t SpawnOnRoundSetup; // 0x278(0x04)
	int32_t SpawnOnCollectionTimeout; // 0x27c(0x04)
	int32_t SpawnOnHackTimeout; // 0x280(0x04)
	int32_t SpawnOnEscapeTimeout; // 0x284(0x04)
	int32_t SpawnOnDownloadStart; // 0x288(0x04)
	int32_t SpawnOnAlarm; // 0x28c(0x04)
	int32_t MinSpawnCount; // 0x290(0x04)
	int32_t MaxSpawnCount; // 0x294(0x04)
	bool bMaintainCountOnBotDeath; // 0x298(0x01)
	char UnknownData_299[0x7]; // 0x299(0x07)
	struct TArray<struct AKSAIController*> ActiveBots; // 0x2a0(0x10)
	struct AKSTeamState* TeamState; // 0x2b0(0x08)
	int32_t NextSequentialSpawnStart; // 0x2b8(0x04)
	int32_t CurrentLoadoutSeed; // 0x2bc(0x04)
	struct TArray<struct FName> RelevantObjectiveStates; // 0x2c0(0x10)
	struct TArray<struct FName> RelevantGameStatesForObjectiveSpawning; // 0x2d0(0x10)
	int32_t NumberOfTimesToSpawnForObjectiveRelevancy; // 0x2e0(0x04)
	char UnknownData_2E4[0x4]; // 0x2e4(0x04)
	struct UBoxComponent* RelevancyVolume; // 0x2e8(0x08)
	struct TArray<struct AKSCharacter*> ContainedPlayers; // 0x2f0(0x10)
	struct TArray<struct AKSObjectiveBase*> ContainedObjectives; // 0x300(0x10)
	char UnknownData_310[0x28]; // 0x310(0x28)

	void UnhideSpawnedBots(); // Function Killstreak.KSBotFactory.UnhideSpawnedBots
	struct TArray<struct AKSAIController*> Spawn(int32_t Count); // Function Killstreak.KSBotFactory.Spawn
	void ShuffleSpawnPoints(); // Function Killstreak.KSBotFactory.ShuffleSpawnPoints
	void SetWayPointSet(struct AKSWayPointSet* InWPS); // Function Killstreak.KSBotFactory.SetWayPointSet
	void SetSpawnPoints(struct TArray<struct APlayerStart*> InPlayerStarts); // Function Killstreak.KSBotFactory.SetSpawnPoints
	void SetSideNum(int32_t InSideNum); // Function Killstreak.KSBotFactory.SetSideNum
	void SetShouldReverseWayPointSetDirection(bool InShouldReverse); // Function Killstreak.KSBotFactory.SetShouldReverseWayPointSetDirection
	void SetBotSpawnCollection(struct UKSBotDefinitionCollection* InSpawnCollection); // Function Killstreak.KSBotFactory.SetBotSpawnCollection
	void RestartBots(); // Function Killstreak.KSBotFactory.RestartBots
	void OnSpawnedBotDestroyed(struct AActor* DestroyedActor); // Function Killstreak.KSBotFactory.OnSpawnedBotDestroyed
	void OnRoundStart(struct FRoundInitState RoundInitState); // Function Killstreak.KSBotFactory.OnRoundStart
	void OnRoundSetup(struct FRoundInitState RoundInitState); // Function Killstreak.KSBotFactory.OnRoundSetup
	void OnRelevancyOverlapEnd(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Killstreak.KSBotFactory.OnRelevancyOverlapEnd
	void OnRelevancyOverlapBegin(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Killstreak.KSBotFactory.OnRelevancyOverlapBegin
	void OnPhaseChanged(struct FName PreviousPhaseName, struct FName NewPhaseName); // Function Killstreak.KSBotFactory.OnPhaseChanged
	void OnExtractionPhaseTimeout(struct FName PhaseName); // Function Killstreak.KSBotFactory.OnExtractionPhaseTimeout
	void OnAllPlayersFinishedPrePrep(); // Function Killstreak.KSBotFactory.OnAllPlayersFinishedPrePrep
	void OnAlarmPeriodStart(); // Function Killstreak.KSBotFactory.OnAlarmPeriodStart
	void HideSpawnedBots(); // Function Killstreak.KSBotFactory.HideSpawnedBots
	int32_t GetTeamSize(); // Function Killstreak.KSBotFactory.GetTeamSize
};

// Class Killstreak.KSBotJobConfigMap
// Size: 0x80 (Inherited: 0x30)
struct UKSBotJobConfigMap : public UDataAsset {
	struct TMap<struct TSoftObjectPtr<struct UKSJobItem>, struct FKSBotJobConfig> JobConfigs; // 0x30(0x50)
};

// Class Killstreak.KSBoxDeadZoneFilter
// Size: 0x48 (Inherited: 0x38)
struct UKSBoxDeadZoneFilter : public UKSAnalogStickFilter {
	struct FVector2D InnerDeadZone; // 0x38(0x08)
	struct FVector2D OuterDeadZone; // 0x40(0x08)
};

// Class Killstreak.KSBRC_GiveEquipment
// Size: 0xe0 (Inherited: 0xc8)
struct UKSBRC_GiveEquipment : public UKSPlayerBehaviorRuleComponent {
	bool bAddToLoadout; // 0xc8(0x01)
	char UnknownData_C9[0x7]; // 0xc9(0x07)
	struct TArray<struct UKSItem*> ItemsToGive; // 0xd0(0x10)
};

// Class Killstreak.KSBTAbilityConditionValidator
// Size: 0x1b0 (Inherited: 0x30)
struct UKSBTAbilityConditionValidator : public UDataAsset {
	bool bShouldUsePerceptionFilter; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct TArray<struct UAISense*> SensesToUse; // 0x38(0x10)
	struct FKSPerceptionFilter PerceptionFilter; // 0x48(0x158)
	int32_t MinPerceivedStimuliCount; // 0x1a0(0x04)
	bool bCheckCombatTarget; // 0x1a4(0x01)
	bool bCheckTargetVisible; // 0x1a5(0x01)
	bool bCheckTargetHidden; // 0x1a6(0x01)
	bool bCheckDistance; // 0x1a7(0x01)
	float MinDistanceMeters; // 0x1a8(0x04)
	float MaxDistanceMeters; // 0x1ac(0x04)
};

// Class Killstreak.KSBTAction
// Size: 0x40 (Inherited: 0x30)
struct UKSBTAction : public UDataAsset {
	struct FString ActionName; // 0x30(0x10)
};

// Class Killstreak.KSBTD_AbilityState
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_AbilityState : public UBTDecorator_BlackboardBase {
	bool bCheckAbilityReady; // 0x90(0x01)
	char AbilityReady; // 0x91(0x01)
	bool bCheckActive; // 0x92(0x01)
	char AbilityActive; // 0x93(0x01)
	char UnknownData_94[0x4]; // 0x94(0x04)
};

// Class Killstreak.KSBTD_AnyActorPerceived
// Size: 0x1d0 (Inherited: 0x68)
struct UKSBTD_AnyActorPerceived : public UBTDecorator {
	struct TArray<struct UAISense*> SensesToUse; // 0x68(0x10)
	struct FKSPerceptionFilter PerceptionFilter; // 0x78(0x158)
};

// Class Killstreak.KSBTD_BlackboardPerceived
// Size: 0xa8 (Inherited: 0x90)
struct UKSBTD_BlackboardPerceived : public UBTDecorator_BlackboardBase {
	struct TArray<struct UAISense*> SensesToUse; // 0x90(0x10)
	struct FName PerceptionEvent; // 0xa0(0x08)
};

// Class Killstreak.KSBTD_CanActivateAbility
// Size: 0x90 (Inherited: 0x68)
struct UKSBTD_CanActivateAbility : public UBTDecorator {
	struct TSoftObjectPtr<struct UKSPlayerMod> Ability; // 0x68(0x28)
};

// Class Killstreak.KSBTD_CanActivateUniqueAbility
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_CanActivateUniqueAbility : public UBTDecorator {
	struct UDataTable* AbilityValidatorTable; // 0x68(0x08)
};

// Class Killstreak.KSBTD_CharacterState
// Size: 0x128 (Inherited: 0x90)
struct UKSBTD_CharacterState : public UBTDecorator_BlackboardBase {
	struct FKSCharacterStateFilter CharacterStateFilter; // 0x90(0x98)
};

// Class Killstreak.KSBTD_CheckRole
// Size: 0x80 (Inherited: 0x68)
struct UKSBTD_CheckRole : public UBTDecorator {
	struct TArray<enum class ECharacterRole> RequiredRoles; // 0x68(0x10)
	bool RequireAll; // 0x78(0x01)
	char UnknownData_79[0x7]; // 0x79(0x07)
};

// Class Killstreak.KSBTD_CheckUniqueAbilityType
// Size: 0x78 (Inherited: 0x68)
struct UKSBTD_CheckUniqueAbilityType : public UBTDecorator {
	struct UDataTable* AbilityValidatorTable; // 0x68(0x08)
	enum class EAbilityExecutionType AbilityExecutionType; // 0x70(0x01)
	char UnknownData_71[0x7]; // 0x71(0x07)
};

// Class Killstreak.KSBTD_CompareBetweenBlackboards
// Size: 0x108 (Inherited: 0x68)
struct UKSBTD_CompareBetweenBlackboards : public UBTDecorator {
	struct FBlackboardKeySelector SourceBlackboardActor; // 0x68(0x28)
	struct FBlackboardKeySelector SourceKey; // 0x90(0x28)
	struct FBlackboardKeySelector TargetBlackboardActor; // 0xb8(0x28)
	struct FBlackboardKeySelector TargetKey; // 0xe0(0x28)
};

// Class Killstreak.KSBTD_CompareBlackboardToValue
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_CompareBlackboardToValue : public UBTDecorator_BlackboardBase {
	float TargetValue; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
};

// Class Killstreak.KSBTD_CompareGrenadeFuseTimeLeft
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_CompareGrenadeFuseTimeLeft : public UBTDecorator {
	float Time; // 0x68(0x04)
	char ArithmeticOperation; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
};

// Class Killstreak.KSBTD_CompareKeyToObjective
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_CompareKeyToObjective : public UBTDecorator_BlackboardBase {
	struct UKSBTObjective* Objective; // 0x90(0x08)
};

// Class Killstreak.KSBTD_CompareMatchPhaseTimeLeft
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_CompareMatchPhaseTimeLeft : public UBTDecorator {
	float Time; // 0x68(0x04)
	char ArithmeticOperation; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
};

// Class Killstreak.KSBTD_CompareRoundNumber
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_CompareRoundNumber : public UBTDecorator {
	int32_t RoundNumber; // 0x68(0x04)
	char ArithmeticOperation; // 0x6c(0x01)
	char UnknownData_6D[0x3]; // 0x6d(0x03)
};

// Class Killstreak.KSBTD_DestroyableHazardState
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_DestroyableHazardState : public UBTDecorator_BlackboardBase {
	struct FKSDestroyableHazardStateFilter DestroyableHazardStateFilter; // 0x90(0x07)
	char UnknownData_97[0x1]; // 0x97(0x01)
};

// Class Killstreak.KSBTD_DestructibleState
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_DestructibleState : public UBTDecorator_BlackboardBase {
	struct FKSDestructibleStateFilter DestructibleStateFilter; // 0x90(0x02)
	char UnknownData_92[0x6]; // 0x92(0x06)
};

// Class Killstreak.KSBTD_DistanceFromBlackboard
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_DistanceFromBlackboard : public UBTDecorator_BlackboardBase {
	char ArithmeticOperation; // 0x90(0x01)
	char UnknownData_91[0x3]; // 0x91(0x03)
	float DistanceThreshold; // 0x94(0x04)
};

// Class Killstreak.KSBTD_EquipmentState
// Size: 0xf8 (Inherited: 0x68)
struct UKSBTD_EquipmentState : public UBTDecorator {
	struct FGameplayTag EquipPoint; // 0x68(0x08)
	bool bCheckIsEquipped; // 0x70(0x01)
	char IsEquipped; // 0x71(0x01)
	bool bCheckIsActiveWeapon; // 0x72(0x01)
	char IsActiveWeapon; // 0x73(0x01)
	bool bCheckIsReloading; // 0x74(0x01)
	char IsReloading; // 0x75(0x01)
	bool bCheckEquipmentType; // 0x76(0x01)
	char EquipmentType; // 0x77(0x01)
	struct FGameplayTagContainer ComparedEquipmentTypes; // 0x78(0x20)
	bool bCheckEquipmentClass; // 0x98(0x01)
	char EquipmentClassComparison; // 0x99(0x01)
	char UnknownData_9A[0x6]; // 0x9a(0x06)
	SoftClassProperty ComparedEquipmentClass; // 0xa0(0x28)
	bool bCheckComponentClass; // 0xc8(0x01)
	char ComponentClassComparison; // 0xc9(0x01)
	char UnknownData_CA[0x6]; // 0xca(0x06)
	SoftClassProperty ComparedComponentClass; // 0xd0(0x28)
};

// Class Killstreak.KSBTD_GameState
// Size: 0x78 (Inherited: 0x68)
struct UKSBTD_GameState : public UBTDecorator {
	bool bCheckMatchInProgress; // 0x68(0x01)
	char MatchInProgress; // 0x69(0x01)
	bool bCheckMatchPhase; // 0x6a(0x01)
	char MatchPhase; // 0x6b(0x01)
	struct FName MatchPhaseName; // 0x6c(0x08)
	char UnknownData_74[0x4]; // 0x74(0x04)
};

// Class Killstreak.KSBTD_HasAmmo
// Size: 0x80 (Inherited: 0x68)
struct UKSBTD_HasAmmo : public UBTDecorator {
	struct FGameplayTag EquipPoint; // 0x68(0x08)
	char ClipOperation; // 0x70(0x01)
	char UnknownData_71[0x3]; // 0x71(0x03)
	float ClipPercentage; // 0x74(0x04)
	bool bOrCheck; // 0x78(0x01)
	char InventoryOperation; // 0x79(0x01)
	char UnknownData_7A[0x2]; // 0x7a(0x02)
	float InventoryPercentage; // 0x7c(0x04)
};

// Class Killstreak.KSBTD_HasBeenHitRecently
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_HasBeenHitRecently : public UBTDecorator {
	float MaxTimeSinceHit; // 0x68(0x04)
	char UnknownData_6C[0x4]; // 0x6c(0x04)
};

// Class Killstreak.KSBTD_HasSwappedEquipment
// Size: 0x90 (Inherited: 0x68)
struct UKSBTD_HasSwappedEquipment : public UBTDecorator {
	struct FBlackboardKeySelector CachedWeaponClassKey; // 0x68(0x28)
};

// Class Killstreak.KSBTD_InteractableState
// Size: 0xa8 (Inherited: 0x90)
struct UKSBTD_InteractableState : public UBTDecorator_BlackboardBase {
	struct FKSInteractableStateFilter InteractableStateFilter; // 0x90(0x18)
};

// Class Killstreak.KSBTD_IsActionAllowed
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_IsActionAllowed : public UBTDecorator {
	struct UKSBTAction* Action; // 0x68(0x08)
};

// Class Killstreak.KSBTD_IsApproachingDropLocation
// Size: 0xb8 (Inherited: 0x68)
struct UKSBTD_IsApproachingDropLocation : public UBTDecorator {
	struct FBlackboardKeySelector DropLocationKey; // 0x68(0x28)
	struct FBlackboardKeySelector DropLocationVectorKey; // 0x90(0x28)
};

// Class Killstreak.KSBTD_IsApproachingFall
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_IsApproachingFall : public UBTDecorator {
	float LookAheadDistance; // 0x68(0x04)
	float FallDistance; // 0x6c(0x04)
};

// Class Killstreak.KSBTD_IsGameMode
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_IsGameMode : public UBTDecorator {
	struct AGameModeBase* GameModeClass; // 0x68(0x08)
};

// Class Killstreak.KSBTD_IsWeaponFiring
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_IsWeaponFiring : public UBTDecorator {
	struct FGameplayTag EquipPoint; // 0x68(0x08)
};

// Class Killstreak.KSBTD_IsWeaponReady
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_IsWeaponReady : public UBTDecorator {
	struct FGameplayTag EquipPoint; // 0x68(0x08)
};

// Class Killstreak.KSBTD_ItemDropState
// Size: 0xa0 (Inherited: 0x90)
struct UKSBTD_ItemDropState : public UBTDecorator_BlackboardBase {
	struct FKSItemDropStateFilter ItemDropStateFilter; // 0x90(0x10)
};

// Class Killstreak.KSBTD_NearbyEnemyCount
// Size: 0x88 (Inherited: 0x68)
struct UKSBTD_NearbyEnemyCount : public UBTDecorator {
	struct TArray<struct UAISense*> SensesToUse; // 0x68(0x10)
	char ArithmeticOperation; // 0x78(0x01)
	char UnknownData_79[0x3]; // 0x79(0x03)
	int32_t EnemyCount; // 0x7c(0x04)
	float DistanceThreshold; // 0x80(0x04)
	bool bCheckLOS; // 0x84(0x01)
	char UnknownData_85[0x3]; // 0x85(0x03)
};

// Class Killstreak.KSBTD_RandomCooldown
// Size: 0x70 (Inherited: 0x68)
struct UKSBTD_RandomCooldown : public UBTDecorator {
	float MinCoolDownTime; // 0x68(0x04)
	float MaxCoolDownTime; // 0x6c(0x04)
};

// Class Killstreak.KSBTD_ShouldCrouchAtPoint
// Size: 0x90 (Inherited: 0x68)
struct UKSBTD_ShouldCrouchAtPoint : public UBTDecorator {
	struct FBlackboardKeySelector PointKey; // 0x68(0x28)
};

// Class Killstreak.KSBTD_WillActiveGrenadeHitTarget
// Size: 0x98 (Inherited: 0x90)
struct UKSBTD_WillActiveGrenadeHitTarget : public UBTDecorator_BlackboardBase {
	float OverrideMinRadius; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
};

// Class Killstreak.KSBTDifficulty
// Size: 0x40 (Inherited: 0x30)
struct UKSBTDifficulty : public UDataAsset {
	struct FString DifficultyName; // 0x30(0x10)
};

// Class Killstreak.KSBTObjective
// Size: 0x70 (Inherited: 0x30)
struct UKSBTObjective : public UDataAsset {
	struct FString ObjectiveName; // 0x30(0x10)
	struct FString ObjectiveTargetKeyName; // 0x40(0x10)
	struct TArray<struct UKSBTAction*> RequiredActions; // 0x50(0x10)
	struct TArray<struct TSoftObjectPtr<struct UKSPlayerMod>> RequiredAbilities; // 0x60(0x10)
};

// Class Killstreak.KSBTTargetSelector
// Size: 0x1a0 (Inherited: 0x30)
struct UKSBTTargetSelector : public UDataAsset {
	struct TArray<struct UAISense*> SensesToUse; // 0x30(0x10)
	struct FKSPerceptionFilter PerceptionFilter; // 0x40(0x158)
	bool SelectCombatTargetOfResult; // 0x198(0x01)
	bool SelectClosestTarget; // 0x199(0x01)
	bool SelectFurthestTarget; // 0x19a(0x01)
	bool SelectRandomTarget; // 0x19b(0x01)
	char UnknownData_19C[0x4]; // 0x19c(0x04)
};

// Class Killstreak.KSBTTask_ActivateAbility
// Size: 0x98 (Inherited: 0x70)
struct UKSBTTask_ActivateAbility : public UBTTaskNode {
	struct TSoftObjectPtr<struct UKSPlayerMod> ActivatedAbility; // 0x70(0x28)
};

// Class Killstreak.KSBTTask_LookAt
// Size: 0xc0 (Inherited: 0xa0)
struct UKSBTTask_LookAt : public UBTTask_RotateToFaceBBEntry {
	char UnknownData_A0[0x4]; // 0xa0(0x04)
	float LookRotationRate; // 0xa4(0x04)
	struct FRotator HorizonAngle; // 0xa8(0x0c)
	int32_t CorridorSmoothingCount; // 0xb4(0x04)
	int32_t FirstCorridorIndex; // 0xb8(0x04)
	char UnknownData_BC[0x4]; // 0xbc(0x04)
};

// Class Killstreak.KSBTTask_AimAt
// Size: 0xd8 (Inherited: 0xc0)
struct UKSBTTask_AimAt : public UKSBTTask_LookAt {
	float AimRadius; // 0xc0(0x04)
	struct FVector AimOffset; // 0xc4(0x0c)
	float AimAheadSeconds; // 0xd0(0x04)
	char UnknownData_D4[0x4]; // 0xd4(0x04)
};

// Class Killstreak.KSBTTask_CopyActorLocation
// Size: 0xc0 (Inherited: 0x70)
struct UKSBTTask_CopyActorLocation : public UBTTaskNode {
	struct FBlackboardKeySelector ActorKey; // 0x70(0x28)
	struct FBlackboardKeySelector LocationKey; // 0x98(0x28)
};

// Class Killstreak.KSBTTask_CopyObjectFacingVector
// Size: 0xc0 (Inherited: 0x70)
struct UKSBTTask_CopyObjectFacingVector : public UBTTaskNode {
	struct FBlackboardKeySelector CopyTarget; // 0x70(0x28)
	struct FBlackboardKeySelector FacingVector; // 0x98(0x28)
};

// Class Killstreak.KSBTTask_GetNavigationInteractTarget
// Size: 0x98 (Inherited: 0x70)
struct UKSBTTask_GetNavigationInteractTarget : public UBTTaskNode {
	struct FBlackboardKeySelector InteractTarget; // 0x70(0x28)
};

// Class Killstreak.KSBTTask_GetRotationFromPoint
// Size: 0xc0 (Inherited: 0x70)
struct UKSBTTask_GetRotationFromPoint : public UBTTaskNode {
	struct FBlackboardKeySelector MapPointActorKey; // 0x70(0x28)
	struct FBlackboardKeySelector MapPointRotationKey; // 0x98(0x28)
};

// Class Killstreak.KSBTTask_InteractWith
// Size: 0xa0 (Inherited: 0x98)
struct UKSBTTask_InteractWith : public UBTTask_BlackboardBase {
	bool ShouldHold; // 0x98(0x01)
	char UnknownData_99[0x7]; // 0x99(0x07)
};

// Class Killstreak.KSBTTask_LeaveDefensePoint
// Size: 0x98 (Inherited: 0x70)
struct UKSBTTask_LeaveDefensePoint : public UBTTaskNode {
	struct FBlackboardKeySelector DefensePoint; // 0x70(0x28)
};

// Class Killstreak.KSBTTask_LookInDirection
// Size: 0xa0 (Inherited: 0x70)
struct UKSBTTask_LookInDirection : public UBTTaskNode {
	struct FBlackboardKeySelector DirectionKey; // 0x70(0x28)
	float LookRotationRate; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
};

// Class Killstreak.KSBTTask_MakeNoiseEvent
// Size: 0x80 (Inherited: 0x70)
struct UKSBTTask_MakeNoiseEvent : public UBTTaskNode {
	float Loudness; // 0x70(0x04)
	struct FName EventTag; // 0x74(0x08)
	char UnknownData_7C[0x4]; // 0x7c(0x04)
};

// Class Killstreak.KSBTTask_MoveToBlackboard
// Size: 0xf0 (Inherited: 0xb0)
struct UKSBTTask_MoveToBlackboard : public UBTTask_MoveTo {
	float SpeedMultiplier; // 0xb0(0x04)
	bool bSprint; // 0xb4(0x01)
	char UnknownData_B5[0x3]; // 0xb5(0x03)
	struct UKSBTAction* MoveAction; // 0xb8(0x08)
	struct UKSBTAction* SprintAction; // 0xc0(0x08)
	struct FBlackboardKeySelector AcceptableRadiusOverrideKey; // 0xc8(0x28)
};

// Class Killstreak.KSBTTask_MoveToward
// Size: 0xd0 (Inherited: 0xb8)
struct UKSBTTask_MoveToward : public UBTTask_MoveDirectlyToward {
	float SpeedMultiplier; // 0xb8(0x04)
	bool bSprint; // 0xbc(0x01)
	char UnknownData_BD[0x3]; // 0xbd(0x03)
	struct UKSBTAction* MoveAction; // 0xc0(0x08)
	struct UKSBTAction* SprintAction; // 0xc8(0x08)
};

// Class Killstreak.KSBTTask_PerformRandomDodgeRoll
// Size: 0xa0 (Inherited: 0x70)
struct UKSBTTask_PerformRandomDodgeRoll : public UBTTask_PawnActionBase {
	struct TArray<float> PreferredAngles; // 0x70(0x10)
	struct TArray<float> SecondaryAngles; // 0x80(0x10)
	float MinDodgeRollMovementPercent; // 0x90(0x04)
	float DodgeRollCheckDistance; // 0x94(0x04)
	float MaximumHeightChangePerCheckDistance; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
};

// Class Killstreak.KSBTTask_PlayVO
// Size: 0x80 (Inherited: 0x70)
struct UKSBTTask_PlayVO : public UBTTaskNode {
	struct FGameplayTag VOEvent; // 0x70(0x08)
	float ChanceToPlay; // 0x78(0x04)
	char UnknownData_7C[0x4]; // 0x7c(0x04)
};

// Class Killstreak.KSBTTask_RandomizeWayPointDefensePoint
// Size: 0xc0 (Inherited: 0x70)
struct UKSBTTask_RandomizeWayPointDefensePoint : public UBTTaskNode {
	struct FBlackboardKeySelector WayPoint; // 0x70(0x28)
	struct FBlackboardKeySelector DefensePoint; // 0x98(0x28)
};

// Class Killstreak.KSBTTask_RunBehaviorForTarget
// Size: 0x168 (Inherited: 0x78)
struct UKSBTTask_RunBehaviorForTarget : public UBTTask_RunBehavior {
	struct TArray<struct FBlackboardKeySelector> SourceKeyVector; // 0x78(0x10)
	struct TArray<struct FBlackboardKeySelector> TargetKeyVector; // 0x88(0x10)
	struct TArray<float> SourceFloatVector; // 0x98(0x10)
	struct TArray<struct FBlackboardKeySelector> TargetFloatKeyVector; // 0xa8(0x10)
	struct TArray<bool> TempBools; // 0xb8(0x10)
	struct TArray<struct UObject*> TempClasses; // 0xc8(0x10)
	struct TArray<char> TempEnums; // 0xd8(0x10)
	struct TArray<float> TempFloats; // 0xe8(0x10)
	struct TArray<int32_t> TempInts; // 0xf8(0x10)
	struct TArray<struct FName> TempNames; // 0x108(0x10)
	struct TArray<char> TempNativeEnums; // 0x118(0x10)
	struct TArray<struct UObject*> TempObjects; // 0x128(0x10)
	struct TArray<struct FRotator> TempRotators; // 0x138(0x10)
	struct TArray<struct FString> TempStrings; // 0x148(0x10)
	struct TArray<struct FVector> TempVectors; // 0x158(0x10)
};

// Class Killstreak.KSBTTask_SelectBlackboardTarget
// Size: 0x200 (Inherited: 0x70)
struct UKSBTTask_SelectBlackboardTarget : public UBTTaskNode {
	struct FBlackboardKeySelector BlackboardKey; // 0x70(0x28)
	struct TArray<struct UAISense*> SensesToUse; // 0x98(0x10)
	struct FKSPerceptionFilter PerceptionFilter; // 0xa8(0x158)
};

// Class Killstreak.KSBTTask_SelectDefensePoint
// Size: 0x98 (Inherited: 0x70)
struct UKSBTTask_SelectDefensePoint : public UBTTaskNode {
	struct FBlackboardKeySelector DefensePointActorKey; // 0x70(0x28)
};

// Class Killstreak.KSBTTask_SelectDropLocation
// Size: 0xf0 (Inherited: 0x70)
struct UKSBTTask_SelectDropLocation : public UBTTaskNode {
	bool InitializeDropLocation; // 0x70(0x01)
	bool InitializeWayPointSet; // 0x71(0x01)
	char UnknownData_72[0x6]; // 0x72(0x06)
	struct FBlackboardKeySelector DropLocationKey; // 0x78(0x28)
	struct FBlackboardKeySelector DropLocationVectorKey; // 0xa0(0x28)
	struct FBlackboardKeySelector FlightLocationVectorKey; // 0xc8(0x28)
};

// Class Killstreak.KSBTTask_SelectEvadePoint
// Size: 0x208 (Inherited: 0x70)
struct UKSBTTask_SelectEvadePoint : public UBTTaskNode {
	struct FBlackboardKeySelector EvadePointKey; // 0x70(0x28)
	struct TArray<struct UAISense*> SensesToUse; // 0x98(0x10)
	struct FKSPerceptionFilter PerceptionFilter; // 0xa8(0x158)
	float Distance; // 0x200(0x04)
	char UnknownData_204[0x4]; // 0x204(0x04)
};

// Class Killstreak.KSBTTask_SelectIngressPoint
// Size: 0xa0 (Inherited: 0x70)
struct UKSBTTask_SelectIngressPoint : public UBTTaskNode {
	struct FBlackboardKeySelector IngressPointActorKey; // 0x70(0x28)
	bool bShouldLeave; // 0x98(0x01)
	char UnknownData_99[0x7]; // 0x99(0x07)
};

// Class Killstreak.KSBTTask_SelectObjective
// Size: 0xe8 (Inherited: 0x70)
struct UKSBTTask_SelectObjective : public UBTTaskNode {
	struct FBlackboardKeySelector ObjectiveTargetKey; // 0x70(0x28)
	struct FBlackboardKeySelector ObjectiveTypeKey; // 0x98(0x28)
	struct TArray<struct UKSBTObjective*> BlackboardKeyObjectives; // 0xc0(0x10)
	char UnknownData_D0[0x8]; // 0xd0(0x08)
	struct UKSBTObjective* CurrentHighestPriorityObjective; // 0xd8(0x08)
	struct AActor* CurrentHighestPriorityActor; // 0xe0(0x08)
};

// Class Killstreak.KSBTTask_SelectTargetOfTarget
// Size: 0xc0 (Inherited: 0x70)
struct UKSBTTask_SelectTargetOfTarget : public UBTTaskNode {
	struct FBlackboardKeySelector CopyTarget; // 0x70(0x28)
	struct FBlackboardKeySelector KeyToCopy; // 0x98(0x28)
};

// Class Killstreak.KSBTTask_SetBehaviorState
// Size: 0x78 (Inherited: 0x70)
struct UKSBTTask_SetBehaviorState : public UBTTaskNode {
	enum class ECharacterBehaviorState BehaviorState; // 0x70(0x01)
	char UnknownData_71[0x7]; // 0x71(0x07)
};

// Class Killstreak.KSBTTask_SetBetweenBlackboards
// Size: 0x110 (Inherited: 0x70)
struct UKSBTTask_SetBetweenBlackboards : public UBTTaskNode {
	struct FBlackboardKeySelector SourceBlackboardActor; // 0x70(0x28)
	struct FBlackboardKeySelector SourceKey; // 0x98(0x28)
	struct FBlackboardKeySelector TargetBlackboardActor; // 0xc0(0x28)
	struct FBlackboardKeySelector TargetKey; // 0xe8(0x28)
};

// Class Killstreak.KSBTTask_SetBoolOnBlackboard
// Size: 0xa0 (Inherited: 0x98)
struct UKSBTTask_SetBoolOnBlackboard : public UBTTask_BlackboardBase {
	bool BoolValue; // 0x98(0x01)
	char UnknownData_99[0x7]; // 0x99(0x07)
};

// Class Killstreak.KSBTTask_SetFloatOnBlackboard
// Size: 0xa0 (Inherited: 0x98)
struct UKSBTTask_SetFloatOnBlackboard : public UBTTask_BlackboardBase {
	float FloatValue; // 0x98(0x04)
	char UnknownData_9C[0x4]; // 0x9c(0x04)
};

// Class Killstreak.KSBTTask_SetObjectiveOnBlackboard
// Size: 0xa0 (Inherited: 0x98)
struct UKSBTTask_SetObjectiveOnBlackboard : public UBTTask_BlackboardBase {
	struct UKSBTObjective* Objective; // 0x98(0x08)
};

// Class Killstreak.KSBTTask_SetTimer
// Size: 0xa0 (Inherited: 0x98)
struct UKSBTTask_SetTimer : public UBTTask_BlackboardBase {
	float Duration; // 0x98(0x04)
	float RandomDeviation; // 0x9c(0x04)
};

// Class Killstreak.KSBTTask_SetWaypointDefenseTimer
// Size: 0xc0 (Inherited: 0x70)
struct UKSBTTask_SetWaypointDefenseTimer : public UBTTaskNode {
	struct FBlackboardKeySelector WayPoint; // 0x70(0x28)
	struct FBlackboardKeySelector DefenseTimer; // 0x98(0x28)
};

// Class Killstreak.KSBTTask_SetWeaponRanges
// Size: 0xd0 (Inherited: 0x70)
struct UKSBTTask_SetWeaponRanges : public UBTTaskNode {
	struct UDataTable* WeaponRangeConfigTable; // 0x70(0x08)
	struct FGameplayTag EquipPoint; // 0x78(0x08)
	struct FBlackboardKeySelector IdealAttackRangeKey; // 0x80(0x28)
	struct FBlackboardKeySelector StartAttackRangeKey; // 0xa8(0x28)
};

// Class Killstreak.KSBTTask_SkydiveToward
// Size: 0x100 (Inherited: 0xd0)
struct UKSBTTask_SkydiveToward : public UKSBTTask_MoveToward {
	struct FBlackboardKeySelector TargetSkydiveLocation; // 0xd0(0x28)
	float BlendStartDistance; // 0xf8(0x04)
	float BlendEndDistance; // 0xfc(0x04)
};

// Class Killstreak.KSBTTask_Strafe
// Size: 0x108 (Inherited: 0xf0)
struct UKSBTTask_Strafe : public UKSBTTask_MoveToBlackboard {
	float DirectionAngleMax; // 0xf0(0x04)
	float DirectionAngleMin; // 0xf4(0x04)
	bool bInvertAngle; // 0xf8(0x01)
	char UnknownData_F9[0x3]; // 0xf9(0x03)
	float MinDistance; // 0xfc(0x04)
	float MaxDistance; // 0x100(0x04)
	char UnknownData_104[0x4]; // 0x104(0x04)
};

// Class Killstreak.KSBTTask_UpdateCachedWeapon
// Size: 0x98 (Inherited: 0x70)
struct UKSBTTask_UpdateCachedWeapon : public UBTTaskNode {
	struct FBlackboardKeySelector CachedWeaponClassKey; // 0x70(0x28)
};

// Class Killstreak.KSBTTask_WeaponDistanceChecks
// Size: 0x168 (Inherited: 0x70)
struct UKSBTTask_WeaponDistanceChecks : public UBTTaskNode {
	float IntervalCheckRangeMeters; // 0x70(0x04)
	char UnknownData_74[0x4]; // 0x74(0x04)
	struct FBlackboardKeySelector CombatTargetKey; // 0x78(0x28)
	struct FBlackboardKeySelector IdealAttackRangeKey; // 0xa0(0x28)
	struct FBlackboardKeySelector StartAttackRangeKey; // 0xc8(0x28)
	struct FBlackboardKeySelector InIdealRangeKey; // 0xf0(0x28)
	struct FBlackboardKeySelector InAttackRangeKey; // 0x118(0x28)
	struct FBlackboardKeySelector TooCloseKey; // 0x140(0x28)
};

// Class Killstreak.KSBTTaskNode_SetCrowdFollowing
// Size: 0x78 (Inherited: 0x70)
struct UKSBTTaskNode_SetCrowdFollowing : public UBTTaskNode {
	bool bEnable; // 0x70(0x01)
	char UnknownData_71[0x7]; // 0x71(0x07)
};

// Class Killstreak.KSBuild
// Size: 0x350 (Inherited: 0x260)
struct AKSBuild : public AKSLagCompensatedActor {
	char UnknownData_260[0x30]; // 0x260(0x30)
	float PointDamageMultiplier; // 0x290(0x04)
	float RadialDamageMultiplier; // 0x294(0x04)
	float MaxHealth; // 0x298(0x04)
	float Health; // 0x29c(0x04)
	float SelfDestructDelay; // 0x2a0(0x04)
	float KillDestructionDelay; // 0x2a4(0x04)
	char UnknownData_2A8[0x10]; // 0x2a8(0x10)
	struct UBoxComponent* Box; // 0x2b8(0x08)
	struct UKSNavModifierComponent* KSNavModifierComponent; // 0x2c0(0x08)
	struct FMulticastInlineDelegate OnBuildComponentDestroyedDel; // 0x2c8(0x10)
	struct UKSInteractionBlockerManager* InteractionBlockerManager; // 0x2d8(0x08)
	struct FMulticastInlineDelegate OnBuildReclaim; // 0x2e0(0x10)
	bool bCanReclaim; // 0x2f0(0x01)
	char UnknownData_2F1[0x3]; // 0x2f1(0x03)
	struct FVector RelativeInteractionPoint; // 0x2f4(0x0c)
	float ReclaimTime; // 0x300(0x04)
	bool bRestoreWeaponOnReclaim; // 0x304(0x01)
	char UnknownData_305[0x3]; // 0x305(0x03)
	struct UKSWeaponAsset_Build* WeaponToRestore; // 0x308(0x08)
	struct FText ReclaimItemName; // 0x310(0x18)
	struct UKSInteractionType* ReclaimInteractionType; // 0x328(0x08)
	bool bBeingReclaimed; // 0x330(0x01)
	char UnknownData_331[0x7]; // 0x331(0x07)
	struct UKSItemStimuliSourceComponent* StimuliSourceComponent; // 0x338(0x08)
	char UnknownData_340[0x8]; // 0x340(0x08)
	int32_t OriginalOwnerId; // 0x348(0x04)
	char UnknownData_34C[0x4]; // 0x34c(0x04)

	void YieldToRealTimerExpired(); // Function Killstreak.KSBuild.YieldToRealTimerExpired
	void SelfDestructAfterDelay(); // Function Killstreak.KSBuild.SelfDestructAfterDelay
	void SelfDestruct(); // Function Killstreak.KSBuild.SelfDestruct
	void OnSelfDestructDelayStart(); // Function Killstreak.KSBuild.OnSelfDestructDelayStart
	void OnSelfDestruct(); // Function Killstreak.KSBuild.OnSelfDestruct
	void OnRep_Health(); // Function Killstreak.KSBuild.OnRep_Health
	void OnRadialDamageTaken(struct UDamageType* DamageType); // Function Killstreak.KSBuild.OnRadialDamageTaken
	void OnPointDamageTaken(struct UDamageType* DamageType, struct UPrimitiveComponent* PrimitiveComponent, struct FName HitBone); // Function Killstreak.KSBuild.OnPointDamageTaken
	void OnKilled(); // Function Killstreak.KSBuild.OnKilled
	void OnHealthChanged(); // Function Killstreak.KSBuild.OnHealthChanged
	void OnBuildComponentDestroyed(struct UPrimitiveComponent* PrimitiveComponent); // Function Killstreak.KSBuild.OnBuildComponentDestroyed
	void KillDestructionTimerComplete(); // Function Killstreak.KSBuild.KillDestructionTimerComplete
	float GetRealActorTakeoverDelay(); // Function Killstreak.KSBuild.GetRealActorTakeoverDelay
	struct AKSPlayerState* GetPlayerStateOwner(); // Function Killstreak.KSBuild.GetPlayerStateOwner
	void GetOutlineableMeshes(struct TArray<struct UPrimitiveComponent*> OutMeshes); // Function Killstreak.KSBuild.GetOutlineableMeshes
	struct AKSCharacter* GetCharacterOwner(); // Function Killstreak.KSBuild.GetCharacterOwner
	struct UKSWeaponAsset_Build* GetBuildWeaponAsset(); // Function Killstreak.KSBuild.GetBuildWeaponAsset
	void DestroyBuildComponent(struct UPrimitiveComponent* PrimitiveComponent); // Function Killstreak.KSBuild.DestroyBuildComponent
	float ComponentTakeDamage(struct UPrimitiveComponent* PrimitiveComponent, float DamageAmount); // Function Killstreak.KSBuild.ComponentTakeDamage
	void BroadcastSelfDestructStart(); // Function Killstreak.KSBuild.BroadcastSelfDestructStart
	void BroadcastSelfDestruct(); // Function Killstreak.KSBuild.BroadcastSelfDestruct
	void BroadcastDestroyBuildComponent(struct UPrimitiveComponent* PrimitiveComponent); // Function Killstreak.KSBuild.BroadcastDestroyBuildComponent
};

// Class Killstreak.KSBuild_APS
// Size: 0x388 (Inherited: 0x350)
struct AKSBuild_APS : public AKSBuild {
	char UnknownData_350[0x8]; // 0x350(0x08)
	struct USphereComponent* DetectionSphere; // 0x358(0x08)
	float DetectionSphereRadius; // 0x360(0x04)
	int32_t MaxProjectilesDestroyed; // 0x364(0x04)
	float TimeToActivate; // 0x368(0x04)
	char UnknownData_36C[0x4]; // 0x36c(0x04)
	struct TArray<struct AKSProjectile*> MarkedProjectiles; // 0x370(0x10)
	char UnknownData_380[0x4]; // 0x380(0x04)
	bool bIsActive; // 0x384(0x01)
	char UnknownData_385[0x3]; // 0x385(0x03)

	void OnRep_Active(); // Function Killstreak.KSBuild_APS.OnRep_Active
	void OnProjectileIntercepted(struct FVector InterceptedProjectileLocation); // Function Killstreak.KSBuild_APS.OnProjectileIntercepted
	void OnMarkedProjectileDestroyed(struct AActor* InActor); // Function Killstreak.KSBuild_APS.OnMarkedProjectileDestroyed
	void OnDeactivated(); // Function Killstreak.KSBuild_APS.OnDeactivated
	void OnActorOverlapBegin(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Killstreak.KSBuild_APS.OnActorOverlapBegin
	void OnActivated(); // Function Killstreak.KSBuild_APS.OnActivated
	void BroadcastProjectileIntercept(struct AKSProjectile* DestroyedProjectile, struct FVector BackupLocation); // Function Killstreak.KSBuild_APS.BroadcastProjectileIntercept
};

// Class Killstreak.KSBuildPreview
// Size: 0x238 (Inherited: 0x220)
struct AKSBuildPreview : public AActor {
	struct UMaterialInterface* ValidBuildMaterial; // 0x220(0x08)
	struct UMaterialInterface* InvalidBuildMaterial; // 0x228(0x08)
	struct UBoxComponent* Box; // 0x230(0x08)
};

// Class Killstreak.KSCash
// Size: 0x188 (Inherited: 0x168)
struct UKSCash : public UKSItem {
	int32_t Amount; // 0x168(0x04)
	char UnknownData_16C[0x4]; // 0x16c(0x04)
	struct FText CashReasonText; // 0x170(0x18)
};

// Class Killstreak.KSCashDrop
// Size: 0x368 (Inherited: 0x360)
struct AKSCashDrop : public AKSItemDrop {
	int32_t Amount; // 0x360(0x04)
	char UnknownData_364[0x4]; // 0x364(0x04)
};

// Class Killstreak.KSCashExtractionPoint
// Size: 0x4c0 (Inherited: 0x380)
struct AKSCashExtractionPoint : public AKSObjectiveBase {
	char UnknownData_380[0x8]; // 0x380(0x08)
	int32_t ContainedCash; // 0x388(0x04)
	char UnknownData_38C[0x4]; // 0x38c(0x04)
	struct FPGame_ReplicatedTimer ReplicatedStateTimer; // 0x390(0x38)
	char UnknownData_3C8[0x10]; // 0x3c8(0x10)
	float UpdateReplicatedTimerPeriod; // 0x3d8(0x04)
	float PreparingStateDuration; // 0x3dc(0x04)
	float DepositingStateDuration; // 0x3e0(0x04)
	float ExtractedStateDuration; // 0x3e4(0x04)
	float CooldownStateDuration; // 0x3e8(0x04)
	char UnknownData_3EC[0x4]; // 0x3ec(0x04)
	struct FText CallInInteractionPrompt; // 0x3f0(0x18)
	struct FText CallInInteractionProgressText; // 0x408(0x18)
	struct FText DepositInteractionPrompt; // 0x420(0x18)
	struct FText DepositInteractionProgressText; // 0x438(0x18)
	struct FText CancelInteractionPrompt; // 0x450(0x18)
	struct FText CancelInteractionProgressText; // 0x468(0x18)
	struct USphereComponent* InteractionRangeSphereComponent; // 0x480(0x08)
	float CallInInteractDuration; // 0x488(0x04)
	float DepositInteractDuration; // 0x48c(0x04)
	float CancelInteractDuration; // 0x490(0x04)
	char UnknownData_494[0x4]; // 0x494(0x04)
	struct TArray<struct AKSCharacter*> Interactors; // 0x498(0x10)
	struct UKSInteractionBlockerManager* InteractionBlockerManager; // 0x4a8(0x08)
	char UnknownData_4B0[0x10]; // 0x4b0(0x10)

	void StateTimerExpired(); // Function Killstreak.KSCashExtractionPoint.StateTimerExpired
	bool ShouldShowLabel(); // Function Killstreak.KSCashExtractionPoint.ShouldShowLabel
	void OnRep_ContainedCash(); // Function Killstreak.KSCashExtractionPoint.OnRep_ContainedCash
	void HideCashPoint(); // Function Killstreak.KSCashExtractionPoint.HideCashPoint
	void GetRemainingTimeInState(float RemainingTime, float TotalDuration); // Function Killstreak.KSCashExtractionPoint.GetRemainingTimeInState
	void ActivateCashPoint(); // Function Killstreak.KSCashExtractionPoint.ActivateCashPoint
};

// Class Killstreak.KSCharacterBase
// Size: 0xba0 (Inherited: 0x4c0)
struct AKSCharacterBase : public ACharacter {
	char UnknownData_4C0[0x18]; // 0x4c0(0x18)
	struct FMulticastInlineDelegate OnTakeArmorDamage; // 0x4d8(0x10)
	char UnknownData_4E8[0x18]; // 0x4e8(0x18)
	struct FMulticastInlineDelegate OnHealthChangedDel; // 0x500(0x10)
	char UnknownData_510[0x18]; // 0x510(0x18)
	float HealthRegenerationPerSecond; // 0x528(0x04)
	float HealthRegenerationPeriod; // 0x52c(0x04)
	float HealthRegenerationDelay; // 0x530(0x04)
	char UnknownData_534[0x4]; // 0x534(0x04)
	struct FMulticastInlineDelegate OnHealthRegenDelayTimerActive; // 0x538(0x10)
	struct FMulticastInlineDelegate OnHealthRegenDelayTimerTick; // 0x548(0x10)
	struct FMulticastInlineDelegate OnHealthRegenDelayTimerComplete; // 0x558(0x10)
	struct UKSTimerComponent* HealthRegenDelayTimer; // 0x568(0x08)
	char UnknownData_570[0x8]; // 0x570(0x08)
	float CurrentOverheal; // 0x578(0x04)
	float OverhealDecayPerSecond; // 0x57c(0x04)
	float OverhealDecayPeriod; // 0x580(0x04)
	char UnknownData_584[0x24]; // 0x584(0x24)
	struct FMulticastInlineDelegate OnOverhealChanged; // 0x5a8(0x10)
	float QueuedMovementForgivenessPeriod; // 0x5b8(0x04)
	float QueuedMovementForgivenessEndTime; // 0x5bc(0x04)
	enum class EKSQueuedMovement CurrentQueuedMovement; // 0x5c0(0x01)
	char UnknownData_5C1[0x3]; // 0x5c1(0x03)
	struct FName FreeFallCollisionProfileName; // 0x5c4(0x08)
	char UnknownData_5CC[0x14]; // 0x5cc(0x14)
	struct UCameraShake* CurrentFreeFallCameraShake; // 0x5e0(0x08)
	struct UKSVelocityCameraShake* FreeFallCameraShake; // 0x5e8(0x08)
	struct FMulticastInlineDelegate OnEndFreeFallDel; // 0x5f0(0x10)
	bool bRealWantsCrouch; // 0x600(0x01)
	char UnknownData_601[0x7]; // 0x601(0x07)
	struct FMulticastInlineDelegate OnSprintChanged; // 0x608(0x10)
	bool bReplicatedSprinting; // 0x618(0x01)
	char UnknownData_619[0x3]; // 0x619(0x03)
	struct FVector_NetQuantizeNormal ReplicatedAccelDirection; // 0x61c(0x0c)
	struct FMulticastInlineDelegate OnPowerSlideChanged; // 0x628(0x10)
	struct FKSPowerSlideInfo bReplicatedPowerSlide; // 0x638(0x02)
	char UnknownData_63A[0x2]; // 0x63a(0x02)
	float DodgeRollDuration; // 0x63c(0x04)
	bool bReplicatedDodgeRoll; // 0x640(0x01)
	char UnknownData_641[0x7]; // 0x641(0x07)
	struct FMulticastInlineDelegate OnDOdgeRollChanged; // 0x648(0x10)
	char UnknownData_658[0x30]; // 0x658(0x30)
	struct FKSLungeInfo LungeInfo; // 0x688(0x10)
	struct FMulticastInlineDelegate OnLungeChanged; // 0x698(0x10)
	bool bReplicatedAbilityMovement; // 0x6a8(0x01)
	bool bReplicatedZipLineBracing; // 0x6a9(0x01)
	bool bReplicatedZipLineEnding; // 0x6aa(0x01)
	bool bReplicatedUpline; // 0x6ab(0x01)
	float SecondsAwayToBraceOnZipLine; // 0x6ac(0x04)
	float SecondsAwayToEndOnZipLine; // 0x6b0(0x04)
	char UnknownData_6B4[0x4]; // 0x6b4(0x04)
	struct FKSZipLineInfo ReplicatedZipLineInfo; // 0x6b8(0x10)
	bool bPrevPressedJump; // 0x6c8(0x01)
	char UnknownData_6C9[0x7]; // 0x6c9(0x07)
	struct FMulticastInlineDelegate OnJumpedDel; // 0x6d0(0x10)
	struct FMulticastInlineDelegate OnLandedDel; // 0x6e0(0x10)
	struct FMulticastInlineDelegate OnStartFallingDel; // 0x6f0(0x10)
	char UnknownData_700[0x16]; // 0x700(0x16)
	bool bReplicatedStun; // 0x716(0x01)
	char UnknownData_717[0x21]; // 0x717(0x21)
	bool bReplicatedHardLand; // 0x738(0x01)
	char UnknownData_739[0x37]; // 0x739(0x37)
	struct UCameraShake* CurrentSprintCameraShake; // 0x770(0x08)
	struct UKSSprintCameraShake* SprintCameraShake; // 0x778(0x08)
	struct UCameraShake* CurrentLandedCameraShake; // 0x780(0x08)
	struct UKSCharacterCameraShake* LandedCameraShake; // 0x788(0x08)
	struct FMulticastInlineDelegate OnAimStateChanged; // 0x790(0x10)
	struct USceneComponent* GrenadeThrowComponent; // 0x7a0(0x08)
	struct USceneComponent* MeleeThrowComponent; // 0x7a8(0x08)
	enum class EKSCharacterAimMode ReplicatedAimState; // 0x7b0(0x01)
	enum class EKSCharacterAimMode LastReplicatedAimState; // 0x7b1(0x01)
	bool bEnableSmoothedAimRotation; // 0x7b2(0x01)
	char UnknownData_7B3[0x1]; // 0x7b3(0x01)
	struct FReplicatedViewInfo ViewInfo; // 0x7b4(0x08)
	bool bUseCameraLagSubstepping; // 0x7bc(0x01)
	char UnknownData_7BD[0x3]; // 0x7bd(0x03)
	float CameraLagMaxTimeStep; // 0x7c0(0x04)
	float CameraRotationLagSpeed; // 0x7c4(0x04)
	struct FRotator PreviousDesiredRot; // 0x7c8(0x0c)
	struct FRotator SmoothedViewRotation; // 0x7d4(0x0c)
	bool bIsSmoothingAimRotation; // 0x7e0(0x01)
	char UnknownData_7E1[0x7]; // 0x7e1(0x07)
	struct FMulticastInlineDelegate OnKilled; // 0x7e8(0x10)
	struct FKSDeathInfo DeathInfo; // 0x7f8(0x28)
	struct UKSDamageTypeBase* InstantDeathDamageType; // 0x820(0x08)
	bool bRadialMiss; // 0x828(0x01)
	char UnknownData_829[0x7]; // 0x829(0x07)
	struct AKSCharacterBase* LastCharacterToDamageMe; // 0x830(0x08)
	char UnknownData_838[0x18]; // 0x838(0x18)
	struct FMulticastInlineDelegate OnDeathStateChangedDel; // 0x850(0x10)
	char UnknownData_860[0x38]; // 0x860(0x38)
	struct USphereComponent* HeadCollisionComponent; // 0x898(0x08)
	struct USkeletalMeshComponent* ZiplineMeshComponent; // 0x8a0(0x08)
	struct USkeletalMeshComponent* UplineMeshComponent; // 0x8a8(0x08)
	struct APlayerState* BackupPlayerState; // 0x8b0(0x08)
	char UnknownData_8B8[0x10]; // 0x8b8(0x10)
	struct FMulticastInlineDelegate OnPlayerStateChangedDel; // 0x8c8(0x10)
	char UnknownData_8D8[0x18]; // 0x8d8(0x18)
	struct TArray<struct FName> HeadBones; // 0x8f0(0x10)
	struct TArray<struct FName> LimbBones; // 0x900(0x10)
	struct TMap<struct FName, enum class EHitLocationType> CachedBoneToHitLocationType; // 0x910(0x50)
	struct TArray<struct FName> HeadshotPassthroughBones; // 0x960(0x10)
	float OutlineZFadeMin; // 0x970(0x04)
	float OutlineZFadeMax; // 0x974(0x04)
	struct FLinearColor RevealedOutlineColorFriendly; // 0x978(0x10)
	struct FLinearColor RevealedOutlineColorEnemy; // 0x988(0x10)
	struct FLinearColor SpawnImmuneOutlineColorEnemy; // 0x998(0x10)
	float FriendlyOutlineFadeDistanceMin; // 0x9a8(0x04)
	float FriendlyOutlineFadeDistanceMax; // 0x9ac(0x04)
	bool bReevaluateSilhouetteNextTick; // 0x9b0(0x01)
	bool bForceSilhouette; // 0x9b1(0x01)
	enum class EPlayerSilhouetteType ForcedSilhouetteType; // 0x9b2(0x01)
	bool bForcedFillSilhouette; // 0x9b3(0x01)
	bool bForcedMarkSilhouette; // 0x9b4(0x01)
	enum class EPlayerSilhouetteType SilhouetteType; // 0x9b5(0x01)
	bool bFillSilhouette; // 0x9b6(0x01)
	bool bMarkSilhouette; // 0x9b7(0x01)
	char UnknownData_9B8[0x10]; // 0x9b8(0x10)
	bool bSilhouetteComponentsDirty; // 0x9c8(0x01)
	char UnknownData_9C9[0x7]; // 0x9c9(0x07)
	struct TArray<struct UPrimitiveComponent*> CachedSilhouetteComponents; // 0x9d0(0x10)
	struct FMulticastInlineDelegate OnRevealChanged; // 0x9e0(0x10)
	struct FKSMantleInfo ReplicatedMantleInfo; // 0x9f0(0x44)
	char UnknownData_A34[0x4]; // 0xa34(0x04)
	struct FMulticastInlineDelegate OnMantleChanged; // 0xa38(0x10)
	char UnknownData_A48[0x18]; // 0xa48(0x18)
	bool CachedAimAssistVisibility; // 0xa60(0x01)
	char UnknownData_A61[0x3]; // 0xa61(0x03)
	float NextValidAimAssistVisibiltyTime; // 0xa64(0x04)
	bool bCanEverBeConsideredForAimAssist; // 0xa68(0x01)
	char UnknownData_A69[0x3]; // 0xa69(0x03)
	struct FName InteractionState; // 0xa6c(0x08)
	float InteractionHeight; // 0xa74(0x04)
	float InteractionTime; // 0xa78(0x04)
	char UnknownData_A7C[0x34]; // 0xa7c(0x34)
	struct FMulticastInlineDelegate OnSwimmingChangedDel; // 0xab0(0x10)
	struct FMulticastInlineDelegate OnSubmergedChangedDel; // 0xac0(0x10)
	struct FMulticastInlineDelegate OnBreathUpdate; // 0xad0(0x10)
	bool bIsSubmerged; // 0xae0(0x01)
	char UnknownData_AE1[0x3]; // 0xae1(0x03)
	float MaximumLungCapacity; // 0xae4(0x04)
	float CurrentLungCapacity; // 0xae8(0x04)
	float LungCapacityRecoveryTime; // 0xaec(0x04)
	bool bDestroyOnRoundSetup; // 0xaf0(0x01)
	char RoundCreated; // 0xaf1(0x01)
	char UnknownData_AF2[0x1e]; // 0xaf2(0x1e)
	bool bIgnoreCollisionWithTeammates; // 0xb10(0x01)
	char UnknownData_B11[0x7]; // 0xb11(0x07)
	struct TMap<struct FName, struct FKSCharacterSocketInfo> CharacterSockets; // 0xb18(0x50)
	struct AKSCharacterBase* TeammateToNudge; // 0xb68(0x08)
	struct FMulticastInlineDelegate OnEmoteStartedPlaying; // 0xb70(0x10)
	struct FMulticastInlineDelegate OnEmoteStoppedPlaying; // 0xb80(0x10)
	bool bIsSpawnImmune; // 0xb90(0x01)
	char UnknownData_B91[0xf]; // 0xb91(0x0f)

	void UpdateDebugHealthVisibility(); // Function Killstreak.KSCharacterBase.UpdateDebugHealthVisibility
	void UnSubmerge(bool bClientSimulation); // Function Killstreak.KSCharacterBase.UnSubmerge
	void Submerge(bool bClientSimulation); // Function Killstreak.KSCharacterBase.Submerge
	void StopSprint(bool bInterrupted); // Function Killstreak.KSCharacterBase.StopSprint
	void StopRegenerationTimers(); // Function Killstreak.KSCharacterBase.StopRegenerationTimers
	void StartSprint(); // Function Killstreak.KSCharacterBase.StartSprint
	struct UCameraShake* StartCameraShake(struct UCameraShake* ShakeClass); // Function Killstreak.KSCharacterBase.StartCameraShake
	void ShowDebugLocation(bool bVisible); // Function Killstreak.KSCharacterBase.ShowDebugLocation
	void SetRevealed(bool Reveal); // Function Killstreak.KSCharacterBase.SetRevealed
	void SetHealth(float NewHealth); // Function Killstreak.KSCharacterBase.SetHealth
	void RevealToWholeTeam(float Duration, struct AController* Revealer, float Delay, enum class EPlayerSilhouetteType Type, bool Fill, bool Mark); // Function Killstreak.KSCharacterBase.RevealToWholeTeam
	void RevealForDuration(float RevealTime); // Function Killstreak.KSCharacterBase.RevealForDuration
	struct FRevealInfo Reveal(float Duration, struct AController* Revealer, enum class EPlayerSilhouetteType Type, bool Fill, bool Mark); // Function Killstreak.KSCharacterBase.Reveal
	void ResetHealthRegeneration(); // Function Killstreak.KSCharacterBase.ResetHealthRegeneration
	void ResetHealthRegenDelay(); // Function Killstreak.KSCharacterBase.ResetHealthRegenDelay
	void ResetFreeFallState(); // Function Killstreak.KSCharacterBase.ResetFreeFallState
	void RemoveCameraShake(struct UCameraShake* CameraShake); // Function Killstreak.KSCharacterBase.RemoveCameraShake
	void OverhealDecayTick(); // Function Killstreak.KSCharacterBase.OverhealDecayTick
	float Overheal(float OverhealValue, struct AController* HealInstigator, struct AActor* HealCauser); // Function Killstreak.KSCharacterBase.Overheal
	void OnTeamUpdated(); // Function Killstreak.KSCharacterBase.OnTeamUpdated
	void OnStopDefaultAim(); // Function Killstreak.KSCharacterBase.OnStopDefaultAim
	void OnStopAimOverShoulder(); // Function Killstreak.KSCharacterBase.OnStopAimOverShoulder
	void OnStopAimDownSights(); // Function Killstreak.KSCharacterBase.OnStopAimDownSights
	void OnStopAimAlternate(); // Function Killstreak.KSCharacterBase.OnStopAimAlternate
	void OnStartDefaultAim(); // Function Killstreak.KSCharacterBase.OnStartDefaultAim
	void OnStartAimOverShoulder(); // Function Killstreak.KSCharacterBase.OnStartAimOverShoulder
	void OnStartAimDownSights(); // Function Killstreak.KSCharacterBase.OnStartAimDownSights
	void OnStartAimAlternate(); // Function Killstreak.KSCharacterBase.OnStartAimAlternate
	void OnRep_Sprint(); // Function Killstreak.KSCharacterBase.OnRep_Sprint
	void OnRep_Silhouette(); // Function Killstreak.KSCharacterBase.OnRep_Silhouette
	void OnRep_ReplicatedStun(); // Function Killstreak.KSCharacterBase.OnRep_ReplicatedStun
	void OnRep_ReplicatedAimState(); // Function Killstreak.KSCharacterBase.OnRep_ReplicatedAimState
	void OnRep_ReplicatedAbilityMovement(); // Function Killstreak.KSCharacterBase.OnRep_ReplicatedAbilityMovement
	void OnRep_PowerSlide(); // Function Killstreak.KSCharacterBase.OnRep_PowerSlide
	void OnRep_MantleInfo(); // Function Killstreak.KSCharacterBase.OnRep_MantleInfo
	void OnRep_LungeInfo(); // Function Killstreak.KSCharacterBase.OnRep_LungeInfo
	void OnRep_IsSubmerged(); // Function Killstreak.KSCharacterBase.OnRep_IsSubmerged
	void OnRep_DeathState(); // Function Killstreak.KSCharacterBase.OnRep_DeathState
	void OnRep_CurrentOverheal(); // Function Killstreak.KSCharacterBase.OnRep_CurrentOverheal
	void OnRep_CurrentLungCapacity(); // Function Killstreak.KSCharacterBase.OnRep_CurrentLungCapacity
	void OnRep_BackupPlayerState(); // Function Killstreak.KSCharacterBase.OnRep_BackupPlayerState
	void OnLeaveTeam(struct AKSTeamState* OldTeam); // Function Killstreak.KSCharacterBase.OnLeaveTeam
	void OnJoinTeam(struct AKSTeamState* NewTeam); // Function Killstreak.KSCharacterBase.OnJoinTeam
	void OnEndPowerSlide(enum class EKSPowerSlideEndReason EndReason); // Function Killstreak.KSCharacterBase.OnEndPowerSlide
	void OnBeginPowerSlide(); // Function Killstreak.KSCharacterBase.OnBeginPowerSlide
	void LockoutMovement(float Time); // Function Killstreak.KSCharacterBase.LockoutMovement
	bool IsUnderwater(); // Function Killstreak.KSCharacterBase.IsUnderwater
	bool IsThermalDetectable(); // Function Killstreak.KSCharacterBase.IsThermalDetectable
	bool IsStunned(); // Function Killstreak.KSCharacterBase.IsStunned
	bool IsSprinting(); // Function Killstreak.KSCharacterBase.IsSprinting
	bool IsRevealPermanent(); // Function Killstreak.KSCharacterBase.IsRevealPermanent
	bool IsRevealedToLocalPlayer(); // Function Killstreak.KSCharacterBase.IsRevealedToLocalPlayer
	bool IsRevealed(); // Function Killstreak.KSCharacterBase.IsRevealed
	bool IsPlayingEmote(); // Function Killstreak.KSCharacterBase.IsPlayingEmote
	bool IsLunging(); // Function Killstreak.KSCharacterBase.IsLunging
	bool IsLocallyViewed(); // Function Killstreak.KSCharacterBase.IsLocallyViewed
	bool IsLaunched(); // Function Killstreak.KSCharacterBase.IsLaunched
	bool IsInPowerSlide(); // Function Killstreak.KSCharacterBase.IsInPowerSlide
	bool IsInHardLandLockout(); // Function Killstreak.KSCharacterBase.IsInHardLandLockout
	bool IsInAimTransition(); // Function Killstreak.KSCharacterBase.IsInAimTransition
	bool IsDeadOrDestroyed(); // Function Killstreak.KSCharacterBase.IsDeadOrDestroyed
	bool IsBot(); // Function Killstreak.KSCharacterBase.IsBot
	bool IsAimingOverShoulder(); // Function Killstreak.KSCharacterBase.IsAimingOverShoulder
	bool IsAimingDownSights(); // Function Killstreak.KSCharacterBase.IsAimingDownSights
	bool IsAimingAlternate(); // Function Killstreak.KSCharacterBase.IsAimingAlternate
	bool IsAiming(); // Function Killstreak.KSCharacterBase.IsAiming
	bool IsAbilityMoving(); // Function Killstreak.KSCharacterBase.IsAbilityMoving
	void HealthRegenerationTick(); // Function Killstreak.KSCharacterBase.HealthRegenerationTick
	void HealthRegenerationStopped(bool bFullyHealed); // Function Killstreak.KSCharacterBase.HealthRegenerationStopped
	void HealthRegenerationStarted(); // Function Killstreak.KSCharacterBase.HealthRegenerationStarted
	void HealthRegenDelayTimerTick(float Seconds); // Function Killstreak.KSCharacterBase.HealthRegenDelayTimerTick
	void HealthRegenDelayTimerComplete(); // Function Killstreak.KSCharacterBase.HealthRegenDelayTimerComplete
	void HealthRegenDelayTimerActive(bool bActive); // Function Killstreak.KSCharacterBase.HealthRegenDelayTimerActive
	float Heal(float HealAmount, struct AController* HealInstigator, struct AActor* HealCauser); // Function Killstreak.KSCharacterBase.Heal
	bool HasCharacterSocket(struct FName InSocketName); // Function Killstreak.KSCharacterBase.HasCharacterSocket
	float GetZiplineAdjustHeight(); // Function Killstreak.KSCharacterBase.GetZiplineAdjustHeight
	struct AActor* GetStartSpot(); // Function Killstreak.KSCharacterBase.GetStartSpot
	enum class EKSCharacterAimMode GetReplicatedAimState(); // Function Killstreak.KSCharacterBase.GetReplicatedAimState
	float GetPowerSlideProgress(); // Function Killstreak.KSCharacterBase.GetPowerSlideProgress
	float GetPowerSlideAngle(); // Function Killstreak.KSCharacterBase.GetPowerSlideAngle
	struct FTransform GetMeleeThrowTransform(); // Function Killstreak.KSCharacterBase.GetMeleeThrowTransform
	struct FVector GetMeleeThrowLocation(); // Function Killstreak.KSCharacterBase.GetMeleeThrowLocation
	float GetMaximumLungCapacity(); // Function Killstreak.KSCharacterBase.GetMaximumLungCapacity
	float GetMaxHealth(); // Function Killstreak.KSCharacterBase.GetMaxHealth
	float GetLungRecoveryTime(); // Function Killstreak.KSCharacterBase.GetLungRecoveryTime
	enum class EKSCharacterAimMode GetLastReplicatedAimState(); // Function Killstreak.KSCharacterBase.GetLastReplicatedAimState
	struct AKSPlayerState* GetKSPlayerState(); // Function Killstreak.KSCharacterBase.GetKSPlayerState
	struct UKSCharacterMovementComponent* GetKSMovementComponent(); // Function Killstreak.KSCharacterBase.GetKSMovementComponent
	struct UKSCharacterAnimInst* GetKSCharacterAnimInst(); // Function Killstreak.KSCharacterBase.GetKSCharacterAnimInst
	struct AKSCharacter* GetKSCharacter(); // Function Killstreak.KSCharacterBase.GetKSCharacter
	struct AKSPlayerState* GetKSBestPlayerState(); // Function Killstreak.KSCharacterBase.GetKSBestPlayerState
	struct UKSAnimInstance* GetKSAnimInstance(); // Function Killstreak.KSCharacterBase.GetKSAnimInstance
	struct FName GetInteractionState(); // Function Killstreak.KSCharacterBase.GetInteractionState
	bool GetImmediateDeathRagdoll(); // Function Killstreak.KSCharacterBase.GetImmediateDeathRagdoll
	float GetHealthRegenDelayTime(); // Function Killstreak.KSCharacterBase.GetHealthRegenDelayTime
	float GetHealthPct(); // Function Killstreak.KSCharacterBase.GetHealthPct
	float GetHealth(); // Function Killstreak.KSCharacterBase.GetHealth
	struct FTransform GetGrenadeThrowTransform(); // Function Killstreak.KSCharacterBase.GetGrenadeThrowTransform
	struct FVector GetGrenadeThrowLocation(); // Function Killstreak.KSCharacterBase.GetGrenadeThrowLocation
	enum class EKSDeathState GetDeathState(); // Function Killstreak.KSCharacterBase.GetDeathState
	float GetCurrentOverheal(); // Function Killstreak.KSCharacterBase.GetCurrentOverheal
	float GetCurrentLungCapacity(); // Function Killstreak.KSCharacterBase.GetCurrentLungCapacity
	struct FVector GetCurrentDesiredMovementDirection(); // Function Killstreak.KSCharacterBase.GetCurrentDesiredMovementDirection
	enum class EKSCharacterAimMode GetCurrentAimState(); // Function Killstreak.KSCharacterBase.GetCurrentAimState
	struct FVector GetCurrentAccelDirection(); // Function Killstreak.KSCharacterBase.GetCurrentAccelDirection
	struct FTransform GetCharacterSocketTransform(struct FName InSocketName); // Function Killstreak.KSCharacterBase.GetCharacterSocketTransform
	struct FRotator GetCharacterSocketRotator(struct FName InSocketName); // Function Killstreak.KSCharacterBase.GetCharacterSocketRotator
	struct FVector GetCharacterSocketLocation(struct FName InSocketName); // Function Killstreak.KSCharacterBase.GetCharacterSocketLocation
	struct APlayerState* GetBestPlayerState(); // Function Killstreak.KSCharacterBase.GetBestPlayerState
	struct APlayerState* GetBackupPlayerState(); // Function Killstreak.KSCharacterBase.GetBackupPlayerState
	void ForceStartHealthRegeneration(); // Function Killstreak.KSCharacterBase.ForceStartHealthRegeneration
	void ForceSilhouette(bool bInForceSilhouette, enum class EPlayerSilhouetteType InSilhouetteType, bool InFillSilhouette, bool InMarkSilhouette); // Function Killstreak.KSCharacterBase.ForceSilhouette
	void EndAbilityMovement(); // Function Killstreak.KSCharacterBase.EndAbilityMovement
	void DoStun(float StunDuration, bool FreezeInPlace); // Function Killstreak.KSCharacterBase.DoStun
	void DoHardLandAvoid(); // Function Killstreak.KSCharacterBase.DoHardLandAvoid
	void DoHardLand(float LockoutDuration); // Function Killstreak.KSCharacterBase.DoHardLand
	bool CanViewDebugHealth(); // Function Killstreak.KSCharacterBase.CanViewDebugHealth
	void BroadcastInstantInteraction(struct FName InInteractionState, float InInteractionHeight); // Function Killstreak.KSCharacterBase.BroadcastInstantInteraction
	void BroadcastHealthRegenerationStopped(bool bFullyHealed); // Function Killstreak.KSCharacterBase.BroadcastHealthRegenerationStopped
	void BroadcastHardLandAvoid(); // Function Killstreak.KSCharacterBase.BroadcastHardLandAvoid
	void BlueprintOnStopSwimming(); // Function Killstreak.KSCharacterBase.BlueprintOnStopSwimming
	void BlueprintOnStopSubmerged(); // Function Killstreak.KSCharacterBase.BlueprintOnStopSubmerged
	void BlueprintOnStartSwimming(); // Function Killstreak.KSCharacterBase.BlueprintOnStartSwimming
	void BlueprintOnStartSubmerged(); // Function Killstreak.KSCharacterBase.BlueprintOnStartSubmerged
	void BeginDodgeRoll(); // Function Killstreak.KSCharacterBase.BeginDodgeRoll
	void BeginAbilityMovement(); // Function Killstreak.KSCharacterBase.BeginAbilityMovement
	bool AllowSprintingRightNow(); // Function Killstreak.KSCharacterBase.AllowSprintingRightNow
	bool AllowPowerSlideRightNow(); // Function Killstreak.KSCharacterBase.AllowPowerSlideRightNow
};

// Class Killstreak.KSCharacter
// Size: 0x33d0 (Inherited: 0xba0)
struct AKSCharacter : public AKSCharacterBase {
	char UnknownData_BA0[0x31]; // 0xba0(0x31)
	bool bTapRadialButtonToUseLastSelectedItem; // 0xbd1(0x01)
	char UnknownData_BD2[0xd6]; // 0xbd2(0xd6)
	struct TArray<struct FName> ReleasedInputsOnOpenUI; // 0xca8(0x10)
	struct TArray<struct FName> ExcludedReleasedInputsOnOpenRadialMenu; // 0xcb8(0x10)
	struct TArray<struct FName> ExcludedReleasedInputsOnOpenEscapeMenu; // 0xcc8(0x10)
	struct TArray<struct FName> ExcludedReleasedInputsOnOpenScoreboard; // 0xcd8(0x10)
	struct TArray<struct FName> ExcludedReleasedInputsOnOpenMap; // 0xce8(0x10)
	struct TArray<struct FName> ReleasedInputsOnCloseRadialMenu; // 0xcf8(0x10)
	struct FMulticastInlineDelegate OnPossessedBy; // 0xd08(0x10)
	struct FMulticastInlineDelegate OnUnpossessed; // 0xd18(0x10)
	struct AKSPlayerController* CachedKSPlayerController; // 0xd28(0x08)
	struct UKSInteractionBlockerManager* InteractionBlockerManager; // 0xd30(0x08)
	struct UKSInteractionType* InteractionType; // 0xd38(0x08)
	struct UKSAutoPickupComponent* AutoPickupComponent; // 0xd40(0x08)
	bool bProcessingReverseFriendlyFireDamageEvent; // 0xd48(0x01)
	char UnknownData_D49[0x1f]; // 0xd49(0x1f)
	struct UKSOutOfBoundsManager* OutOfBoundsManager; // 0xd68(0x08)
	float MinimumFlinchHeight; // 0xd70(0x04)
	float MinimumFlinchDamage; // 0xd74(0x04)
	float MaximumFlinchHeight; // 0xd78(0x04)
	float MaximumFlinchDamage; // 0xd7c(0x04)
	float FlinchDuration; // 0xd80(0x04)
	float FlinchRecoveryRate; // 0xd84(0x04)
	bool bFlinchSnipersOnly; // 0xd88(0x01)
	char UnknownData_D89[0x7]; // 0xd89(0x07)
	struct TMap<struct AKSPlayerState*, float> DamageRecord; // 0xd90(0x50)
	float DamageRecordResetTime; // 0xde0(0x04)
	char UnknownData_DE4[0x4]; // 0xde4(0x04)
	struct FTimerHandle DamageRecordResetTimer; // 0xde8(0x08)
	struct FKSShotgunHitChangeList ReplicatedShotgunHits; // 0xdf0(0x88)
	struct FMulticastInlineDelegate OnNewShotgunHit; // 0xe78(0x10)
	char UnknownData_E88[0x50]; // 0xe88(0x50)
	struct FMulticastInlineDelegate OnPlayHitFromPointDamageDel; // 0xed8(0x10)
	struct FMulticastInlineDelegate OnPlayHitFromRadialDamageDel; // 0xee8(0x10)
	char UnknownData_EF8[0x50]; // 0xef8(0x50)
	float KillCamHitRecordTime; // 0xf48(0x04)
	char UnknownData_F4C[0x34]; // 0xf4c(0x34)
	struct FMulticastInlineDelegate OnLocalViewChanged; // 0xf80(0x10)
	struct TArray<struct FWeakObjectPtr<struct APlayerController>> LocalViewers; // 0xf90(0x10)
	struct FPostProcessSettings BlendableSettings; // 0xfa0(0x540)
	struct FMulticastInlineDelegate OnCanRemoveBackPackChanged; // 0x14e0(0x10)
	struct FMulticastInlineDelegate OnCharacterFreeFallStartedDel; // 0x14f0(0x10)
	struct FMulticastInlineDelegate OnCharacterFreeFallCompletedDel; // 0x1500(0x10)
	char UnknownData_1510[0x8]; // 0x1510(0x08)
	struct FText RemoveBackpackInteractionPromptText; // 0x1518(0x18)
	float SkyDiveMaxPitch; // 0x1530(0x04)
	float SkyDiveMinPitch; // 0x1534(0x04)
	float SkyDiveExitDistance; // 0x1538(0x04)
	float SkyDiveExitThreshold; // 0x153c(0x04)
	float SkyDiveForceExitDistance; // 0x1540(0x04)
	bool bPostSkyDiveDodgeRoll; // 0x1544(0x01)
	bool bLeftHandMantleIK; // 0x1545(0x01)
	bool bRightHandMantleIK; // 0x1546(0x01)
	char UnknownData_1547[0x1]; // 0x1547(0x01)
	struct FVector LeftHandMantleIKLocation; // 0x1548(0x0c)
	struct FVector RightHandMantleIKLocation; // 0x1554(0x0c)
	float LeftHandMantleIKAlpha; // 0x1560(0x04)
	float RightHandMantleIKAlpha; // 0x1564(0x04)
	bool bFadeOutLeftHandMantleIK; // 0x1568(0x01)
	bool bFadeOutRightHandMantleIK; // 0x1569(0x01)
	char UnknownData_156A[0x6]; // 0x156a(0x06)
	struct TArray<struct FSmoothedComponentInfo> SmoothedComponents; // 0x1570(0x10)
	struct TArray<struct UKSSmoothingComponent*> RegisteredSmoothingComponents; // 0x1580(0x10)
	char UnknownData_1590[0x98]; // 0x1590(0x98)
	struct UCurveFloat* SprintImpulseCurve; // 0x1628(0x08)
	float SprintPressLeeway; // 0x1630(0x04)
	float SprintLeewayExpire; // 0x1634(0x04)
	bool bFacingVaultWall; // 0x1638(0x01)
	bool bWantsToAutoSprint; // 0x1639(0x01)
	bool bAutoSprintTimerComplete; // 0x163a(0x01)
	char UnknownData_163B[0x1]; // 0x163b(0x01)
	float AutoSprintDelay; // 0x163c(0x04)
	char UnknownData_1640[0x8]; // 0x1640(0x08)
	float LeftHandMantleIKOffset; // 0x1648(0x04)
	float RightHandMantleIKOffset; // 0x164c(0x04)
	float HandMantleIKFadeTime; // 0x1650(0x04)
	float MantleIKHandsToWallForwardOffset; // 0x1654(0x04)
	float CrouchCameraShiftInterpSpeed; // 0x1658(0x04)
	float CrouchCameraBoomLengthScale; // 0x165c(0x04)
	float RiseFromCrouchDelayTime; // 0x1660(0x04)
	char UnknownData_1664[0x4]; // 0x1664(0x04)
	float CameraInterpSpeed; // 0x1668(0x04)
	bool bUsingEmoteCamera; // 0x166c(0x01)
	char UnknownData_166D[0x3]; // 0x166d(0x03)
	float CurrentEmoteCameraVertOffset; // 0x1670(0x04)
	float CurrentEmoteCameraInterpSpeed; // 0x1674(0x04)
	float StandEmoteCameraVertOffset; // 0x1678(0x04)
	float CrouchEmoteCameraVertOffset; // 0x167c(0x04)
	float ProneEmoteCameraVertOffset; // 0x1680(0x04)
	float StandEmoteCameraInterpSpeed; // 0x1684(0x04)
	float CrouchEmoteCameraInterpSpeed; // 0x1688(0x04)
	float ProneEmoteCameraInterpSpeed; // 0x168c(0x04)
	float SprintCameraChangeDuration; // 0x1690(0x04)
	float SprintOutCameraChangeDuration; // 0x1694(0x04)
	char UnknownData_1698[0x48]; // 0x1698(0x48)
	float GamepadInput; // 0x16e0(0x04)
	bool HasGamepadInput; // 0x16e4(0x01)
	bool bZiplineActive; // 0x16e5(0x01)
	char UnknownData_16E6[0x2]; // 0x16e6(0x02)
	float ZipLineShoulderCameraBoomLength; // 0x16e8(0x04)
	float ZipLineShoulderBoomLengthChangeTime; // 0x16ec(0x04)
	struct UKSModInst_Activated* AbilityMovementMod; // 0x16f0(0x08)
	float ZiplineMeshHeightAdjust; // 0x16f8(0x04)
	float SwimCameraBoomFloatHeight; // 0x16fc(0x04)
	float DrownDamagePeriod; // 0x1700(0x04)
	float DrownPerTickDamage; // 0x1704(0x04)
	struct UDamageType* DrownDamageType; // 0x1708(0x08)
	char UnknownData_1710[0x8]; // 0x1710(0x08)
	struct UPGame_PositionHistoryComponent* PositionHistoryComponent; // 0x1718(0x08)
	char UnknownData_1720[0x8]; // 0x1720(0x08)
	struct FMulticastInlineDelegate OnOutOfBoundsBeginDel; // 0x1728(0x10)
	struct FMulticastInlineDelegate OnOutOfBoundsWarningEndDel; // 0x1738(0x10)
	struct FMulticastInlineDelegate OnOutOfBoundsEndDel; // 0x1748(0x10)
	struct FKSOutOfBoundsInfo OutOfBoundsInfo; // 0x1758(0x08)
	bool bLocalOutOfBounds; // 0x1760(0x01)
	char UnknownData_1761[0x7]; // 0x1761(0x07)
	struct FPGame_ReplicatedTimer ReplicatedEMPLockoutTimer; // 0x1768(0x38)
	char UnknownData_17A0[0x18]; // 0x17a0(0x18)
	bool bIsEMPLocked; // 0x17b8(0x01)
	char UnknownData_17B9[0x7]; // 0x17b9(0x07)
	struct FMulticastInlineDelegate OnEMPLocked; // 0x17c0(0x10)
	struct FMulticastInlineDelegate OnEMPLockoutTick; // 0x17d0(0x10)
	char UnknownData_17E0[0x18]; // 0x17e0(0x18)
	bool bIsOnFire; // 0x17f8(0x01)
	char UnknownData_17F9[0x3]; // 0x17f9(0x03)
	float CachedPrimaryWeaponFieldOfView; // 0x17fc(0x04)
	struct UKSSmoothingComponent* CameraRootComponent; // 0x1800(0x08)
	struct UKSSpringArmComponent* MainCameraBoom; // 0x1808(0x08)
	struct UCameraComponent* MainCameraComponent; // 0x1810(0x08)
	struct UKSSpringArmComponent* SprintCameraBoom; // 0x1818(0x08)
	struct UCameraComponent* SprintCameraComponent; // 0x1820(0x08)
	struct UKSSpringArmComponent* TransitionCameraBoom; // 0x1828(0x08)
	struct UCameraComponent* TransitionCameraComponent; // 0x1830(0x08)
	struct UKSSpringArmComponent* ShoulderCameraBoom; // 0x1838(0x08)
	struct UCameraComponent* ShoulderCameraComponent; // 0x1840(0x08)
	struct UCameraComponent* FirstPersonCameraComponent; // 0x1848(0x08)
	struct UKSSpringArmComponent* TabletCameraBoom; // 0x1850(0x08)
	struct UCameraComponent* TabletCameraComponent; // 0x1858(0x08)
	struct UKSSpringArmComponent* ActionCameraBoom1; // 0x1860(0x08)
	struct UCameraComponent* ActionCameraComponent; // 0x1868(0x08)
	struct UKSSpringArmComponent* SwimCameraBoom; // 0x1870(0x08)
	struct UCameraComponent* SwimCameraComponent; // 0x1878(0x08)
	struct UCameraComponent* ActiveCameraComponent; // 0x1880(0x08)
	char UnknownData_1888[0x8]; // 0x1888(0x08)
	struct UCameraComponent* PendingCameraComponent; // 0x1890(0x08)
	char UnknownData_1898[0x8]; // 0x1898(0x08)
	enum class ECameraShoulder CameraShoulder; // 0x18a0(0x01)
	enum class ECameraShoulder DesiredCameraShoulder; // 0x18a1(0x01)
	char UnknownData_18A2[0x2]; // 0x18a2(0x02)
	float ShoulderSwapProgress; // 0x18a4(0x04)
	float ShoulderSwapTime; // 0x18a8(0x04)
	float ShoulderSwapCooldownTime; // 0x18ac(0x04)
	float ShoulderSwapBlendExponent; // 0x18b0(0x04)
	float NextShoulderSwapTime; // 0x18b4(0x04)
	char UnknownData_18B8[0x4]; // 0x18b8(0x04)
	float AimDownSightsScopeInterpSpeed; // 0x18bc(0x04)
	float CrouchAOSCamVertOffset; // 0x18c0(0x04)
	float CrouchAOSAimVertOffset; // 0x18c4(0x04)
	float CrouchAOSCamVertOffsetBlendTime; // 0x18c8(0x04)
	char UnknownData_18CC[0x34]; // 0x18cc(0x34)
	bool bFocalPointMaintenanceEnabled; // 0x1900(0x01)
	bool bMantainFocualPointOnCameraTransition; // 0x1901(0x01)
	char UnknownData_1902[0x2]; // 0x1902(0x02)
	float CameraFocualThreshold; // 0x1904(0x04)
	float MaximumFocalPointMaintenanceAngle; // 0x1908(0x04)
	float MaximumFocalPointMaintenanceAngleLeaveADS; // 0x190c(0x04)
	float MinimumFocalPointMaintenanceDistance; // 0x1910(0x04)
	struct FRotator CameraTransitionRotationDelta; // 0x1914(0x0c)
	struct FRotator CameraTransitionRotationDeltaRemaining; // 0x1920(0x0c)
	bool bUseAdvancedFocalPointTracking; // 0x192c(0x01)
	bool bUseFocalPointDoubleCheck; // 0x192d(0x01)
	char UnknownData_192E[0x2]; // 0x192e(0x02)
	float FocalPointDoubleCheckAllowedBlockDistance; // 0x1930(0x04)
	char UnknownData_1934[0x4]; // 0x1934(0x04)
	struct FVector RelativeFocalPoint; // 0x1938(0x0c)
	struct FRotator AppliedFocalPointCorrection; // 0x1944(0x0c)
	struct FName MeshADSPitchPivotBoneName; // 0x1950(0x08)
	float AimSnapThrottleTime; // 0x1958(0x04)
	char UnknownData_195C[0x14]; // 0x195c(0x14)
	struct UKSAimAssistAnchorComponent* CachedSnapAnchor; // 0x1970(0x08)
	float NextValidAimSnapTime; // 0x1978(0x04)
	char UnknownData_197C[0x4]; // 0x197c(0x04)
	float LockoutCameraCooldownSpeed; // 0x1980(0x04)
	char UnknownData_1984[0x1c]; // 0x1984(0x1c)
	struct FRotator NonFocalPointRotation; // 0x19a0(0x0c)
	struct FRotator AppliedFocalPointYawRotation; // 0x19ac(0x0c)
	struct UCurveFloat* CameraPivotCurve; // 0x19b8(0x08)
	bool bPivotCameraToActorNotLocation; // 0x19c0(0x01)
	bool bTrackTargetAfterPivotingToIt; // 0x19c1(0x01)
	char UnknownData_19C2[0x36]; // 0x19c2(0x36)
	struct AActor* CameraPivotTargetActor; // 0x19f8(0x08)
	char UnknownData_1A00[0x10]; // 0x1a00(0x10)
	enum class EKSCharacterAimMode AimState; // 0x1a10(0x01)
	enum class EKSCharacterAimMode DesiredAimState; // 0x1a11(0x01)
	bool bAimPressed; // 0x1a12(0x01)
	bool bWasAimDownSightsWhenAimPressed; // 0x1a13(0x01)
	bool bWasAimAlternateWhenAimPressed; // 0x1a14(0x01)
	char UnknownData_1A15[0x3]; // 0x1a15(0x03)
	float AimHoldTime; // 0x1a18(0x04)
	float AimOverShoulderHoldTime; // 0x1a1c(0x04)
	struct TMap<enum class EKSMaterialHideType, struct UMaterial*> MaterialHideTypeMap; // 0x1a20(0x50)
	struct TMap<int32_t, enum class EKSMaterialHideType> MaterialIndexesToHide; // 0x1a70(0x50)
	struct TMap<int32_t, struct UMaterialInterface*> HiddenMaterials; // 0x1ac0(0x50)
	bool bIsAimLocked; // 0x1b10(0x01)
	char UnknownData_1B11[0x7]; // 0x1b11(0x07)
	struct FMulticastInlineDelegate OnAimLockedChangedDel; // 0x1b18(0x10)
	bool bIsCrosshairHidden; // 0x1b28(0x01)
	char UnknownData_1B29[0x7]; // 0x1b29(0x07)
	struct FMulticastInlineDelegate OnCrosshairHiddenChangedDel; // 0x1b30(0x10)
	char UnknownData_1B40[0x48]; // 0x1b40(0x48)
	struct FGameplayTagContainer AvailableEquipPoints_New; // 0x1b88(0x20)
	struct TArray<struct FKSInitialInventoryItem> InitialInventory; // 0x1ba8(0x10)
	struct TArray<struct FKSInitialAmmo> InitialAmmo; // 0x1bb8(0x10)
	struct UKSEquipmentManagerComponent* EquipmentManagerComponent; // 0x1bc8(0x08)
	bool bDropAmmoOnDeath; // 0x1bd0(0x01)
	char UnknownData_1BD1[0x7]; // 0x1bd1(0x07)
	struct FGameplayTagContainer WeaponSlotsToDropOnDeath; // 0x1bd8(0x20)
	struct TArray<struct FGameplayTagContainer> ActiveWeaponSlotTiers; // 0x1bf8(0x10)
	struct TArray<struct FGameplayTagContainer> GrenadeSlotTiers; // 0x1c08(0x10)
	struct TArray<struct FKSLootLockerItem> LootLockerInventory; // 0x1c18(0x10)
	struct FGameplayTag StartingActiveWeaponEquipPoint; // 0x1c28(0x08)
	struct UKSSwapHandlerProfile* MainSwapHandlerProfile; // 0x1c30(0x08)
	struct UKSSwapHandlerProfile* GadgetSwapHandlerProfile; // 0x1c38(0x08)
	struct UKSSwapHandlerProfile* MedpackSwapHandlerProfile; // 0x1c40(0x08)
	struct UKSSwapHandlerProfile* PassiveSwapHandlerProfile; // 0x1c48(0x08)
	struct UKSSwapHandlerProfile* QuickMeleeSwapHandlerProfile; // 0x1c50(0x08)
	struct UKSWeaponAsset* EmergencyWeaponAsset; // 0x1c58(0x08)
	char UnknownData_1C60[0x8]; // 0x1c60(0x08)
	struct FText ObjectiveWeaponDropPrompt; // 0x1c68(0x18)
	struct FText ObjectiveWeaponDropProgressText; // 0x1c80(0x18)
	float DropObjectiveWeaponInteractTime; // 0x1c98(0x04)
	char UnknownData_1C9C[0x1c]; // 0x1c9c(0x1c)
	bool bSelfDestruct; // 0x1cb8(0x01)
	char UnknownData_1CB9[0x77]; // 0x1cb9(0x77)
	struct TMap<struct FName, int32_t> SubTypeComponentIndexMap; // 0x1d30(0x50)
	float MeleeHoldTime; // 0x1d80(0x04)
	int32_t PrimaryTier; // 0x1d84(0x04)
	int32_t SecondaryTier; // 0x1d88(0x04)
	int32_t MeleeTier; // 0x1d8c(0x04)
	float WeaponDropHoldTime; // 0x1d90(0x04)
	float WeaponDoubleTapTime; // 0x1d94(0x04)
	struct FMulticastInlineDelegate OnActiveWeaponChangedDel; // 0x1d98(0x10)
	char UnknownData_1DA8[0x18]; // 0x1da8(0x18)
	struct FMulticastInlineDelegate OnActiveGrenadeChangedDel; // 0x1dc0(0x10)
	char UnknownData_1DD0[0x18]; // 0x1dd0(0x18)
	struct FMulticastInlineDelegate OnActiveMedPackChangedDel; // 0x1de8(0x10)
	char UnknownData_1DF8[0x18]; // 0x1df8(0x18)
	struct FTimerHandle MeleeHoldTimer; // 0x1e10(0x08)
	struct FTimerHandle DoubleTapTimer; // 0x1e18(0x08)
	struct FTimerHandle DropHoldTimer; // 0x1e20(0x08)
	float WeaponSwapThrottleExpire; // 0x1e28(0x04)
	float WeaponSwapThrottlePeriod; // 0x1e2c(0x04)
	float QuickMeleeHoldTime; // 0x1e30(0x04)
	char UnknownData_1E34[0x4]; // 0x1e34(0x04)
	struct AKSWeapon_Melee* CurrentQuickMeleeWeapon; // 0x1e38(0x08)
	bool bQuickMeleeHoldCompleted; // 0x1e40(0x01)
	char UnknownData_1E41[0x1f]; // 0x1e41(0x1f)
	struct FMulticastInlineDelegate OnStartFireFailed; // 0x1e60(0x10)
	bool bNoFire; // 0x1e70(0x01)
	char UnknownData_1E71[0x1f]; // 0x1e71(0x1f)
	bool IsFireWeaponHeld; // 0x1e90(0x01)
	bool bIsThrowGrenadeHeld; // 0x1e91(0x01)
	bool IsPendingFire; // 0x1e92(0x01)
	bool IsAimDownSightsHeld; // 0x1e93(0x01)
	char UnknownData_1E94[0x4]; // 0x1e94(0x04)
	struct FString SwingMontageSection; // 0x1e98(0x10)
	char UnknownData_1EA8[0x10]; // 0x1ea8(0x10)
	struct FMulticastInlineDelegate OnWeaponInventoryChanged; // 0x1eb8(0x10)
	struct FMulticastInlineDelegate OnMeleeHoldStart; // 0x1ec8(0x10)
	struct FMulticastInlineDelegate OnMeleeHoldEnd; // 0x1ed8(0x10)
	struct UKSWeaponComponent* ActiveWeaponComponent[0xb]; // 0x1ee8(0x58)
	uint16_t ActiveEquipmentId[0xb]; // 0x1f40(0x16)
	char UnknownData_1F56[0x2]; // 0x1f56(0x02)
	struct FKSEquipmentContainer EquipmentContainer; // 0x1f58(0x1f0)
	struct TMap<uint16_t, struct FKSPendingWeaponStateUpdates> PendingWeaponStateUpdates; // 0x2148(0x50)
	struct FMulticastInlineDelegate OnEquipmentAddedDel; // 0x2198(0x10)
	char UnknownData_21A8[0x18]; // 0x21a8(0x18)
	struct FMulticastInlineDelegate OnEquipmentRemovedDel; // 0x21c0(0x10)
	char UnknownData_21D0[0x18]; // 0x21d0(0x18)
	struct FMulticastInlineDelegate OnEquipmentBecomeActiveDel; // 0x21e8(0x10)
	char UnknownData_21F8[0x18]; // 0x21f8(0x18)
	struct FMulticastInlineDelegate OnEquipmentEndActiveDel; // 0x2210(0x10)
	char UnknownData_2220[0x18]; // 0x2220(0x18)
	struct FMulticastInlineDelegate OnSpecialAmmoEvent; // 0x2238(0x10)
	struct TMap<enum class EAmmoType, struct UKSAmmoDropAsset*> AmmoDropAssets; // 0x2248(0x50)
	struct FKSAmmoManager AmmoManager; // 0x2298(0x130)
	char UnknownData_23C8[0x18]; // 0x23c8(0x18)
	float OutOfSightWeaponPickupRange; // 0x23e0(0x04)
	float WeaponPickupRange; // 0x23e4(0x04)
	struct USphereComponent* PickUpSphereComponent; // 0x23e8(0x08)
	float LabelPickupRange; // 0x23f0(0x04)
	char UnknownData_23F4[0x4]; // 0x23f4(0x04)
	struct FMulticastInlineDelegate OnItemPickedUp; // 0x23f8(0x10)
	struct TMap<struct AActor*, float> OutOfRangePickups; // 0x2408(0x50)
	char UnknownData_2458[0x4]; // 0x2458(0x04)
	float ReloadTapThreshold; // 0x245c(0x04)
	float ContextualPressTime; // 0x2460(0x04)
	bool bWantsToInteract; // 0x2464(0x01)
	char UnknownData_2465[0x3]; // 0x2465(0x03)
	float Health; // 0x2468(0x04)
	float CachedMaxHealth; // 0x246c(0x04)
	float DownedHealth; // 0x2470(0x04)
	float RevivedHealth; // 0x2474(0x04)
	int32_t ArmorHelmetLevel; // 0x2478(0x04)
	int32_t ArmorVestLevel; // 0x247c(0x04)
	float ArmorDurabilityPercent; // 0x2480(0x04)
	float CurrentArmorDurability; // 0x2484(0x04)
	float MaxHealthBonus; // 0x2488(0x04)
	float MaxMaxHealthBonus; // 0x248c(0x04)
	float LocalMaxHealthBonus; // 0x2490(0x04)
	char UnknownData_2494[0x4]; // 0x2494(0x04)
	struct FMulticastInlineDelegate OnMaxHealthBonusChanged; // 0x2498(0x10)
	bool bDowned; // 0x24a8(0x01)
	char UnknownData_24A9[0x7]; // 0x24a9(0x07)
	struct UKSTimerComponent* GiveUpTimer; // 0x24b0(0x08)
	float GiveUpHoldTime; // 0x24b8(0x04)
	char UnknownData_24BC[0x4]; // 0x24bc(0x04)
	struct FMulticastInlineDelegate OnGiveUpTimerActive; // 0x24c0(0x10)
	struct FMulticastInlineDelegate OnGiveUpTimerTick; // 0x24d0(0x10)
	struct FMulticastInlineDelegate OnGiveUpAllowed; // 0x24e0(0x10)
	float DownedImmuneTime; // 0x24f0(0x04)
	float DownedImmuneTimeStamp; // 0x24f4(0x04)
	char UnknownData_24F8[0x4]; // 0x24f8(0x04)
	bool bAllowGiveUp; // 0x24fc(0x01)
	char UnknownData_24FD[0x3]; // 0x24fd(0x03)
	float BleedPeriod; // 0x2500(0x04)
	float BleedDamage; // 0x2504(0x04)
	struct UDamageType* BleedDamageType; // 0x2508(0x08)
	char UnknownData_2510[0x8]; // 0x2510(0x08)
	struct AController* DownInstigator; // 0x2518(0x08)
	struct UDamageType* DownDamageType; // 0x2520(0x08)
	struct AActor* DownDamageCauser; // 0x2528(0x08)
	char UnknownData_2530[0x48]; // 0x2530(0x48)
	struct FMulticastInlineDelegate OnCharacterDownedChangedDel; // 0x2578(0x10)
	int32_t DownSpree; // 0x2588(0x04)
	char UnknownData_258C[0x4]; // 0x258c(0x04)
	struct TArray<struct UAkAudioEvent*> DownSpreeSounds; // 0x2590(0x10)
	float DefaultAssistDuration; // 0x25a0(0x04)
	char UnknownData_25A4[0x4]; // 0x25a4(0x04)
	struct TArray<struct FAssistTag> DownAssistTagQueue; // 0x25a8(0x10)
	struct TArray<struct APlayerState*> DownAssists; // 0x25b8(0x10)
	struct AController* KillInstigator; // 0x25c8(0x08)
	struct TArray<struct APlayerState*> EliminationAssists; // 0x25d0(0x10)
	struct TArray<struct APlayerState*> PlayersWithEliminationCredit; // 0x25e0(0x10)
	char UnknownData_25F0[0x8]; // 0x25f0(0x08)
	struct FText ReviveInteractionProgressText; // 0x25f8(0x18)
	struct FText ReviveInteractionPromptText; // 0x2610(0x18)
	struct UCameraShake* InteractionCameraShake; // 0x2628(0x08)
	float TimeToRevive; // 0x2630(0x04)
	float bForceCrouchOnRevive; // 0x2634(0x04)
	struct FReviveInfo ReviveInfo; // 0x2638(0x30)
	bool bCanMoveWhileRevivingOther; // 0x2668(0x01)
	char UnknownData_2669[0xf]; // 0x2669(0x0f)
	struct USphereComponent* ReviveRangeSphereComponent; // 0x2678(0x08)
	char UnknownData_2680[0x58]; // 0x2680(0x58)
	struct FWeakObjectPtr<struct AActor> ActorTargetingMeForRevive; // 0x26d8(0x08)
	struct FMulticastInlineDelegate OnStartReviveDel; // 0x26e0(0x10)
	char UnknownData_26F0[0x18]; // 0x26f0(0x18)
	struct FMulticastInlineDelegate OnStartReviveOtherDel; // 0x2708(0x10)
	char UnknownData_2718[0x18]; // 0x2718(0x18)
	struct FMulticastInlineDelegate OnReviveInterruptedDel; // 0x2730(0x10)
	char UnknownData_2740[0x18]; // 0x2740(0x18)
	struct FMulticastInlineDelegate OnReviveOtherInterruptedDel; // 0x2758(0x10)
	char UnknownData_2768[0x18]; // 0x2768(0x18)
	struct FMulticastInlineDelegate OnReviveCompletedDel; // 0x2780(0x10)
	char UnknownData_2790[0x18]; // 0x2790(0x18)
	struct FMulticastInlineDelegate OnReviveOtherCompletedDel; // 0x27a8(0x10)
	char UnknownData_27B8[0x18]; // 0x27b8(0x18)
	int32_t NumOngoingRemoteRevives; // 0x27d0(0x04)
	char UnknownData_27D4[0x24]; // 0x27d4(0x24)
	struct FMulticastInlineDelegate OnShoulderSwapChanged; // 0x27f8(0x10)
	struct UKSInteractionManager* InteractionManager; // 0x2808(0x08)
	struct UKSInteractionManager* ReceivedInteractionManager; // 0x2810(0x08)
	struct FWeakObjectPtr<struct AActor> InteractionHoverTarget; // 0x2818(0x08)
	bool bHoverTargetPress; // 0x2820(0x01)
	bool bHoverTargetHold; // 0x2821(0x01)
	char UnknownData_2822[0x6]; // 0x2822(0x06)
	struct AActor* InteractionTarget; // 0x2828(0x08)
	bool IsInInteraction; // 0x2830(0x01)
	char UnknownData_2831[0x7]; // 0x2831(0x07)
	struct UKSInteractionType* MostRecentInteractionType; // 0x2838(0x08)
	enum class EKSInteractionResult MostRecentInteractionResult; // 0x2840(0x01)
	char UnknownData_2841[0x3]; // 0x2841(0x03)
	struct FVector MostRecentInteractionStartLocation; // 0x2844(0x0c)
	bool InteractionFacesRotation; // 0x2850(0x01)
	char UnknownData_2851[0x7]; // 0x2851(0x07)
	struct FKSInteractableCameraTransition InteractionCameraTransition; // 0x2858(0x30)
	struct UKSInteractionType* DefaultInteractionType; // 0x2888(0x08)
	float InteractionDistance; // 0x2890(0x04)
	float MaxInteractionAngle; // 0x2894(0x04)
	float InteractionHoldTime; // 0x2898(0x04)
	float InteractionPriorityBaseModifier; // 0x289c(0x04)
	bool bUncrouchAfterInteraction; // 0x28a0(0x01)
	bool bInteractionCrouchLock; // 0x28a1(0x01)
	char UnknownData_28A2[0x1e]; // 0x28a2(0x1e)
	struct FTimerHandle InstantInteractHandle; // 0x28c0(0x08)
	float InstantInteractCooldownTime; // 0x28c8(0x04)
	char UnknownData_28CC[0x4]; // 0x28cc(0x04)
	struct FMulticastInlineDelegate OnHoveredInteractableChanged; // 0x28d0(0x10)
	struct FMulticastInlineDelegate OnInteractStart; // 0x28e0(0x10)
	struct FMulticastInlineDelegate OnRemotePlayerInteractStart; // 0x28f0(0x10)
	struct FMulticastInlineDelegate OnInteractEnd; // 0x2900(0x10)
	struct FMulticastInlineDelegate OnRemotePlayerInteractEnd; // 0x2910(0x10)
	struct FMulticastInlineDelegate OnInteractSuccess; // 0x2920(0x10)
	struct FMulticastInlineDelegate OnInteractFailed; // 0x2930(0x10)
	struct FMulticastInlineDelegate OnInteractInterrupted; // 0x2940(0x10)
	struct FMulticastInlineDelegate OnChargingActionStart; // 0x2950(0x10)
	struct FMulticastInlineDelegate OnChargingActionEnd; // 0x2960(0x10)
	struct FVector BaseLocalDropLocation; // 0x2970(0x0c)
	char UnknownData_297C[0x4]; // 0x297c(0x04)
	struct TMap<int32_t, float> TierToDropYawMap; // 0x2980(0x50)
	struct TMap<struct FGameplayTag, float> EquipPointToDropYawMap; // 0x29d0(0x50)
	float AmmoDropYaw; // 0x2a20(0x04)
	float DropLateralSpeed; // 0x2a24(0x04)
	float DropLateralSpeedVariance; // 0x2a28(0x04)
	float CompanionAmmoHeightShift; // 0x2a2c(0x04)
	float DropAngleVariance; // 0x2a30(0x04)
	char UnknownData_2A34[0x14]; // 0x2a34(0x14)
	bool bInRagdoll; // 0x2a48(0x01)
	bool bInPreRagdoll; // 0x2a49(0x01)
	char UnknownData_2A4A[0x1a]; // 0x2a4a(0x1a)
	float TryToStopRagdollInterval; // 0x2a64(0x04)
	float RagdollFreezeSpeed; // 0x2a68(0x04)
	char UnknownData_2A6C[0x18]; // 0x2a6c(0x18)
	float DeathDisplayLifespan; // 0x2a84(0x04)
	SoftClassProperty MinimapDeathDisplayWidget; // 0x2a88(0x28)
	SoftClassProperty FullmapDeathDisplayWidget; // 0x2ab0(0x28)
	SoftClassProperty OverlayDeathDisplayWidget; // 0x2ad8(0x28)
	bool bUseScreenSizeCutoff; // 0x2b00(0x01)
	char UnknownData_2B01[0x3]; // 0x2b01(0x03)
	float PlayerHoverRange; // 0x2b04(0x04)
	float HoverMinScreenHeightPct; // 0x2b08(0x04)
	float HoverMinScreenHeightPctADS; // 0x2b0c(0x04)
	bool bUseConeHover; // 0x2b10(0x01)
	char UnknownData_2B11[0x3]; // 0x2b11(0x03)
	float HoverConeAngle; // 0x2b14(0x04)
	float ADSHoverConeScreenRadius; // 0x2b18(0x04)
	float AlwaysHoverDistance; // 0x2b1c(0x04)
	bool bUnhoverWhenOccludedByHoveredCharacter; // 0x2b20(0x01)
	char UnknownData_2B21[0xb]; // 0x2b21(0x0b)
	bool bIsHovered; // 0x2b2c(0x01)
	char UnknownData_2B2D[0x3]; // 0x2b2d(0x03)
	float CachedCameraFOV; // 0x2b30(0x04)
	struct FVector2D CachedViewPortSize; // 0x2b34(0x08)
	float CachedHalfTanFOV; // 0x2b3c(0x04)
	char UnknownData_2B40[0xe8]; // 0x2b40(0xe8)
	bool bGodMode; // 0x2c28(0x01)
	enum class EKSRevealType RevealedStatus; // 0x2c29(0x01)
	bool bRevealedToLocalPlayer; // 0x2c2a(0x01)
	char UnknownData_2C2B[0x5]; // 0x2c2b(0x05)
	struct FRevealManager RevealManager; // 0x2c30(0x168)
	char UnknownData_2D98[0x8]; // 0x2d98(0x08)
	struct UKSPlayerMod* FlashBangEffectMod; // 0x2da0(0x08)
	char UnknownData_2DA8[0x8]; // 0x2da8(0x08)
	bool bScrambled; // 0x2db0(0x01)
	bool bMedPackPressed; // 0x2db1(0x01)
	char UnknownData_2DB2[0x6]; // 0x2db2(0x06)
	struct FMulticastInlineDelegate OnStickDel; // 0x2db8(0x10)
	struct FMulticastInlineDelegate OnMedPackFailed; // 0x2dc8(0x10)
	struct FMulticastInlineDelegate OnGrenadeFailed; // 0x2dd8(0x10)
	struct FMulticastInlineDelegate OnWeaponPickupInventoryFull; // 0x2de8(0x10)
	struct FMulticastInlineDelegate OnItemPickupSuccess; // 0x2df8(0x10)
	bool bReplicatedActivatingMod; // 0x2e08(0x01)
	char UnknownData_2E09[0x7]; // 0x2e09(0x07)
	struct FMulticastInlineDelegate OnModsUpdated; // 0x2e10(0x10)
	struct FMulticastInlineDelegate OnActivatableModsUpdated; // 0x2e20(0x10)
	char UnknownData_2E30[0x18]; // 0x2e30(0x18)
	bool bRotationInputAllowsAimAssist; // 0x2e48(0x01)
	char UnknownData_2E49[0x3]; // 0x2e49(0x03)
	float MinimumRotationInputForAimAssist; // 0x2e4c(0x04)
	char UnknownData_2E50[0x10]; // 0x2e50(0x10)
	struct FHaulingInfo HaulerInfo; // 0x2e60(0x10)
	bool AllowEnemyHauling; // 0x2e70(0x01)
	char UnknownData_2E71[0x7]; // 0x2e71(0x07)
	struct FText HaulEnemyInteractionPromptText; // 0x2e78(0x18)
	struct FName FriendlyCarrySocketName; // 0x2e90(0x08)
	struct FName EnemyCarrySocketName; // 0x2e98(0x08)
	char UnknownData_2EA0[0x10]; // 0x2ea0(0x10)
	struct FCarriedInfo CarriedInfo; // 0x2eb0(0x10)
	struct FMulticastInlineDelegate OnGamepadAbilityCycle; // 0x2ec0(0x10)
	char UnknownData_2ED0[0x1c]; // 0x2ed0(0x1c)
	float ChordDelay; // 0x2eec(0x04)
	float HoldDelay; // 0x2ef0(0x04)
	float DamageForMaxForceFeedback; // 0x2ef4(0x04)
	float DamageForceFeedbackScale; // 0x2ef8(0x04)
	float DamageForceFeedbackDuration; // 0x2efc(0x04)
	bool bDamageForceFeedbackUsesSmallMotors; // 0x2f00(0x01)
	char UnknownData_2F01[0x3]; // 0x2f01(0x03)
	float ForceFeedbackOnErrorMagnitude; // 0x2f04(0x04)
	float ForceFeedbackOnErrorDuration; // 0x2f08(0x04)
	float LandingSpeedForMaxForceFeedback; // 0x2f0c(0x04)
	struct UForceFeedbackComponent* LandForceFeedbackComponent; // 0x2f10(0x08)
	struct UForceFeedbackEffect* JumpForceFeedbackEffect; // 0x2f18(0x08)
	struct UForceFeedbackEffect* DownedForceFeedbackEffect; // 0x2f20(0x08)
	struct UForceFeedbackEffect* BeingRevivedForceFeedbackEffect; // 0x2f28(0x08)
	struct UKSAIDifficultyComponent* DifficultyComponent; // 0x2f30(0x08)
	struct UKSAIObjectivePriorityComponent* ObjectivePriorityComponent; // 0x2f38(0x08)
	struct UKSAIItemPriorityComponent* ItemPriorityComponent; // 0x2f40(0x08)
	struct UKSAIItemPriorityComponent* TempItemPriorityComponent; // 0x2f48(0x08)
	struct TArray<struct TScriptInterface<None>> ReplicatedFootstepOverrides; // 0x2f50(0x10)
	struct TArray<struct TScriptInterface<None>> AutonomousProxyFootstepOverrides; // 0x2f60(0x10)
	struct UNavArea* MovingNavAreaClass; // 0x2f70(0x08)
	struct UNavArea* StillNavAreaClass; // 0x2f78(0x08)
	struct UKSNavModifierComponent* KSNavModifierComponent; // 0x2f80(0x08)
	float NavModificationUpdateTimerPeriod; // 0x2f88(0x04)
	char UnknownData_2F8C[0xc]; // 0x2f8c(0x0c)
	struct FName DamagedHearingEventTag; // 0x2f98(0x08)
	float DamageForDefaultLoudness; // 0x2fa0(0x04)
	struct FName FireHearingEventTag; // 0x2fa4(0x08)
	float FireRangeForDefaultLoudness; // 0x2fac(0x04)
	struct FName FootstepHearingEventTag; // 0x2fb0(0x08)
	float MovementSpeedForDefaultLoudness; // 0x2fb8(0x04)
	float TeamEventRange; // 0x2fbc(0x04)
	char UnknownData_2FC0[0xc]; // 0x2fc0(0x0c)
	struct FName BotName; // 0x2fcc(0x08)
	float BotADSAccuracy; // 0x2fd4(0x04)
	bool bRandomBotName; // 0x2fd8(0x01)
	bool bBot; // 0x2fd9(0x01)
	enum class ECharacterBehaviorState CurrentBehaviorState; // 0x2fda(0x01)
	char UnknownData_2FDB[0x5]; // 0x2fdb(0x05)
	struct FMulticastInlineDelegate OnBehaviorStateChanged; // 0x2fe0(0x10)
	struct UKSAkComponent* CharacterAkComponent; // 0x2ff0(0x08)
	struct UKSVOComponent* VOComponentClass; // 0x2ff8(0x08)
	struct UKSVOComponent* VOComponent; // 0x3000(0x08)
	struct TArray<struct UDataTable*> PossibleVOTables; // 0x3008(0x10)
	char UnknownData_3018[0x4]; // 0x3018(0x04)
	struct FGameplayTag DownOtherVOEvent; // 0x301c(0x08)
	float NameplateZOffset; // 0x3024(0x04)
	float CurrentNameplateZOffset; // 0x3028(0x04)
	float CurrentNameplateAimZOffset; // 0x302c(0x04)
	float NameplateAimZOffset; // 0x3030(0x04)
	float NameplateAimZOffsetBlendTime; // 0x3034(0x04)
	float TargetNameplateAimZOffset; // 0x3038(0x04)
	float CurrentNameplateCrouchZOffset; // 0x303c(0x04)
	float NameplateCrouchZOffset; // 0x3040(0x04)
	float NameplateCrouchZOffsetBlendTime; // 0x3044(0x04)
	float TargetNameplateCrouchZOffset; // 0x3048(0x04)
	enum class EKSVehicleState VehicleState; // 0x304c(0x01)
	char UnknownData_304D[0x3]; // 0x304d(0x03)
	struct AKSVehicle* CurrentVehicle; // 0x3050(0x08)
	char UnknownData_3058[0x10]; // 0x3058(0x10)
	struct FMulticastInlineDelegate OnVehicleStateChanged; // 0x3068(0x10)
	struct FMulticastInlineDelegate OnDestructibleSpeedOverlap; // 0x3078(0x10)
	bool bDoDrawDebugLines; // 0x3088(0x01)
	char UnknownData_3089[0x3]; // 0x3089(0x03)
	struct FName MuzzleBone; // 0x308c(0x08)
	struct FName LeftElbowBone; // 0x3094(0x08)
	struct FName LeftWristBone; // 0x309c(0x08)
	struct FName RightElbowBone; // 0x30a4(0x08)
	struct FName RightWristBone; // 0x30ac(0x08)
	float HiddenArmScale; // 0x30b4(0x04)
	bool bShowWeaponWhenArmVisible; // 0x30b8(0x01)
	char UnknownData_30B9[0x3]; // 0x30b9(0x03)
	float MaxDistancePenetrationCheck; // 0x30bc(0x04)
	enum class EKSArmVisibilityType LeftArmVisibility; // 0x30c0(0x01)
	enum class EKSArmVisibilityType RightArmVisibility; // 0x30c1(0x01)
	char UnknownData_30C2[0x2]; // 0x30c2(0x02)
	struct FName PelvisBone; // 0x30c4(0x08)
	char UnknownData_30CC[0x4]; // 0x30cc(0x04)
	struct TArray<struct UKSApparelAsset*> DefaultApparelSetup; // 0x30d0(0x10)
	struct TMap<struct FAppliedApparelKey, struct UKSApparelAsset*> AppliedApparelMap; // 0x30e0(0x50)
	struct TMap<struct FName, struct FAppliedApparelKey> SlotToApparelKeyMap; // 0x3130(0x50)
	struct TArray<struct UKSApparelAsset*> ApparelAssets; // 0x3180(0x10)
	bool bNoApparel; // 0x3190(0x01)
	char UnknownData_3191[0x7]; // 0x3191(0x07)
	struct TArray<struct FWeakObjectPtr<struct UKSApparelAsset>> LocalApparelAssets; // 0x3198(0x10)
	bool bApparelAssetMapDirty; // 0x31a8(0x01)
	char UnknownData_31A9[0x7]; // 0x31a9(0x07)
	struct FTimerHandle ApparelTimeoutHandle; // 0x31b0(0x08)
	float ApparelTimeoutTime; // 0x31b8(0x04)
	bool bFirstApparelApplicationSuccess; // 0x31bc(0x01)
	char UnknownData_31BD[0x63]; // 0x31bd(0x63)
	struct FMulticastInlineDelegate OnNewApparelApplicationFinishedDel; // 0x3220(0x10)
	char UnknownData_3230[0x10]; // 0x3230(0x10)
	enum class EKSCharacterGender Gender; // 0x3240(0x01)
	enum class EKSCharacterGender LocalGender; // 0x3241(0x01)
	char UnknownData_3242[0x6]; // 0x3242(0x06)
	struct FMulticastInlineDelegate OnGenderChangedDel; // 0x3248(0x10)
	char UnknownData_3258[0x18]; // 0x3258(0x18)
	struct USkinObjectManagerComponent* SkinsManager; // 0x3270(0x08)
	struct UMultiSkinObject* DefaultBodyApparelSkinObject; // 0x3278(0x08)
	struct FGameplayTagContainer SkinTagContainer; // 0x3280(0x20)
	struct TArray<struct FDataTableInfo> DefaultApparelSkinTables; // 0x32a0(0x10)
	char UnknownData_32B0[0x18]; // 0x32b0(0x18)
	bool bUseCameraProximityFading; // 0x32c8(0x01)
	char UnknownData_32C9[0x3]; // 0x32c9(0x03)
	float CameraFadeStartDistance; // 0x32cc(0x04)
	float CameraFadeEndDistance; // 0x32d0(0x04)
	struct FName FadeAlphaParamName; // 0x32d4(0x08)
	float LastCameraProximityAlpha; // 0x32dc(0x04)
	struct TMap<struct FName, struct UKSFXCurveComponent*> ActiveFXCurveComponents; // 0x32e0(0x50)
	enum class EKSEmotion Emotion; // 0x3330(0x01)
	enum class EKSEmotion LocalEmotion; // 0x3331(0x01)
	enum class EKSEmotion LastEmotion; // 0x3332(0x01)
	char UnknownData_3333[0x1]; // 0x3333(0x01)
	float EmotionFloat; // 0x3334(0x04)
	struct FMulticastInlineDelegate OnEmotionChangedDel; // 0x3338(0x10)
	struct AActor* CurrentEmotePhysicsProp; // 0x3348(0x08)
	struct UKSAnimationAuditComponent* AnimationAuditComponent; // 0x3350(0x08)
	struct UMaterialInstanceDynamic* ADSBlurMID; // 0x3358(0x08)
	float TimeToRepairArmor; // 0x3360(0x04)
	float DurabilityASecond; // 0x3364(0x04)
	bool bRepairAllArmorAtOnce; // 0x3368(0x01)
	char UnknownData_3369[0x7]; // 0x3369(0x07)
	struct FText ArmorRepairProgressText; // 0x3370(0x18)
	struct FText ArmorRepairPromptText; // 0x3388(0x18)
	bool bCanRepairArmor; // 0x33a0(0x01)
	bool bRepairableArmorEquipped; // 0x33a1(0x01)
	bool bIsRepairingArmor; // 0x33a2(0x01)
	char UnknownData_33A3[0x5]; // 0x33a3(0x05)
	struct FMulticastInlineDelegate OnRepairableArmorEquippedDel; // 0x33a8(0x10)
	struct FMulticastInlineDelegate OnArmorInteractAvailableDel; // 0x33b8(0x10)
	char UnknownData_33C8[0x8]; // 0x33c8(0x08)

	void ViewedPawnTakeDamage(float DamageAmount, struct UDamageType* DamageTypeClass, struct AActor* DamageCauser, struct FVector DamageOrigin); // Function Killstreak.KSCharacter.ViewedPawnTakeDamage
	void ViewedPawnNoLongerRevealed(); // Function Killstreak.KSCharacter.ViewedPawnNoLongerRevealed
	void ViewedPawnInstigatedHeadshot(struct FCombatEventInfo DamageInfo); // Function Killstreak.KSCharacter.ViewedPawnInstigatedHeadshot
	void ViewedPawnInstigatedDamage(struct FCombatEventInfo DamageInfo); // Function Killstreak.KSCharacter.ViewedPawnInstigatedDamage
	void ViewedPawnHasBeenRevealed(bool Permanent); // Function Killstreak.KSCharacter.ViewedPawnHasBeenRevealed
	void VehicleStateChanged(enum class EKSVehicleState CurrentVehicleState); // Function Killstreak.KSCharacter.VehicleStateChanged
	void UpdateNavModification(); // Function Killstreak.KSCharacter.UpdateNavModification
	void UpdateMantleHands(enum class EKSPlayerHand Hand, bool bEnable); // Function Killstreak.KSCharacter.UpdateMantleHands
	void UpdateHoveredInteractable(); // Function Killstreak.KSCharacter.UpdateHoveredInteractable
	void UpdateAmmo(enum class EAmmoType AmmoType, int32_t AmmoDelta); // Function Killstreak.KSCharacter.UpdateAmmo
	void UpdateAimStatus(); // Function Killstreak.KSCharacter.UpdateAimStatus
	void UnSelectToRevive(struct AActor* Reviver); // Function Killstreak.KSCharacter.UnSelectToRevive
	void UnregisterFootstepOverride(struct TScriptInterface<None> ToRemove); // Function Killstreak.KSCharacter.UnregisterFootstepOverride
	void UnlockShoulderSwap(bool ForceFullUnlock); // Function Killstreak.KSCharacter.UnlockShoulderSwap
	void UnhideZiplinePulley(); // Function Killstreak.KSCharacter.UnhideZiplinePulley
	void UnhideUplineDevice(); // Function Killstreak.KSCharacter.UnhideUplineDevice
	void UnHideADSMaterials(); // Function Killstreak.KSCharacter.UnHideADSMaterials
	void TryToStopRagdoll(); // Function Killstreak.KSCharacter.TryToStopRagdoll
	void TryToStopAiming(bool IsInterrupt); // Function Killstreak.KSCharacter.TryToStopAiming
	void TryToAimOverShoulder(bool bSkipUpdate); // Function Killstreak.KSCharacter.TryToAimOverShoulder
	void TryToAimDownSights(bool bSkipUpdate); // Function Killstreak.KSCharacter.TryToAimDownSights
	void TryToAimAlternate(bool bSkipUpdate); // Function Killstreak.KSCharacter.TryToAimAlternate
	void ToggleSprint(); // Function Killstreak.KSCharacter.ToggleSprint
	void ToggleScopeZoomIndexUp(); // Function Killstreak.KSCharacter.ToggleScopeZoomIndexUp
	void ToggleScopeZoomIndexLoop(); // Function Killstreak.KSCharacter.ToggleScopeZoomIndexLoop
	void ToggleScopeZoomIndexDown(); // Function Killstreak.KSCharacter.ToggleScopeZoomIndexDown
	void ToggleCrouch(); // Function Killstreak.KSCharacter.ToggleCrouch
	void ToggleCarry(); // Function Killstreak.KSCharacter.ToggleCarry
	void ThrowGrenadeReleased(); // Function Killstreak.KSCharacter.ThrowGrenadeReleased
	void ThrowGrenadePressed(); // Function Killstreak.KSCharacter.ThrowGrenadePressed
	void TagForDownAssist(struct APlayerState* Assistant, float Duration); // Function Killstreak.KSCharacter.TagForDownAssist
	void SwapWeapon(struct AKSWeapon* NextWeapon, bool bForce); // Function Killstreak.KSCharacter.SwapWeapon
	void SwapToSecondary(); // Function Killstreak.KSCharacter.SwapToSecondary
	void SwapToPrimary(); // Function Killstreak.KSCharacter.SwapToPrimary
	void SwapToPreviousWeaponWithLoadedClip(bool bForce); // Function Killstreak.KSCharacter.SwapToPreviousWeaponWithLoadedClip
	void SwapToPreviousWeaponWithAmmo(bool bForce); // Function Killstreak.KSCharacter.SwapToPreviousWeaponWithAmmo
	void SwapToPreviousWeapon(bool bForce); // Function Killstreak.KSCharacter.SwapToPreviousWeapon
	void SwapToNextWeaponWithLoadedClip(bool bForce); // Function Killstreak.KSCharacter.SwapToNextWeaponWithLoadedClip
	void SwapToNextWeaponWithAmmo(bool bForce); // Function Killstreak.KSCharacter.SwapToNextWeaponWithAmmo
	void SwapToNextWeapon(bool bForce); // Function Killstreak.KSCharacter.SwapToNextWeapon
	void SwapToNextGrenade(bool bForce); // Function Killstreak.KSCharacter.SwapToNextGrenade
	void SwapToMelee(); // Function Killstreak.KSCharacter.SwapToMelee
	void SwapToMacGuffin(); // Function Killstreak.KSCharacter.SwapToMacGuffin
	void SwapSeatsTimerComplete(); // Function Killstreak.KSCharacter.SwapSeatsTimerComplete
	void SwapSeatsReleased(); // Function Killstreak.KSCharacter.SwapSeatsReleased
	void SwapSeatsPressed(); // Function Killstreak.KSCharacter.SwapSeatsPressed
	void SwapGrenade(struct AKSWeapon* NextWeapon, bool bForce); // Function Killstreak.KSCharacter.SwapGrenade
	void SwapActiveGrenade(); // Function Killstreak.KSCharacter.SwapActiveGrenade
	void StopRevealedToLocalPlayer(); // Function Killstreak.KSCharacter.StopRevealedToLocalPlayer
	void StopReveal(struct FRevealInfo InRevealInfo); // Function Killstreak.KSCharacter.StopReveal
	void StopKSEffect(struct FName InFXID); // Function Killstreak.KSCharacter.StopKSEffect
	void StopFire(); // Function Killstreak.KSCharacter.StopFire
	bool StopAnimEvent(struct FName AnimEventName, struct UKSCharacterAnimInst* CharAnimInstance); // Function Killstreak.KSCharacter.StopAnimEvent
	void StopAimDownSights(); // Function Killstreak.KSCharacter.StopAimDownSights
	void StopActiveHaul(); // Function Killstreak.KSCharacter.StopActiveHaul
	void StartRevealedToLocalPlayer(); // Function Killstreak.KSCharacter.StartRevealedToLocalPlayer
	void StartLockoutCamera(); // Function Killstreak.KSCharacter.StartLockoutCamera
	struct UKSFXCurveComponent* StartKSSpecialEffect(struct FKSSpecialEffect Effect, float PlayRate, bool bRestart); // Function Killstreak.KSCharacter.StartKSSpecialEffect
	void StartHacking(); // Function Killstreak.KSCharacter.StartHacking
	bool StartFire(); // Function Killstreak.KSCharacter.StartFire
	void SprintImpulseTimelineProgress(float Value); // Function Killstreak.KSCharacter.SprintImpulseTimelineProgress
	void SetupChords(); // Function Killstreak.KSCharacter.SetupChords
	void SetSelfDestruct(bool InSelfDestruct); // Function Killstreak.KSCharacter.SetSelfDestruct
	void SetPrimaryHeatSource(struct UKSHeatSourceComponent* InHeatSource); // Function Killstreak.KSCharacter.SetPrimaryHeatSource
	void SetOnFire(float Duration); // Function Killstreak.KSCharacter.SetOnFire
	void SetNoFire(); // Function Killstreak.KSCharacter.SetNoFire
	void SetInteractionFacesRotation(bool FacesRotation); // Function Killstreak.KSCharacter.SetInteractionFacesRotation
	void SetInteractionCameraTransition(struct FKSInteractableCameraTransition CameraTransition); // Function Killstreak.KSCharacter.SetInteractionCameraTransition
	void SetGodMode(bool InGodMode); // Function Killstreak.KSCharacter.SetGodMode
	void SetActorTargetingMeForRevive(struct AActor* Reviver); // Function Killstreak.KSCharacter.SetActorTargetingMeForRevive
	void SetActiveCameraSimple(struct FName Tag, float InBlendTime); // Function Killstreak.KSCharacter.SetActiveCameraSimple
	void SetActiveCamera(struct FName Tag, struct FViewTargetTransitionParams InBlendParams); // Function Killstreak.KSCharacter.SetActiveCamera
	void ServerTryToCarry(struct AActor* CarryTarget); // Function Killstreak.KSCharacter.ServerTryToCarry
	void ServerSwapToNextGrenade(bool bForce); // Function Killstreak.KSCharacter.ServerSwapToNextGrenade
	void ServerStopGiveUpTimer(); // Function Killstreak.KSCharacter.ServerStopGiveUpTimer
	void ServerStopCarryChecked(struct AActor* CarryTarget); // Function Killstreak.KSCharacter.ServerStopCarryChecked
	void ServerStopCarry(); // Function Killstreak.KSCharacter.ServerStopCarry
	void ServerStartGiveUpTimer(); // Function Killstreak.KSCharacter.ServerStartGiveUpTimer
	void ServerSetActiveWeaponToNone(int32_t InIndex); // Function Killstreak.KSCharacter.ServerSetActiveWeaponToNone
	void ServerRequestActivateAbilityRelease(int32_t Ability); // Function Killstreak.KSCharacter.ServerRequestActivateAbilityRelease
	void ServerRequestActivateAbility(int32_t Ability); // Function Killstreak.KSCharacter.ServerRequestActivateAbility
	void ServerGetInNextEmptySeat(); // Function Killstreak.KSCharacter.ServerGetInNextEmptySeat
	void ServerGetInDriverSeat(); // Function Killstreak.KSCharacter.ServerGetInDriverSeat
	void ServerExitVehicle(); // Function Killstreak.KSCharacter.ServerExitVehicle
	void ServerDropWeapon(struct AKSWeapon* InWeapon); // Function Killstreak.KSCharacter.ServerDropWeapon
	void ServerChangeShoulderCamera(enum class ECameraShoulder InShoulder); // Function Killstreak.KSCharacter.ServerChangeShoulderCamera
	void ServerAbilityWeaponPrepareSwapTo(struct AKSWeapon* Weapon); // Function Killstreak.KSCharacter.ServerAbilityWeaponPrepareSwapTo
	void SelectToRevive(struct AActor* Reviver); // Function Killstreak.KSCharacter.SelectToRevive
	void RotateToFace(struct FVector Location); // Function Killstreak.KSCharacter.RotateToFace
	void ReviveOverlapStopped(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Killstreak.KSCharacter.ReviveOverlapStopped
	void ReverseKSEffect(struct FName InFXID); // Function Killstreak.KSCharacter.ReverseKSEffect
	void RevealToWholeTeamWithInfo(float Duration, struct AController* Revealer, struct TArray<struct FRevealInfo> OutRevealInfos, enum class EPlayerSilhouetteType Type, bool Fill, bool Mark); // Function Killstreak.KSCharacter.RevealToWholeTeamWithInfo
	void ResetKSEffectTime(struct FName InFXID); // Function Killstreak.KSCharacter.ResetKSEffectTime
	void ReportFootstepNoise(float Speed); // Function Killstreak.KSCharacter.ReportFootstepNoise
	void ReportFireNoise(float Range); // Function Killstreak.KSCharacter.ReportFireNoise
	void ReportDamageEvent(struct AActor* Damager, float Damage, struct FVector OriginLocation, struct FVector HitLocation); // Function Killstreak.KSCharacter.ReportDamageEvent
	void ReportDamagedNoise(float Damage); // Function Killstreak.KSCharacter.ReportDamagedNoise
	void ReplicateSpecialAmmoEvent(enum class EAmmoType AmmoType, int32_t AmmoDelta, struct FName EventName); // Function Killstreak.KSCharacter.ReplicateSpecialAmmoEvent
	bool RemoveWeaponFromInventory(struct AKSWeapon* InWeapon); // Function Killstreak.KSCharacter.RemoveWeaponFromInventory
	void RemoveSkinTag(struct FGameplayTag InSkinTag); // Function Killstreak.KSCharacter.RemoveSkinTag
	void RemoveParticleEffects(struct TArray<struct UParticleSystemComponent*> ParticleSystems); // Function Killstreak.KSCharacter.RemoveParticleEffects
	void RemoveOutOfRangePickup(struct AActor* OtherActor); // Function Killstreak.KSCharacter.RemoveOutOfRangePickup
	bool RemoveMod(struct UKSPlayerMod* Mod, bool RemoveAll); // Function Killstreak.KSCharacter.RemoveMod
	void RemoveEffectCurve(struct FName InFXID); // Function Killstreak.KSCharacter.RemoveEffectCurve
	void RemoveBlendable(struct TScriptInterface<None> InBlendableObject); // Function Killstreak.KSCharacter.RemoveBlendable
	void RemoveBackpack(); // Function Killstreak.KSCharacter.RemoveBackpack
	void RemoveActionRestriction(int32_t ID); // Function Killstreak.KSCharacter.RemoveActionRestriction
	void RemotePlayerPickupItem(struct AKSItemDrop* ItemDropClass, struct UKSItem* Item); // Function Killstreak.KSCharacter.RemotePlayerPickupItem
	void RemotePlayerInteractStart(float InteractDuration, struct AActor* InteractTarget); // Function Killstreak.KSCharacter.RemotePlayerInteractStart
	void RemotePlayerInteractEnd(enum class EKSInteractionResult Result, struct FVector InteractionLocation, struct AActor* OldInteractTarget); // Function Killstreak.KSCharacter.RemotePlayerInteractEnd
	void RemoteClientNotifyLand(struct FHitResult LandingHit); // Function Killstreak.KSCharacter.RemoteClientNotifyLand
	void Reload(); // Function Killstreak.KSCharacter.Reload
	void ReleaseGiveUp(); // Function Killstreak.KSCharacter.ReleaseGiveUp
	void ReleaseCrouch(); // Function Killstreak.KSCharacter.ReleaseCrouch
	void ReleaseAllActiveInputs(); // Function Killstreak.KSCharacter.ReleaseAllActiveInputs
	void ReleaseActiveInputsOfType(enum class EInputReleaseType InputReleaseType); // Function Killstreak.KSCharacter.ReleaseActiveInputsOfType
	void ReleaseActiveInputs(struct TArray<struct FName> InputsToRelease); // Function Killstreak.KSCharacter.ReleaseActiveInputs
	void RegisterFootstepOverride(struct TScriptInterface<None> ToAdd); // Function Killstreak.KSCharacter.RegisterFootstepOverride
	void ReevaluateNoFire(struct UPrimitiveComponent* LeftOverlapper); // Function Killstreak.KSCharacter.ReevaluateNoFire
	void QuickMeleeHoldTimerComplete(); // Function Killstreak.KSCharacter.QuickMeleeHoldTimerComplete
	bool QueryModsForAnimEvent(struct FName AnimEventName, struct UKSCharacterAnimInst* CharAnimInst); // Function Killstreak.KSCharacter.QueryModsForAnimEvent
	void PrimaryWeaponFOVChanged(float NewFOV); // Function Killstreak.KSCharacter.PrimaryWeaponFOVChanged
	void PrimarySprayDecalExpired(struct UPoolableDecalComponent* InDecalComponent); // Function Killstreak.KSCharacter.PrimarySprayDecalExpired
	void PressGiveUp(); // Function Killstreak.KSCharacter.PressGiveUp
	void PlayVO(struct FKSVoicelineEvent VoicelineEvent); // Function Killstreak.KSCharacter.PlayVO
	void PlayHitFromRadialDamage(struct FDamageEffect Effect); // Function Killstreak.KSCharacter.PlayHitFromRadialDamage
	void PlayHitFromPointDamage(struct FDamageEffect Effect); // Function Killstreak.KSCharacter.PlayHitFromPointDamage
	void PlayActionCameraSequence(struct FName SequenceName); // Function Killstreak.KSCharacter.PlayActionCameraSequence
	void OutOfBoundsWarningEnd(); // Function Killstreak.KSCharacter.OutOfBoundsWarningEnd
	void OutOfBoundsOverlapEnd(); // Function Killstreak.KSCharacter.OutOfBoundsOverlapEnd
	void OutOfBoundsOverlapBegin(float WarningLength); // Function Killstreak.KSCharacter.OutOfBoundsOverlapBegin
	void OnWeaponSwapSuccessful(struct AKSWeapon* FromWeapon, struct AKSWeapon* ToWeapon); // Function Killstreak.KSCharacter.OnWeaponSwapSuccessful
	void OnWeaponSwapFailed(struct AKSWeapon* FromWeapon, struct AKSWeapon* ToWeapon); // Function Killstreak.KSCharacter.OnWeaponSwapFailed
	void OnUnhovered(float ExtraTime); // Function Killstreak.KSCharacter.OnUnhovered
	void OnStopAimDownSightsCheckpoint(); // Function Killstreak.KSCharacter.OnStopAimDownSightsCheckpoint
	void OnStartAimDownSightsCheckpoint(); // Function Killstreak.KSCharacter.OnStartAimDownSightsCheckpoint
	void OnReviveStart(struct AKSCharacter* Reviver, float ReviveTime, bool Remote); // Function Killstreak.KSCharacter.OnReviveStart
	void OnReviveInterrupt(struct AKSCharacter* Reviver); // Function Killstreak.KSCharacter.OnReviveInterrupt
	void OnReviveComplete(struct AKSCharacter* Reviver); // Function Killstreak.KSCharacter.OnReviveComplete
	void OnRep_VehicleState(); // Function Killstreak.KSCharacter.OnRep_VehicleState
	void OnRep_StartingActiveWeaponEquipPoint(); // Function Killstreak.KSCharacter.OnRep_StartingActiveWeaponEquipPoint
	void OnRep_SelfDestruct(); // Function Killstreak.KSCharacter.OnRep_SelfDestruct
	void OnRep_Scrambled(); // Function Killstreak.KSCharacter.OnRep_Scrambled
	void OnRep_ReviveInfo(); // Function Killstreak.KSCharacter.OnRep_ReviveInfo
	void OnRep_RevealedStatus(); // Function Killstreak.KSCharacter.OnRep_RevealedStatus
	void OnRep_OutOfBoundsInfo(); // Function Killstreak.KSCharacter.OnRep_OutOfBoundsInfo
	void OnRep_OnFire(); // Function Killstreak.KSCharacter.OnRep_OnFire
	void OnRep_IsInInteraction(); // Function Killstreak.KSCharacter.OnRep_IsInInteraction
	void OnRep_Health(); // Function Killstreak.KSCharacter.OnRep_Health
	void OnRep_HaulingInfo(); // Function Killstreak.KSCharacter.OnRep_HaulingInfo
	void OnRep_GiveUpTimer(); // Function Killstreak.KSCharacter.OnRep_GiveUpTimer
	void OnRep_Gender(); // Function Killstreak.KSCharacter.OnRep_Gender
	void OnRep_EMPLockout(); // Function Killstreak.KSCharacter.OnRep_EMPLockout
	void OnRep_Emotion(); // Function Killstreak.KSCharacter.OnRep_Emotion
	void OnRep_Downed(); // Function Killstreak.KSCharacter.OnRep_Downed
	void OnRep_CurrentBehaviorState(); // Function Killstreak.KSCharacter.OnRep_CurrentBehaviorState
	void OnRep_CarriedInfo(); // Function Killstreak.KSCharacter.OnRep_CarriedInfo
	void OnRep_CameraShoulder(); // Function Killstreak.KSCharacter.OnRep_CameraShoulder
	void OnRep_CameraPivotTargetActor(); // Function Killstreak.KSCharacter.OnRep_CameraPivotTargetActor
	void OnRep_bRepairableArmorEquipped(); // Function Killstreak.KSCharacter.OnRep_bRepairableArmorEquipped
	void OnRep_Bot(); // Function Killstreak.KSCharacter.OnRep_Bot
	void OnRep_bCanRepairArmor(); // Function Killstreak.KSCharacter.OnRep_bCanRepairArmor
	void OnRep_ApparelAssets(); // Function Killstreak.KSCharacter.OnRep_ApparelAssets
	void OnRep_AllowGiveUp(); // Function Killstreak.KSCharacter.OnRep_AllowGiveUp
	void OnRep_ActiveEquipmentId(); // Function Killstreak.KSCharacter.OnRep_ActiveEquipmentId
	void OnImmuneStart(); // Function Killstreak.KSCharacter.OnImmuneStart
	void OnImmuneEnd(); // Function Killstreak.KSCharacter.OnImmuneEnd
	void OnHovered(); // Function Killstreak.KSCharacter.OnHovered
	void OnGrenadeClassLoaded(struct UKSWeaponAsset_Grenade* pGrenadeWeaponAsset); // Function Killstreak.KSCharacter.OnGrenadeClassLoaded
	void OnGadgetSwapped(); // Function Killstreak.KSCharacter.OnGadgetSwapped
	void OnFieldOfViewModChange(); // Function Killstreak.KSCharacter.OnFieldOfViewModChange
	void OnEndOutOfBounds(); // Function Killstreak.KSCharacter.OnEndOutOfBounds
	void OnDeathDestroy(); // Function Killstreak.KSCharacter.OnDeathDestroy
	void OnDeathCleanup(); // Function Killstreak.KSCharacter.OnDeathCleanup
	void OnBeginOutOfBounds(); // Function Killstreak.KSCharacter.OnBeginOutOfBounds
	void OnArmorRegenerationStart(float RegenerationTime); // Function Killstreak.KSCharacter.OnArmorRegenerationStart
	void OnArmorRegenerationInterrupt(); // Function Killstreak.KSCharacter.OnArmorRegenerationInterrupt
	void OnArmorRegenerationComplete(); // Function Killstreak.KSCharacter.OnArmorRegenerationComplete
	void OnArmorInteractStart(float InteractTime); // Function Killstreak.KSCharacter.OnArmorInteractStart
	void OnArmorInteractInterrupt(); // Function Killstreak.KSCharacter.OnArmorInteractInterrupt
	void OnArmorInteractComplete(); // Function Killstreak.KSCharacter.OnArmorInteractComplete
	void OnApparelTimeoutExpire(); // Function Killstreak.KSCharacter.OnApparelTimeoutExpire
	void NoseDiveCameraTransition(bool bEnterNoseDive, float AnimLength); // Function Killstreak.KSCharacter.NoseDiveCameraTransition
	void NativeJumpToSwingMontage(struct FString SwingMontageSectionName); // Function Killstreak.KSCharacter.NativeJumpToSwingMontage
	void MoveRight(float Value); // Function Killstreak.KSCharacter.MoveRight
	void MoveForward(float Value); // Function Killstreak.KSCharacter.MoveForward
	void MeleeReleased(); // Function Killstreak.KSCharacter.MeleeReleased
	void MeleePressed(); // Function Killstreak.KSCharacter.MeleePressed
	void MedPackReleased(); // Function Killstreak.KSCharacter.MedPackReleased
	void MedPackPressed(); // Function Killstreak.KSCharacter.MedPackPressed
	void LogShotgunHitData(struct FShotgunHitData HitData); // Function Killstreak.KSCharacter.LogShotgunHitData
	void LockShoulderSwap(); // Function Killstreak.KSCharacter.LockShoulderSwap
	void KillIfDowned(); // Function Killstreak.KSCharacter.KillIfDowned
	void JumpToSwingMontage(struct FString SwingMontageSectionName); // Function Killstreak.KSCharacter.JumpToSwingMontage
	bool IsZipLining(); // Function Killstreak.KSCharacter.IsZipLining
	bool IsUsingEmoteCamera(); // Function Killstreak.KSCharacter.IsUsingEmoteCamera
	bool IsShoulderSwapLocked(); // Function Killstreak.KSCharacter.IsShoulderSwapLocked
	bool IsRevivingAnotherPlayer(struct AKSCharacter* OutReviveTarget, bool bCountRemoteRevives); // Function Killstreak.KSCharacter.IsRevivingAnotherPlayer
	bool IsRevealable(); // Function Killstreak.KSCharacter.IsRevealable
	bool IsRepairableArmorEquipped(); // Function Killstreak.KSCharacter.IsRepairableArmorEquipped
	bool IsPerformingAnInteraction(); // Function Killstreak.KSCharacter.IsPerformingAnInteraction
	bool IsOutOfRangePickup(struct AActor* OtherActor); // Function Killstreak.KSCharacter.IsOutOfRangePickup
	bool IsOutOfBounds(float RemainingTime); // Function Killstreak.KSCharacter.IsOutOfBounds
	bool IsOnFire(); // Function Killstreak.KSCharacter.IsOnFire
	bool IsLocallyHovered(); // Function Killstreak.KSCharacter.IsLocallyHovered
	bool IsLobby(); // Function Killstreak.KSCharacter.IsLobby
	bool IsInVehicle(); // Function Killstreak.KSCharacter.IsInVehicle
	bool IsInRagdoll(); // Function Killstreak.KSCharacter.IsInRagdoll
	bool IsInLockoutCameraCooldown(); // Function Killstreak.KSCharacter.IsInLockoutCameraCooldown
	bool IsInLockoutCamera(); // Function Killstreak.KSCharacter.IsInLockoutCamera
	bool IsHaulingRightNow(); // Function Killstreak.KSCharacter.IsHaulingRightNow
	bool IsDowned(); // Function Killstreak.KSCharacter.IsDowned
	bool IsCrosshairHidden(); // Function Killstreak.KSCharacter.IsCrosshairHidden
	bool IsBlinded(); // Function Killstreak.KSCharacter.IsBlinded
	bool IsBeingRevived(struct AKSCharacter* Reviver, float Progress); // Function Killstreak.KSCharacter.IsBeingRevived
	bool IsAnyEquippedWeaponTakingAction(struct AKSWeapon* IgnoredWeapon); // Function Killstreak.KSCharacter.IsAnyEquippedWeaponTakingAction
	bool IsAimLocked(); // Function Killstreak.KSCharacter.IsAimLocked
	bool IsActiveWeapon(struct AKSWeapon* InWeapon); // Function Killstreak.KSCharacter.IsActiveWeapon
	void InvalidateAllRevealOfMe(); // Function Killstreak.KSCharacter.InvalidateAllRevealOfMe
	void InterruptNonCharacterRevive(); // Function Killstreak.KSCharacter.InterruptNonCharacterRevive
	void InterruptAimDownSightsToggle(bool bReturnWhenComplete); // Function Killstreak.KSCharacter.InterruptAimDownSightsToggle
	void InterruptAimAlternateToggle(bool bReturnWhenComplete); // Function Killstreak.KSCharacter.InterruptAimAlternateToggle
	void InstantRevive(struct AKSCharacter* Reviver); // Function Killstreak.KSCharacter.InstantRevive
	void InputStopSprint(); // Function Killstreak.KSCharacter.InputStopSprint
	void InputStopFire(); // Function Killstreak.KSCharacter.InputStopFire
	void InputStartSprint(); // Function Killstreak.KSCharacter.InputStartSprint
	void InputStartFire(); // Function Killstreak.KSCharacter.InputStartFire
	bool InitRagdoll(); // Function Killstreak.KSCharacter.InitRagdoll
	void HideZiplinePulley(); // Function Killstreak.KSCharacter.HideZiplinePulley
	void HideUplineDevice(); // Function Killstreak.KSCharacter.HideUplineDevice
	void HideADSMaterials(); // Function Killstreak.KSCharacter.HideADSMaterials
	bool HasModAny(struct TArray<struct UKSPlayerMod*> TestPlayerMods); // Function Killstreak.KSCharacter.HasModAny
	bool HasMod(struct UKSPlayerMod* TestPlayerMod); // Function Killstreak.KSCharacter.HasMod
	bool HasEquipPoint(struct FGameplayTag EquipPoint); // Function Killstreak.KSCharacter.HasEquipPoint
	void HandleDownEvent(struct FCombatEventInfo EventInfo, int32_t ExpBonus); // Function Killstreak.KSCharacter.HandleDownEvent
	void GiveUpTimerTick(float Seconds); // Function Killstreak.KSCharacter.GiveUpTimerTick
	void GiveUpTimerComplete(); // Function Killstreak.KSCharacter.GiveUpTimerComplete
	void GiveUpTimerActive(bool bActive); // Function Killstreak.KSCharacter.GiveUpTimerActive
	bool GiveModInstance(struct UKSPlayerMod* Mod, struct AKSPlayerState* ModInstigator, struct UKSPlayerModInstance* Instance, bool Unique); // Function Killstreak.KSCharacter.GiveModInstance
	bool GiveMod(struct UKSPlayerMod* Mod, struct AKSPlayerState* ModInstigator, bool Unique); // Function Killstreak.KSCharacter.GiveMod
	struct AKSWeapon* GetWeaponByAsset(struct UKSWeaponAsset* InAsset); // Function Killstreak.KSCharacter.GetWeaponByAsset
	struct AKSWeapon* GetWeaponAtEquipPoint(struct FGameplayTag EquipPoint); // Function Killstreak.KSCharacter.GetWeaponAtEquipPoint
	struct UKSVOComponent* GetVOComponent(); // Function Killstreak.KSCharacter.GetVOComponent
	struct FGameplayTagContainer GetValidWeaponPoints(); // Function Killstreak.KSCharacter.GetValidWeaponPoints
	struct FGameplayTagContainer GetUsedEquipPoints(); // Function Killstreak.KSCharacter.GetUsedEquipPoints
	bool GetSpecialties(struct TArray<struct UKSSpecialty*> OutSpecialties); // Function Killstreak.KSCharacter.GetSpecialties
	struct FName GetSeatAimCameraTag(); // Function Killstreak.KSCharacter.GetSeatAimCameraTag
	struct AKSCharacter* GetReviver(); // Function Killstreak.KSCharacter.GetReviver
	struct FName GetReviveeOverrideMontage(); // Function Killstreak.KSCharacter.GetReviveeOverrideMontage
	struct UKSHeatSourceComponent* GetPrimaryHeatSource(); // Function Killstreak.KSCharacter.GetPrimaryHeatSource
	struct USphereComponent* GetPickupSphere(); // Function Killstreak.KSCharacter.GetPickupSphere
	void GetOverrideByLocation(struct FVector WorldLocation, bool outShouldOverride, struct FName outOverrideName); // Function Killstreak.KSCharacter.GetOverrideByLocation
	struct UKSInteractionType* GetMostRecentInteractionType(); // Function Killstreak.KSCharacter.GetMostRecentInteractionType
	bool GetModInstances(struct TArray<struct UKSPlayerModInstance*> OutMods); // Function Killstreak.KSCharacter.GetModInstances
	float GetMaxHealthBonus(); // Function Killstreak.KSCharacter.GetMaxHealthBonus
	enum class EKSArmVisibilityType GetLeftArmVisibility(); // Function Killstreak.KSCharacter.GetLeftArmVisibility
	bool GetIsInInteraction(); // Function Killstreak.KSCharacter.GetIsInInteraction
	struct AActor* GetInteractionTarget(); // Function Killstreak.KSCharacter.GetInteractionTarget
	void GetHitPawnEffectOverride(struct UParticleSystem* ParticleSystem); // Function Killstreak.KSCharacter.GetHitPawnEffectOverride
	void GetHitHeadAudioEventOverride(struct UAkAudioEvent* SoundEffect); // Function Killstreak.KSCharacter.GetHitHeadAudioEventOverride
	void GetHitByAudioEventOverride(struct UAkAudioEvent* SoundEffect); // Function Killstreak.KSCharacter.GetHitByAudioEventOverride
	void GetHitBodyAudioEventOverride(struct UAkAudioEvent* SoundEffect); // Function Killstreak.KSCharacter.GetHitBodyAudioEventOverride
	float GetGiveUpTime(); // Function Killstreak.KSCharacter.GetGiveUpTime
	enum class EKSCharacterGender GetGender(); // Function Killstreak.KSCharacter.GetGender
	struct UKSFXCurveComponent* GetFXCurveComponentByFXID(struct FName InFXID); // Function Killstreak.KSCharacter.GetFXCurveComponentByFXID
	float GetFlashBangEffectDurationFromDistance(float Distance); // Function Killstreak.KSCharacter.GetFlashBangEffectDurationFromDistance
	bool GetFieldOfViewFromMods(float OutFov); // Function Killstreak.KSCharacter.GetFieldOfViewFromMods
	struct UKSEquipmentManagerComponent* GetEquipmentManagerComponent(); // Function Killstreak.KSCharacter.GetEquipmentManagerComponent
	struct AKSEquipment* GetEquipmentAtEquipPoint(struct FGameplayTag EquipPoint); // Function Killstreak.KSCharacter.GetEquipmentAtEquipPoint
	void GetDownedTransitionMontage(struct UAnimMontage* OutAnimMontage); // Function Killstreak.KSCharacter.GetDownedTransitionMontage
	float GetDownedImmuneTime(); // Function Killstreak.KSCharacter.GetDownedImmuneTime
	enum class ECameraShoulder GetDesiredCameraShoulder(); // Function Killstreak.KSCharacter.GetDesiredCameraShoulder
	struct UKSVehicleSeatComponent* GetCurrentVehicleSeat(); // Function Killstreak.KSCharacter.GetCurrentVehicleSeat
	struct AKSVehicle* GetCurrentVehicle(); // Function Killstreak.KSCharacter.GetCurrentVehicle
	void GetCurrentReviveDuration(float Duration, float RemainingTime); // Function Killstreak.KSCharacter.GetCurrentReviveDuration
	struct FName GetCurrentCharacterEmotionAsName(); // Function Killstreak.KSCharacter.GetCurrentCharacterEmotionAsName
	enum class ECameraShoulder GetCurrentCameraShoulder(); // Function Killstreak.KSCharacter.GetCurrentCameraShoulder
	int32_t GetCurrentAbilityIndex(); // Function Killstreak.KSCharacter.GetCurrentAbilityIndex
	struct FGameplayTagContainer GetCompatibleEquipPoints(struct UKSWeaponAsset* InWeaponAsset); // Function Killstreak.KSCharacter.GetCompatibleEquipPoints
	struct UKSAkComponent* GetCharacterAkComponent(); // Function Killstreak.KSCharacter.GetCharacterAkComponent
	struct TScriptInterface<None> GetCarriedObject(); // Function Killstreak.KSCharacter.GetCarriedObject
	float GetCameraShoulderSwapProgress(); // Function Killstreak.KSCharacter.GetCameraShoulderSwapProgress
	struct UMultiSkinObject* GetBodyApparelSkinObject(); // Function Killstreak.KSCharacter.GetBodyApparelSkinObject
	enum class ECharacterBehaviorState GetBehaviorState(); // Function Killstreak.KSCharacter.GetBehaviorState
	float GetBasePickupRange(); // Function Killstreak.KSCharacter.GetBasePickupRange
	void GetAvailableEquipPoints(struct FGameplayTagContainer OutEquipPoints); // Function Killstreak.KSCharacter.GetAvailableEquipPoints
	float GetArmorDurability(); // Function Killstreak.KSCharacter.GetArmorDurability
	struct UMultiSkinObject* GetApparelSkinObjectByName(struct FName InSkinObjectName); // Function Killstreak.KSCharacter.GetApparelSkinObjectByName
	int32_t GetAmmoCount(enum class EAmmoType AmmoType); // Function Killstreak.KSCharacter.GetAmmoCount
	void GetAllEquippedWeapons(struct TArray<struct AKSWeapon*> OutWeapons); // Function Killstreak.KSCharacter.GetAllEquippedWeapons
	struct UKSWeaponComponent* GetActiveWeaponComponentForSubType(struct FName SubType); // Function Killstreak.KSCharacter.GetActiveWeaponComponentForSubType
	struct UKSWeaponComponent* GetActiveWeaponComponentAtIndex(int32_t Index); // Function Killstreak.KSCharacter.GetActiveWeaponComponentAtIndex
	struct UKSWeaponComponent* GetActiveWeaponComponent(); // Function Killstreak.KSCharacter.GetActiveWeaponComponent
	struct AKSWeapon* GetActiveWeapon(); // Function Killstreak.KSCharacter.GetActiveWeapon
	struct AKSWeapon* GetActiveTemporary(); // Function Killstreak.KSCharacter.GetActiveTemporary
	bool GetActiveMods(struct TArray<struct UKSPlayerMod*> OutMods); // Function Killstreak.KSCharacter.GetActiveMods
	struct AKSWeapon* GetActiveMelee(); // Function Killstreak.KSCharacter.GetActiveMelee
	struct AKSWeapon* GetActiveMedPack(); // Function Killstreak.KSCharacter.GetActiveMedPack
	struct AKSWeapon* GetActiveMainWeapon(); // Function Killstreak.KSCharacter.GetActiveMainWeapon
	struct UKSWeaponAnimInstance* GetActiveKSWeaponAnimInst(int32_t Index); // Function Killstreak.KSCharacter.GetActiveKSWeaponAnimInst
	struct AKSWeapon* GetActiveGrenade(); // Function Killstreak.KSCharacter.GetActiveGrenade
	struct FGameplayTagContainer GetActiveGadgetPoints(); // Function Killstreak.KSCharacter.GetActiveGadgetPoints
	struct FGameplayTagContainer GetActiveEquipPoints(); // Function Killstreak.KSCharacter.GetActiveEquipPoints
	struct FName GetActiveCameraTag(); // Function Killstreak.KSCharacter.GetActiveCameraTag
	struct UCameraComponent* GetActiveCamera(); // Function Killstreak.KSCharacter.GetActiveCamera
	struct AKSWeapon_Aimed* GetActiveAimedWeapon(); // Function Killstreak.KSCharacter.GetActiveAimedWeapon
	bool GetActivatableMods(struct TArray<struct UKSModInst_Activated*> OutMods); // Function Killstreak.KSCharacter.GetActivatableMods
	struct UKSModInst_Activated* GetAbilityMovementMod(); // Function Killstreak.KSCharacter.GetAbilityMovementMod
	void GamepadToggleSprint(); // Function Killstreak.KSCharacter.GamepadToggleSprint
	void GamepadSwapPressed(); // Function Killstreak.KSCharacter.GamepadSwapPressed
	void GamepadSwapMeleePressed(); // Function Killstreak.KSCharacter.GamepadSwapMeleePressed
	void GamepadSwapMacGuffinPressed(); // Function Killstreak.KSCharacter.GamepadSwapMacGuffinPressed
	void GamepadLookUp(float Value); // Function Killstreak.KSCharacter.GamepadLookUp
	void GamepadLookRight(float Value); // Function Killstreak.KSCharacter.GamepadLookRight
	void ForceToShoulder(enum class ECameraShoulder ForcedShoulder); // Function Killstreak.KSCharacter.ForceToShoulder
	void ForceMainCameraBoomUpdate(); // Function Killstreak.KSCharacter.ForceMainCameraBoomUpdate
	void FinishHacking(); // Function Killstreak.KSCharacter.FinishHacking
	int32_t FindTierOfEquipPoint(struct FGameplayTag EquipPoint); // Function Killstreak.KSCharacter.FindTierOfEquipPoint
	struct TArray<int32_t> FindAllTiersOfEquipPoint(struct FGameplayTag EquipPoint); // Function Killstreak.KSCharacter.FindAllTiersOfEquipPoint
	void ExtinguishFire(); // Function Killstreak.KSCharacter.ExtinguishFire
	void ExitVehiclePressed(); // Function Killstreak.KSCharacter.ExitVehiclePressed
	void EventSetupCamerasForSpectator(bool Enabled); // Function Killstreak.KSCharacter.EventSetupCamerasForSpectator
	void EvaluateCameraProximityFade(); // Function Killstreak.KSCharacter.EvaluateCameraProximityFade
	void EndOutOfBounds(); // Function Killstreak.KSCharacter.EndOutOfBounds
	void EndLockoutCamera(); // Function Killstreak.KSCharacter.EndLockoutCamera
	void DrownDamageTick(); // Function Killstreak.KSCharacter.DrownDamageTick
	void DropButtonReleased(); // Function Killstreak.KSCharacter.DropButtonReleased
	void DropButtonPressed(); // Function Killstreak.KSCharacter.DropButtonPressed
	void DropActiveWeapon(); // Function Killstreak.KSCharacter.DropActiveWeapon
	void DropActiveGrenade(); // Function Killstreak.KSCharacter.DropActiveGrenade
	void DownPlayer(struct AController* EventInstigator, struct UDamageType* DamageType, enum class EHitLocationType HitLocationType, struct AActor* DamageCauser, float DamageDealt); // Function Killstreak.KSCharacter.DownPlayer
	void DoSetOnFire(); // Function Killstreak.KSCharacter.DoSetOnFire
	void DoExtinguishFire(); // Function Killstreak.KSCharacter.DoExtinguishFire
	bool DoesTransitionSupportFocalPoint(struct FName ActiveCamera, struct FName PendingCamera); // Function Killstreak.KSCharacter.DoesTransitionSupportFocalPoint
	void DetachViewTargetOnlyBPComponents(); // Function Killstreak.KSCharacter.DetachViewTargetOnlyBPComponents
	void DestructibleSpeedGateOverlappedEvent(struct FVector BreakingLocation, struct FVector BreakingDirection, struct FVector BreakingNormal); // Function Killstreak.KSCharacter.DestructibleSpeedGateOverlappedEvent
	void DamageRecordReset(); // Function Killstreak.KSCharacter.DamageRecordReset
	void CreditEliminationAssist(struct APlayerState* Assistant); // Function Killstreak.KSCharacter.CreditEliminationAssist
	void CreditDownAssist(struct APlayerState* Assistant); // Function Killstreak.KSCharacter.CreditDownAssist
	void ContextualPingRepeat(); // Function Killstreak.KSCharacter.ContextualPingRepeat
	void ContextualPingPressed(); // Function Killstreak.KSCharacter.ContextualPingPressed
	void ContextualPingHoldRelease(); // Function Killstreak.KSCharacter.ContextualPingHoldRelease
	void ContextualPingHold(); // Function Killstreak.KSCharacter.ContextualPingHold
	void ContextualButtonReleased(); // Function Killstreak.KSCharacter.ContextualButtonReleased
	void ContextualButtonPressed(); // Function Killstreak.KSCharacter.ContextualButtonPressed
	void ContextualButtonHeldReleased(); // Function Killstreak.KSCharacter.ContextualButtonHeldReleased
	void ContextualButtonHeld(); // Function Killstreak.KSCharacter.ContextualButtonHeld
	void CompleteNonCharacterRevive(); // Function Killstreak.KSCharacter.CompleteNonCharacterRevive
	void CloneCharacterMesh(struct USkeletalMeshComponent* ClonedMesh); // Function Killstreak.KSCharacter.CloneCharacterMesh
	void ClientSwapTo(struct AKSWeapon* InWeapon); // Function Killstreak.KSCharacter.ClientSwapTo
	void ClientSwapFrom(struct AKSWeapon* InWeapon); // Function Killstreak.KSCharacter.ClientSwapFrom
	void ClientStopInteractAcknowledge(char InInteractRequestId, enum class EKSInteractionResult Result); // Function Killstreak.KSCharacter.ClientStopInteractAcknowledge
	void ClientNotifyStuck(); // Function Killstreak.KSCharacter.ClientNotifyStuck
	void ClientInteractAcknowledge(char InInteractRequestId, bool bFailed, float InteractDuration, bool bRequiresManualInterrupt); // Function Killstreak.KSCharacter.ClientInteractAcknowledge
	void ClientBroadcastModEvent(struct FName ModEvent); // Function Killstreak.KSCharacter.ClientBroadcastModEvent
	void ClearMaxHealthBonus(); // Function Killstreak.KSCharacter.ClearMaxHealthBonus
	void ClearAllApparel(); // Function Killstreak.KSCharacter.ClearAllApparel
	void ClearActorTargetingMeForRevive(); // Function Killstreak.KSCharacter.ClearActorTargetingMeForRevive
	void ChangeShoulderCamera(enum class ECameraShoulder InShoulder); // Function Killstreak.KSCharacter.ChangeShoulderCamera
	bool CanInteractWithTest(struct AActor* InInteractionTarget, bool bPress, bool bHold); // Function Killstreak.KSCharacter.CanInteractWithTest
	bool CanInteractWith(struct AActor* InInteractionTarget); // Function Killstreak.KSCharacter.CanInteractWith
	bool CanGiveUp(); // Function Killstreak.KSCharacter.CanGiveUp
	bool CanFireRightNow(enum class EKSAbilityUsageFailureType OutAbilityFailureType, bool bAltFire, bool bIgnoreNoFire); // Function Killstreak.KSCharacter.CanFireRightNow
	bool CanFireGrenadeNow(bool bBroadcastFeedback); // Function Killstreak.KSCharacter.CanFireGrenadeNow
	void CancelBleed(); // Function Killstreak.KSCharacter.CancelBleed
	bool CanCarryDownedAllies(); // Function Killstreak.KSCharacter.CanCarryDownedAllies
	bool CanBeRevivedBy(struct AKSCharacter* Other, bool bIgnoreOverlap, struct AKSWeapon* IgnoredWeapon); // Function Killstreak.KSCharacter.CanBeRevivedBy
	bool CanAimOverShoulderNow(); // Function Killstreak.KSCharacter.CanAimOverShoulderNow
	bool CanAimDownSightsNow(); // Function Killstreak.KSCharacter.CanAimDownSightsNow
	bool CanAimAlternateNow(); // Function Killstreak.KSCharacter.CanAimAlternateNow
	bool CanActiveWeaponCanToggleOutOfAimDownSightsNow(); // Function Killstreak.KSCharacter.CanActiveWeaponCanToggleOutOfAimDownSightsNow
	bool CanActiveWeaponCanToggleIntoAimDownSightsNow(); // Function Killstreak.KSCharacter.CanActiveWeaponCanToggleIntoAimDownSightsNow
	bool CanActivateAbilityNow(struct UKSModInst_Activated* Mod, bool bBroadcastFeedback); // Function Killstreak.KSCharacter.CanActivateAbilityNow
	void CacheLatestHit(float Damage, struct UDamageType* DamageTypeClass, float DamageImpulse, struct FVector RelativeImpactLocation, struct FName BoneName, struct AActor* DamageCauser); // Function Killstreak.KSCharacter.CacheLatestHit
	void BroadcastWeaponComponentStateChange(uint32_t BroadcastId, uint16_t nEquipmentId, struct FKSWeaponDataUpdateContainer NewState); // Function Killstreak.KSCharacter.BroadcastWeaponComponentStateChange
	void BroadcastWeaponComponentPostReload(uint32_t BroadcastId, uint16_t nEquipmentId, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastWeaponComponentPostReload
	void BroadcastWeaponComponentFiredFull(uint32_t BroadcastId, uint16_t nEquipmentId, struct FFullFireRepData Data); // Function Killstreak.KSCharacter.BroadcastWeaponComponentFiredFull
	void BroadcastWeaponComponentFiredAmmo(uint32_t BroadcastId, uint16_t nEquipmentId, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastWeaponComponentFiredAmmo
	void BroadcastWeaponComponentFiredAimAndAmmo(uint32_t BroadcastId, uint16_t nEquipmentId, struct FAimData Aim, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastWeaponComponentFiredAimAndAmmo
	void BroadcastWeaponComponentFired(uint32_t BroadcastId, uint16_t nEquipmentId, struct FAimData Aim); // Function Killstreak.KSCharacter.BroadcastWeaponComponentFired
	void BroadcastWeaponComponentEmptyFire(uint32_t BroadcastId, uint16_t nEquipmentId); // Function Killstreak.KSCharacter.BroadcastWeaponComponentEmptyFire
	void BroadcastWeaponComponentAmmoChange(uint32_t BroadcastId, uint16_t nEquipmentId, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastWeaponComponentAmmoChange
	void BroadcastTakeRadialDamage(struct FDamageEffect Effect); // Function Killstreak.KSCharacter.BroadcastTakeRadialDamage
	void BroadcastTakePointDamage(struct FDamageEffect Effect); // Function Killstreak.KSCharacter.BroadcastTakePointDamage
	void BroadcastSpecialAmmoEvent(enum class EAmmoType AmmoType, int32_t AmmoDelta, struct FName EventName); // Function Killstreak.KSCharacter.BroadcastSpecialAmmoEvent
	void BroadcastSkydiveSkipped(); // Function Killstreak.KSCharacter.BroadcastSkydiveSkipped
	void BroadcastReviveStart(struct AKSCharacter* Reviver, float ReviveTime, bool Remote); // Function Killstreak.KSCharacter.BroadcastReviveStart
	void BroadcastReviveInterrupt(struct AKSCharacter* Reviver); // Function Killstreak.KSCharacter.BroadcastReviveInterrupt
	void BroadcastReviveComplete(struct AKSCharacter* Reviver); // Function Killstreak.KSCharacter.BroadcastReviveComplete
	void BroadcastReliableWeaponComponentStateChange(uint32_t BroadcastId, uint16_t nEquipmentId, struct FKSWeaponDataUpdateContainer NewState); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentStateChange
	void BroadcastReliableWeaponComponentPostReload(uint32_t BroadcastId, uint16_t nEquipmentId, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentPostReload
	void BroadcastReliableWeaponComponentFiredFull(uint32_t BroadcastId, uint16_t nEquipmentId, struct FFullFireRepData Data); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentFiredFull
	void BroadcastReliableWeaponComponentFiredAmmo(uint32_t BroadcastId, uint16_t nEquipmentId, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentFiredAmmo
	void BroadcastReliableWeaponComponentFiredAimAndAmmo(uint32_t BroadcastId, uint16_t nEquipmentId, struct FAimData Aim, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentFiredAimAndAmmo
	void BroadcastReliableWeaponComponentFired(uint32_t BroadcastId, uint16_t nEquipmentId, struct FAimData Aim); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentFired
	void BroadcastReliableWeaponComponentEmptyFire(uint32_t BroadcastId, uint16_t nEquipmentId); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentEmptyFire
	void BroadcastReliableWeaponComponentAmmoChange(uint32_t BroadcastId, uint16_t nEquipmentId, char AmmoInClip); // Function Killstreak.KSCharacter.BroadcastReliableWeaponComponentAmmoChange
	void BroadcastModEvent(struct FName ModEvent); // Function Killstreak.KSCharacter.BroadcastModEvent
	void BroadcastGrenadeExplodeInHand(struct UKSWeaponAsset_Grenade* pGrenadeWeaponAsset); // Function Killstreak.KSCharacter.BroadcastGrenadeExplodeInHand
	void BroadcastArmorRegenerationInterrupt(); // Function Killstreak.KSCharacter.BroadcastArmorRegenerationInterrupt
	void BroadcastArmorRegenerationComplete(); // Function Killstreak.KSCharacter.BroadcastArmorRegenerationComplete
	void BroadcastArmorInteractStart(float InteractTime); // Function Killstreak.KSCharacter.BroadcastArmorInteractStart
	void BroadcastArmorInteractInterrupt(); // Function Killstreak.KSCharacter.BroadcastArmorInteractInterrupt
	void BroadcastArmorInteractComplete(float RegenerationTime); // Function Killstreak.KSCharacter.BroadcastArmorInteractComplete
	bool BlueprintHandleDeath(); // Function Killstreak.KSCharacter.BlueprintHandleDeath
	void BeginOutOfBounds(float WarningLength); // Function Killstreak.KSCharacter.BeginOutOfBounds
	void BeginNonCharacterRevive(struct AKSPlayerState* ReviveInstigator, float Duration, struct FName OverrideReviveeMontage); // Function Killstreak.KSCharacter.BeginNonCharacterRevive
	void BeginInstantRevive(struct AKSCharacter* Reviver, float Duration, bool Guaranteed); // Function Killstreak.KSCharacter.BeginInstantRevive
	void AutoSprintTimerComplete(); // Function Killstreak.KSCharacter.AutoSprintTimerComplete
	void AttachViewTargetOnlyBPComponents(); // Function Killstreak.KSCharacter.AttachViewTargetOnlyBPComponents
	void ApplyMaxHealthBonus(float Bonus, struct AController* EventInstigator, struct AActor* EventCauser); // Function Killstreak.KSCharacter.ApplyMaxHealthBonus
	void ApplyLastHitImpulse(bool UpdateTargetRotation, bool AffectCapsule); // Function Killstreak.KSCharacter.ApplyLastHitImpulse
	void ApplyFlinchFromPointDamage(float Damage, struct UDamageType* DamageTypeClass, struct FVector RelativeImpactLocation, struct FVector RelativeImpactNormal, struct FName BoneName, struct AActor* DamageCauser); // Function Killstreak.KSCharacter.ApplyFlinchFromPointDamage
	void ApplyCameraProximityFade(float Alpha); // Function Killstreak.KSCharacter.ApplyCameraProximityFade
	bool ApplyApparelAsset(struct UKSApparelAsset* ApparelAsset); // Function Killstreak.KSCharacter.ApplyApparelAsset
	bool AnyActivatableModsActive(); // Function Killstreak.KSCharacter.AnyActivatableModsActive
	void AnimAuditStop(); // Function Killstreak.KSCharacter.AnimAuditStop
	void AnimAuditStart(); // Function Killstreak.KSCharacter.AnimAuditStart
	void AnimAuditResume(); // Function Killstreak.KSCharacter.AnimAuditResume
	void AnimAuditClear(); // Function Killstreak.KSCharacter.AnimAuditClear
	void AimDownSightsToggle(); // Function Killstreak.KSCharacter.AimDownSightsToggle
	void AimDownSightsReleased(); // Function Killstreak.KSCharacter.AimDownSightsReleased
	void AimDownSightsPressed(); // Function Killstreak.KSCharacter.AimDownSightsPressed
	void AddSkinTag(struct FGameplayTag InSkinTag); // Function Killstreak.KSCharacter.AddSkinTag
	struct TArray<struct UParticleSystemComponent*> AddParticleEffects(struct TArray<struct FKSParticleSystemAttachment> ParticleSystemAttachments); // Function Killstreak.KSCharacter.AddParticleEffects
	void AddOutOfRangePickup(struct AActor* OtherActor, float PickupDistance); // Function Killstreak.KSCharacter.AddOutOfRangePickup
	void AddOrUpdateBlendable(struct TScriptInterface<None> InBlendableObject, float InWeight); // Function Killstreak.KSCharacter.AddOrUpdateBlendable
	int32_t AddActionRestrictionForDuration(struct FKSActionRestrictor ActionRestrictor, float Duration); // Function Killstreak.KSCharacter.AddActionRestrictionForDuration
	int32_t AddActionRestriction(struct FKSActionRestrictor ActionRestrictor); // Function Killstreak.KSCharacter.AddActionRestriction
	bool ActivatableModAtIndexActive(int32_t AbilityIndex); // Function Killstreak.KSCharacter.ActivatableModAtIndexActive
	void AbortFireAllWeapons(); // Function Killstreak.KSCharacter.AbortFireAllWeapons
	void AbilityChargeUpdated(struct UKSPlayerMod_Activated* ChargingMod); // Function Killstreak.KSCharacter.AbilityChargeUpdated
	void AbilityActivated(int32_t AbilityIndex); // Function Killstreak.KSCharacter.AbilityActivated
};

// Class Killstreak.KSCharacterAnimInst
// Size: 0x1010 (Inherited: 0x290)
struct UKSCharacterAnimInst : public UKSAnimInstance {
	bool bEmoteMontagePlayingGlobal; // 0x290(0x01)
	bool bEmoteMontagePlayingLocal; // 0x291(0x01)
	char UnknownData_292[0x2]; // 0x292(0x02)
	struct FName EmoteSlotName; // 0x294(0x08)
	float EmoteFastBlendMultiplier; // 0x29c(0x04)
	float EmoteSlowBlendMultiplier; // 0x2a0(0x04)
	bool bSprayIsPlaying; // 0x2a4(0x01)
	char UnknownData_2A5[0x3]; // 0x2a5(0x03)
	int32_t CurrentMeshLOD; // 0x2a8(0x04)
	float Speed; // 0x2ac(0x04)
	float SpeedXY; // 0x2b0(0x04)
	float SpeedZ; // 0x2b4(0x04)
	float Forward; // 0x2b8(0x04)
	float Right; // 0x2bc(0x04)
	float BodyLean; // 0x2c0(0x04)
	struct FRotator BodyLeanRotator; // 0x2c4(0x0c)
	struct FRotator HeadLeanRotator; // 0x2d0(0x0c)
	bool bEnableAnimMirroring; // 0x2dc(0x01)
	char UnknownData_2DD[0x3]; // 0x2dd(0x03)
	char bCanTransitionDirections : 1; // 0x2e0(0x01)
	char UnknownData_2E0_1 : 7; // 0x2e0(0x01)
	char UnknownData_2E1[0x3]; // 0x2e1(0x03)
	bool bEnableMovementImprovements; // 0x2e4(0x01)
	bool bEnableDynamicLobbyPose; // 0x2e5(0x01)
	char UnknownData_2E6[0x2]; // 0x2e6(0x02)
	float SprintImpulseAmount; // 0x2e8(0x04)
	struct FVector2D SprintLeftRightBodyLeanRange; // 0x2ec(0x08)
	float ForwardRotate; // 0x2f4(0x04)
	float RightRotate; // 0x2f8(0x04)
	float BackRotate; // 0x2fc(0x04)
	float LeftRotate; // 0x300(0x04)
	float ForwardRotatePostMirror; // 0x304(0x04)
	float RightRotatePostMirror; // 0x308(0x04)
	float BackRotatePostMirror; // 0x30c(0x04)
	float LeftRotatePostMirror; // 0x310(0x04)
	struct FVector ForwardCrouchPelvicVector; // 0x314(0x0c)
	struct FVector ForwardCrouchFeetIKVector; // 0x320(0x0c)
	struct FVector BackCrouchPelvicVector; // 0x32c(0x0c)
	struct FVector BackCrouchFeetIKVector; // 0x338(0x0c)
	struct FVector LeftCrouchPelvicVector; // 0x344(0x0c)
	struct FVector LeftCrouchFeetIKVector; // 0x350(0x0c)
	struct FVector RightCrouchPelvicVector; // 0x35c(0x0c)
	struct FVector RightCrouchFeetIKVector; // 0x368(0x0c)
	float ForwardCrouchPelvicOffset; // 0x374(0x04)
	float ForwardCrouchFeetIKOffset; // 0x378(0x04)
	float BackCrouchPelvicOffset; // 0x37c(0x04)
	float BackCrouchFeetIKOffset; // 0x380(0x04)
	float LeftCrouchPelvicOffset; // 0x384(0x04)
	float LeftCrouchFeetIKOffset; // 0x388(0x04)
	float RightCrouchPelvicOffset; // 0x38c(0x04)
	float RightCrouchFeetIKOffset; // 0x390(0x04)
	float CurrentAccelVectorLength; // 0x394(0x04)
	float MaxSlowWalkSpeed; // 0x398(0x04)
	float MaxWalkSpeed; // 0x39c(0x04)
	float MaxADSWalkSpeed; // 0x3a0(0x04)
	float MaxSprintSpeed; // 0x3a4(0x04)
	float MaxCrouchSpeed; // 0x3a8(0x04)
	float MaxADSCrouchSpeed; // 0x3ac(0x04)
	char bShouldTransitionADSCrouch : 1; // 0x3b0(0x01)
	char UnknownData_3B0_1 : 7; // 0x3b0(0x01)
	char UnknownData_3B1[0x3]; // 0x3b1(0x03)
	float CurSpeedFraction; // 0x3b4(0x04)
	float CurMaxSpeed; // 0x3b8(0x04)
	float CurSpeedScaling; // 0x3bc(0x04)
	bool bDoCheckFirstStepCurve; // 0x3c0(0x01)
	char UnknownData_3C1[0x3]; // 0x3c1(0x03)
	float FirstStepTransitionAlpha; // 0x3c4(0x04)
	float SpeedWarpingAlpha; // 0x3c8(0x04)
	float ParachuteMovementPitch; // 0x3cc(0x04)
	float ParachuteMovementYaw; // 0x3d0(0x04)
	float ParachuteMovementForward; // 0x3d4(0x04)
	float ParachuteMovementLateral; // 0x3d8(0x04)
	bool bSkydiveTurnOverridesStrafe; // 0x3dc(0x01)
	bool bIsNoseDiving; // 0x3dd(0x01)
	char UnknownData_3DE[0x2]; // 0x3de(0x02)
	float ParachuteYawInterpSpeed; // 0x3e0(0x04)
	float ParachutePitchInterpSpeed; // 0x3e4(0x04)
	float ParachuteForwardInterpSpeed; // 0x3e8(0x04)
	float ParachuteLateralInterpSpeed; // 0x3ec(0x04)
	float ParachuteForwardThreshold; // 0x3f0(0x04)
	bool bParachuteReady; // 0x3f4(0x01)
	char UnknownData_3F5[0x3]; // 0x3f5(0x03)
	float ParachuteYawRotationFactor; // 0x3f8(0x04)
	struct FVector LastFreeFallMovementVector; // 0x3fc(0x0c)
	struct FFloatHitSpringState HitSpringRollState; // 0x408(0x08)
	struct FFloatHitSpringState HitSpringPitchState; // 0x410(0x08)
	struct FFloatHitSpringState HitSpringYawState; // 0x418(0x08)
	float HitRotationAmountRoll; // 0x420(0x04)
	float HitRotationAmountPitch; // 0x424(0x04)
	float HitRotationAmountYaw; // 0x428(0x04)
	float HitRotationPitchMax; // 0x42c(0x04)
	float HitRotationRollMax; // 0x430(0x04)
	float HitRotationYawMax; // 0x434(0x04)
	struct FVector PelvisHitOffset; // 0x438(0x0c)
	struct FRotator SpineHitOffset; // 0x444(0x0c)
	struct FRotator NeckHitOffset; // 0x450(0x0c)
	struct FRotator ArmHitOffset; // 0x45c(0x0c)
	struct TArray<struct FHitReaction> QueuedHits; // 0x468(0x10)
	struct UCurveVector* HitReactionTimeScale; // 0x478(0x08)
	struct UCurveFloat* HitReactionDamageScale; // 0x480(0x08)
	float ADSHitReactionBlend; // 0x488(0x04)
	float AOSHitReactionBlend; // 0x48c(0x04)
	float HipfireHitReactionBlend; // 0x490(0x04)
	float SimClientHitReactionBlend; // 0x494(0x04)
	float CurrentHitReactionBlend; // 0x498(0x04)
	float SpineFireRotationLimit; // 0x49c(0x04)
	float NeckFireRotationLimit; // 0x4a0(0x04)
	float ClavicleFireRotationLimit; // 0x4a4(0x04)
	float UpperArmFireRotationPitchLimit; // 0x4a8(0x04)
	float UpperArmFireRotationYawLimit; // 0x4ac(0x04)
	float ForearmFireRotationLimit; // 0x4b0(0x04)
	struct FFloatHitSpringState SpineFireSpringState; // 0x4b4(0x08)
	struct FFloatHitSpringState NeckFireSpringState; // 0x4bc(0x08)
	struct FFloatHitSpringState ClavicleFireSpringState; // 0x4c4(0x08)
	struct FFloatHitSpringState UpperArmFireSpringState; // 0x4cc(0x08)
	struct FFloatHitSpringState UpperArmFireYawSpringState; // 0x4d4(0x08)
	struct FFloatHitSpringState ForearmFireSpringState; // 0x4dc(0x08)
	float SpineFireRotationAmountPitch; // 0x4e4(0x04)
	float NeckFireRotationAmountPitch; // 0x4e8(0x04)
	float ClavicleFireRotationAmountYaw; // 0x4ec(0x04)
	float UpperArmFireRotationAmountPitch; // 0x4f0(0x04)
	float UpperArmFireRotationAmountYaw; // 0x4f4(0x04)
	float ForarmFireRotationAmountPitch; // 0x4f8(0x04)
	struct FRotator SpineFireOffset; // 0x4fc(0x0c)
	struct FRotator NeckFireOffset; // 0x508(0x0c)
	struct FRotator ClavicleFireOffset; // 0x514(0x0c)
	struct FRotator UpperArmFireOffset; // 0x520(0x0c)
	struct FRotator ForearmFireOffset; // 0x52c(0x0c)
	float WeaponFireAlpha; // 0x538(0x04)
	float WeaponAdditiveAlpha; // 0x53c(0x04)
	struct FRecoilProfile CurrentRecoilProfile; // 0x540(0x1ec)
	int32_t FireImpulseCounter; // 0x72c(0x04)
	bool bIsRecoiling; // 0x730(0x01)
	bool bBypassRecoiling; // 0x731(0x01)
	char UnknownData_732[0x6]; // 0x732(0x06)
	struct TMap<struct FName, struct UKSCharacterAnimInst*> SubAnimInstances; // 0x738(0x50)
	bool bCanSwitchStartAnim; // 0x788(0x01)
	bool bTriggerCustomPivot; // 0x789(0x01)
	bool bActionDisablesLeftHandIKAlpha; // 0x78a(0x01)
	bool bActionDisablesRightHandIKAlpha; // 0x78b(0x01)
	bool bActionDisablesLeftHandGripOnly; // 0x78c(0x01)
	bool bActionDisablesRightHandGripOnly; // 0x78d(0x01)
	bool bForceDisableLHIK; // 0x78e(0x01)
	bool bForceDisableRHIK; // 0x78f(0x01)
	float ADSRollValue; // 0x790(0x04)
	struct FVector ADSBumpValue; // 0x794(0x0c)
	bool bWantsNonComOffset; // 0x7a0(0x01)
	bool bIsWeaponNonComOffset; // 0x7a1(0x01)
	bool bSkinUseNonComOffset; // 0x7a2(0x01)
	char UnknownData_7A3[0x1]; // 0x7a3(0x01)
	float EngHeadAdditiveAlpha; // 0x7a4(0x04)
	bool bTestGadgetAdditive; // 0x7a8(0x01)
	char UnknownData_7A9[0x3]; // 0x7a9(0x03)
	float LeftHandIKAlpha; // 0x7ac(0x04)
	float LeftHandIKAlphaTarget; // 0x7b0(0x04)
	float RightHandIKAlpha; // 0x7b4(0x04)
	float RightHandIKAlphaTarget; // 0x7b8(0x04)
	float UplineIKAlpha; // 0x7bc(0x04)
	float UplineIKAlphaTarget; // 0x7c0(0x04)
	int32_t NextLeftHandIKForceRequestId; // 0x7c4(0x04)
	bool bLeftHandIKForceOffFromRequests; // 0x7c8(0x01)
	char UnknownData_7C9[0x7]; // 0x7c9(0x07)
	struct TSet<int32_t> LeftHandIkForceOffRequests; // 0x7d0(0x50)
	bool bLeftHandIKOffFromMainInstNotifyStates; // 0x820(0x01)
	char UnknownData_821[0x57]; // 0x821(0x57)
	float FootIKAlpha; // 0x878(0x04)
	float FootIKAlphaTarget; // 0x87c(0x04)
	struct FMulticastInlineDelegate OnBeginZipline; // 0x880(0x10)
	struct FMulticastInlineDelegate OnEndZipline; // 0x890(0x10)
	struct FVector ZiplineRootOffset; // 0x8a0(0x0c)
	struct FVector AppliedADSRootTranslation; // 0x8ac(0x0c)
	struct FVector DefaultADSRootTranslation; // 0x8b8(0x0c)
	bool ApplyAimstoZiplineMontage; // 0x8c4(0x01)
	bool ZiplineMontageLHIKOverride; // 0x8c5(0x01)
	char UnknownData_8C6[0x2]; // 0x8c6(0x02)
	float ZiplineMontageLHIKAlpha; // 0x8c8(0x04)
	bool ActionPreventsZiplineIntro; // 0x8cc(0x01)
	bool ShieldIsActive; // 0x8cd(0x01)
	char UnknownData_8CE[0x2]; // 0x8ce(0x02)
	struct FVector2D ForwardRotateInputRange; // 0x8d0(0x08)
	struct FVector2D ForwardRotateOutputRange; // 0x8d8(0x08)
	struct FVector2D RightRotateInputRange; // 0x8e0(0x08)
	struct FVector2D RightRotateOutputRange; // 0x8e8(0x08)
	enum class EKSMovementDirection MovementDirection; // 0x8f0(0x01)
	enum class EKSMovementDirection LocomotionStartDirection; // 0x8f1(0x01)
	enum class EKSMovementDirection LocomotionStopDirection; // 0x8f2(0x01)
	enum class EKSMovementDirection LocomotionPivotDirection; // 0x8f3(0x01)
	float MovementDirectionRotate; // 0x8f4(0x04)
	float MovementDirectionRotateOnStartOrStop; // 0x8f8(0x04)
	float DirectionBlendSpeed; // 0x8fc(0x04)
	char UnknownData_900[0x4]; // 0x900(0x04)
	float DirectionChangedBlendSpeed; // 0x904(0x04)
	bool bUseLimitedMovement; // 0x908(0x01)
	bool bEngUseLimitedMovement; // 0x909(0x01)
	bool bComUseLimitedMovement; // 0x90a(0x01)
	bool bNonComUseLimitedMovement; // 0x90b(0x01)
	char bZeroVelocity : 1; // 0x90c(0x01)
	char bZeroAcceleration : 1; // 0x90c(0x01)
	char bJumping : 1; // 0x90c(0x01)
	char bWasJumping : 1; // 0x90c(0x01)
	char UnknownData_90C_4 : 4; // 0x90c(0x01)
	char UnknownData_90D[0x3]; // 0x90d(0x03)
	bool bDisableUpperBodyLands; // 0x910(0x01)
	char UnknownData_911[0x3]; // 0x911(0x03)
	char bFalling : 1; // 0x914(0x01)
	char bInFreeFall : 1; // 0x914(0x01)
	char bInWingSuit : 1; // 0x914(0x01)
	char bReadyForFreeFall : 1; // 0x914(0x01)
	char bVaulting : 1; // 0x914(0x01)
	char bIsMantling : 1; // 0x914(0x01)
	char bMantleIsVault : 1; // 0x914(0x01)
	char UnknownData_915[0x3]; // 0x915(0x03)
	float TotalVaultDuration; // 0x918(0x04)
	char UnknownData_91C[0x4]; // 0x91c(0x04)
	struct UAnimSequence* CurrentMantleSequence; // 0x920(0x08)
