// BlueprintGeneratedClass KSCameraManager.KSCameraManager_C
// Size: 0x28e0 (Inherited: 0x2770)
struct AKSCameraManager_C : public AKSPlayerCameraManager {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x2770(0x08)
	struct FVector Vault_Medium_Running_Rotation_19357AD44276670DB6B495B6695BBF6C; // 0x2778(0x0c)
	struct FVector Vault_Medium_Running_Location_19357AD44276670DB6B495B6695BBF6C; // 0x2784(0x0c)
	float Vault_Medium_Running_FOV_19357AD44276670DB6B495B6695BBF6C; // 0x2790(0x04)
	char Vault_Medium_Running__Direction_19357AD44276670DB6B495B6695BBF6C; // 0x2794(0x01)
	char UnknownData_2795[0x3]; // 0x2795(0x03)
	struct UTimelineComponent* Vault_Medium_Running; // 0x2798(0x08)
	struct FVector Vault_Short_Rotation_F73D9F61446F5474502BD8BF3252D762; // 0x27a0(0x0c)
	struct FVector Vault_Short_Location_F73D9F61446F5474502BD8BF3252D762; // 0x27ac(0x0c)
	float Vault_Short_FOV_F73D9F61446F5474502BD8BF3252D762; // 0x27b8(0x04)
	char Vault_Short__Direction_F73D9F61446F5474502BD8BF3252D762; // 0x27bc(0x01)
	char UnknownData_27BD[0x3]; // 0x27bd(0x03)
	struct UTimelineComponent* Vault_Short; // 0x27c0(0x08)
	struct FVector Vault_Medium_Rotation_973BB77943BEA34D1A27C0A9070CFD1F; // 0x27c8(0x0c)
	struct FVector Vault_Medium_Location_973BB77943BEA34D1A27C0A9070CFD1F; // 0x27d4(0x0c)
	float Vault_Medium_FOV_973BB77943BEA34D1A27C0A9070CFD1F; // 0x27e0(0x04)
	char Vault_Medium__Direction_973BB77943BEA34D1A27C0A9070CFD1F; // 0x27e4(0x01)
	char UnknownData_27E5[0x3]; // 0x27e5(0x03)
	struct UTimelineComponent* Vault_Medium; // 0x27e8(0x08)
	struct FVector Vault_Tall_Rotation_7F94194A49D4BE17D3B299B0FF993F6D; // 0x27f0(0x0c)
	struct FVector Vault_Tall_Location_7F94194A49D4BE17D3B299B0FF993F6D; // 0x27fc(0x0c)
	float Vault_Tall_FOV_7F94194A49D4BE17D3B299B0FF993F6D; // 0x2808(0x04)
	char Vault_Tall__Direction_7F94194A49D4BE17D3B299B0FF993F6D; // 0x280c(0x01)
	char UnknownData_280D[0x3]; // 0x280d(0x03)
	struct UTimelineComponent* Vault_Tall; // 0x2810(0x08)
	struct FVector Mantle_Short_Rotation_CF02379640077BEA8312A4A97CABFFE5; // 0x2818(0x0c)
	struct FVector Mantle_Short_Location_CF02379640077BEA8312A4A97CABFFE5; // 0x2824(0x0c)
	float Mantle_Short_FOV_CF02379640077BEA8312A4A97CABFFE5; // 0x2830(0x04)
	char Mantle_Short__Direction_CF02379640077BEA8312A4A97CABFFE5; // 0x2834(0x01)
	char UnknownData_2835[0x3]; // 0x2835(0x03)
	struct UTimelineComponent* Mantle_Short; // 0x2838(0x08)
	struct FVector Mantle_Medium_Rotation_BD9A8E7641CB9B707C1CE6BA8842B569; // 0x2840(0x0c)
	struct FVector Mantle_Medium_Location_BD9A8E7641CB9B707C1CE6BA8842B569; // 0x284c(0x0c)
	float Mantle_Medium_FOV_BD9A8E7641CB9B707C1CE6BA8842B569; // 0x2858(0x04)
	char Mantle_Medium__Direction_BD9A8E7641CB9B707C1CE6BA8842B569; // 0x285c(0x01)
	char UnknownData_285D[0x3]; // 0x285d(0x03)
	struct UTimelineComponent* Mantle_Medium; // 0x2860(0x08)
	struct FVector Mantle_Tall_Rotation_745F8D394D1BA4D0F0F12C9F36C8F1F2; // 0x2868(0x0c)
	struct FVector Mantle_Tall_Location_745F8D394D1BA4D0F0F12C9F36C8F1F2; // 0x2874(0x0c)
	float Mantle_Tall_FOV_745F8D394D1BA4D0F0F12C9F36C8F1F2; // 0x2880(0x04)
	char Mantle_Tall__Direction_745F8D394D1BA4D0F0F12C9F36C8F1F2; // 0x2884(0x01)
	char UnknownData_2885[0x3]; // 0x2885(0x03)
	struct UTimelineComponent* Mantle_Tall; // 0x2888(0x08)
	struct FVector JumpLanding_Rotation_F0A9B6BE484D0B52D2A1D2A14592B75A; // 0x2890(0x0c)
	struct FVector JumpLanding_Location_F0A9B6BE484D0B52D2A1D2A14592B75A; // 0x289c(0x0c)
	float JumpLanding_FOV_F0A9B6BE484D0B52D2A1D2A14592B75A; // 0x28a8(0x04)
	char JumpLanding__Direction_F0A9B6BE484D0B52D2A1D2A14592B75A; // 0x28ac(0x01)
	char UnknownData_28AD[0x3]; // 0x28ad(0x03)
	struct UTimelineComponent* JumpLanding; // 0x28b0(0x08)
	struct FVector JumpStart_Rotation_626F506A47DB820B20B53DBAEA84159F; // 0x28b8(0x0c)
	struct FVector JumpStart_Location_626F506A47DB820B20B53DBAEA84159F; // 0x28c4(0x0c)
	float JumpStart_FOV_626F506A47DB820B20B53DBAEA84159F; // 0x28d0(0x04)
	char JumpStart__Direction_626F506A47DB820B20B53DBAEA84159F; // 0x28d4(0x01)
	char UnknownData_28D5[0x3]; // 0x28d5(0x03)
	struct UTimelineComponent* JumpStart; // 0x28d8(0x08)

	void GetMantleHeightFromKSChar(bool NoMantleCamera); // Function KSCameraManager.KSCameraManager_C.GetMantleHeightFromKSChar
	void NotifyCamModFinished(struct UCameraModifier* Modifier Class); // Function KSCameraManager.KSCameraManager_C.NotifyCamModFinished
	void UpdateCamModValues(struct UCameraModifier* Modifier Class, struct FVector In Location, struct FVector In Rotation, float In FOV, bool Success); // Function KSCameraManager.KSCameraManager_C.UpdateCamModValues
	void JumpStart__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.JumpStart__FinishedFunc
	void JumpStart__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.JumpStart__UpdateFunc
	void JumpLanding__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.JumpLanding__FinishedFunc
	void JumpLanding__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.JumpLanding__UpdateFunc
	void Mantle_Tall__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Mantle_Tall__FinishedFunc
	void Mantle_Tall__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Mantle_Tall__UpdateFunc
	void Mantle_Medium__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Mantle_Medium__FinishedFunc
	void Mantle_Medium__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Mantle_Medium__UpdateFunc
	void Mantle_Short__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Mantle_Short__FinishedFunc
	void Mantle_Short__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Mantle_Short__UpdateFunc
	void Vault_Tall__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Tall__FinishedFunc
	void Vault_Tall__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Tall__UpdateFunc
	void Vault_Medium__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Medium__FinishedFunc
	void Vault_Medium__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Medium__UpdateFunc
	void Vault_Short__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Short__FinishedFunc
	void Vault_Short__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Short__UpdateFunc
	void Vault_Medium_Running__FinishedFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Medium_Running__FinishedFunc
	void Vault_Medium_Running__UpdateFunc(); // Function KSCameraManager.KSCameraManager_C.Vault_Medium_Running__UpdateFunc
	void Play Jump Start(); // Function KSCameraManager.KSCameraManager_C.Play Jump Start
	void PlayJumpLanding(); // Function KSCameraManager.KSCameraManager_C.PlayJumpLanding
	void Play Mantle(int32_t Mantle Index); // Function KSCameraManager.KSCameraManager_C.Play Mantle
	void ExecuteUbergraph_KSCameraManager(int32_t EntryPoint); // Function KSCameraManager.KSCameraManager_C.ExecuteUbergraph_KSCameraManager
};

