// DynamicClass MasterWeapon_ABP.MasterWeapon_ABP_C
// Size: 0x2eb0 (Inherited: 0x340)
struct UMasterWeapon_ABP_C : public UKSWeaponAnimInstance {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x338(0x30)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x368(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x470(0x20)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x490(0x48)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x4d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x500(0x28)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_5; // 0x528(0x18)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_7; // 0x540(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x690(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_6; // 0x730(0x150)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_4; // 0x880(0x18)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_5; // 0x898(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x9e8(0x30)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_3; // 0xa18(0x18)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_4; // 0xa30(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xb80(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0xbb0(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0xc60(0xb8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0xd18(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0xe20(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0xf28(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x1030(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x1138(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x1240(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x12e0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1300(0xb8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x13b8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x13d8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1400(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1420(0x28)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_3; // 0x1448(0x150)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose_2; // 0x1598(0x18)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_2; // 0x15b0(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1700(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1730(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x17e0(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x1880(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x1988(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x1a90(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1b98(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1bc0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1be0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x1c80(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1ca0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x1cc8(0x108)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned; // 0x1dd0(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1f20(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1fd8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2000(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x20a0(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x20c8(0xd0)
	struct FAnimNode_RefPose AnimGraphNode_LocalRefPose; // 0x2198(0x18)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x21b0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x22b8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x23c0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x24c8(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x25d0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2670(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x2690(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x26b0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2768(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2790(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x27b0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x27d8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x28e0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2900(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x29b8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x29e0(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x2a80(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2ac8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2b80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2ba8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2bd0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2cd8(0x108)
	float HideMagazineAlpha; // 0x2de0(0x04)
	struct UAnimSequence* Weapon ABP Idle; // 0x2de8(0x08)
	struct UAnimSequence* Weapon ABP Holster; // 0x2df0(0x08)
	struct FRotator Shell Housing Spin; // 0x2df8(0x0c)
	int32_t Missing Shell Count; // 0x2e04(0x04)
	bool Shell Loading; // 0x2e08(0x01)
	struct FRotator Target Shell Housing Spin; // 0x2e0c(0x0c)
	bool ShellE_Hidden; // 0x2e18(0x01)
	char UnknownData_2E1A[0x2]; // 0x2e1a(0x02)
	int32_t Revolver Index; // 0x2e1c(0x04)
	float Turn Directional Amount; // 0x2e20(0x04)
	float Scope Scale Alpha; // 0x2e24(0x04)
	bool Is Revolver; // 0x2e28(0x01)
	bool Is Multi Stage Reload; // 0x2e29(0x01)
	char UnknownData_2E2A[0x2]; // 0x2e2a(0x02)
	float Multi Stage Reload Alpha; // 0x2e2c(0x04)
	bool Is Holstered; // 0x2e30(0x01)
	char UnknownData_2E31[0x3]; // 0x2e31(0x03)
	struct FRotator Revolver Chamber; // 0x2e34(0x0c)
	bool Prevent Scope Scaling Override; // 0x2e40(0x01)
	char UnknownData_2E41[0x3]; // 0x2e41(0x03)
	float Alt Scope Scale Alpha; // 0x2e44(0x04)
	float UnspentShellAlphaA; // 0x2e48(0x04)
	float UnspentShellAlphaB; // 0x2e4c(0x04)
	float UnspentShellAlphaC; // 0x2e50(0x04)
	float UnspentShellAlphaD; // 0x2e54(0x04)
	float UnspentShellAlphaE; // 0x2e58(0x04)
	float UnspentShellAlphaF; // 0x2e5c(0x04)
	float SpentShellAlphaA; // 0x2e60(0x04)
	float SpentShellAlphaB; // 0x2e64(0x04)
	float SpentShellAlphaC; // 0x2e68(0x04)
	float SpentShellAlphaD; // 0x2e6c(0x04)
	float SpentShellAlphaE; // 0x2e70(0x04)
	float SpentShellAlphaF; // 0x2e74(0x04)
	bool Is in Lobby Viewer?; // 0x2e78(0x01)
	char UnknownData_2E79[0x3]; // 0x2e79(0x03)
	float Is Stock Folded; // 0x2e7c(0x04)
	struct FRotator Stock Rotation Target; // 0x2e80(0x0c)
	struct FRotator Stock Alt Rotation Target; // 0x2e8c(0x0c)
	struct FVector ADS_ScopeLocationModifier; // 0x2e98(0x0c)
	bool UseAdditive; // 0x2ea4(0x01)
	bool ShieldIsActive; // 0x2ea5(0x01)
	char UnknownData_2EA6[0xa]; // 0x2ea6(0x0a)

	void UpdateUnspentShellVisibility(int32_t bpp__ShellIndex__pf, bool bpp__NewxVisibility__pfT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.UpdateUnspentShellVisibility
	void UpdateSpentShellVisibility(int32_t bpp__ShellIndex__pf, bool bpp__NewxVisibility__pfT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.UpdateSpentShellVisibility
	void Set Weapon State(struct UKSWeaponComponent* bpp__OwningxWeaponxComponent__pfTT, enum class EWeaponStateNew bpp__OldxState__pfT, enum class EWeaponStateNew bpp__NewxState__pfT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.Set Weapon State
	void Set Shield Active(bool bpp__IsxShieldxActive__pfTT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.Set Shield Active
	void Set Scope Scale Alpha(float bpp__NewxAlpha__pfT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.Set Scope Scale Alpha
	void Set Revolver Chamber Rot(struct FRotator bpp__NewxRevolverxChamberxRot__pfTTT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.Set Revolver Chamber Rot
	void Set Multi Stage Reload(bool bpp__NewxIsxMultixStagexReload__pfTTTT); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.Set Multi Stage Reload
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_TransitionResult_C81FAA1C43A50F58E2735BA1DAFCEAC3(); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_TransitionResult_C81FAA1C43A50F58E2735BA1DAFCEAC3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_TransitionResult_611B83614EC94B902AE59986EF3BC03A(); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_TransitionResult_611B83614EC94B902AE59986EF3BC03A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_ModifyBone_52465FEA4D6701EB8BD2D5B0FF7D5E44(); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_ModifyBone_52465FEA4D6701EB8BD2D5B0FF7D5E44
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_BlendListByBool_8D407D3B4E9DF8DEBA89FBB2A5413674(); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MasterWeapon_ABP_AnimGraphNode_BlendListByBool_8D407D3B4E9DF8DEBA89FBB2A5413674
	void AnimNotify_Unhide Mag(); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.AnimNotify_Unhide Mag
	void AnimNotify_Hide Mag(); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.AnimNotify_Hide Mag
	void AnimGraph(struct FPoseLink bpp__AnimGraph__pf); // Function MasterWeapon_ABP.MasterWeapon_ABP_C.AnimGraph
};

