// DynamicClass PCM_Hero_ABP.PCM_Hero_ABP_C
// Size: 0x1ef80 (Inherited: 0x1010)
struct UPCM_Hero_ABP_C : public UKSCharacterAnimInst {
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_66; // 0x1010(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_171; // 0x10c8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x10f0(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_170; // 0x1138(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_26; // 0x1160(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_169; // 0x1220(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_43; // 0x1248(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_65; // 0x1350(0xb8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_42; // 0x1408(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_41; // 0x1510(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_40; // 0x1618(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_39; // 0x1720(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_25; // 0x1828(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_64; // 0x18e8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_168; // 0x19a0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_63; // 0x19c8(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_24; // 0x1a80(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_38; // 0x1b40(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_37; // 0x1c48(0x108)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27; // 0x1d50(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_99; // 0x1d78(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x1e18(0xe0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1ef8(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_17; // 0x1fd8(0x30)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_67; // 0x2008(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_66; // 0x2158(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72; // 0x22a8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71; // 0x2320(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_98; // 0x2398(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_16; // 0x2438(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x2468(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_97; // 0x2518(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_36; // 0x25b8(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_32; // 0x26c0(0x20)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_4; // 0x26e0(0x190)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26; // 0x2870(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25; // 0x2898(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24; // 0x28c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23; // 0x28e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22; // 0x2910(0x28)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_65; // 0x2938(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70; // 0x2a88(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_64; // 0x2b00(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69; // 0x2c50(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_63; // 0x2cc8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68; // 0x2e18(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_16; // 0x2e90(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_15; // 0x2f40(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67; // 0x2f70(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_62; // 0x2fe8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66; // 0x3138(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_61; // 0x31b0(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_60; // 0x3300(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_59; // 0x3450(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65; // 0x35a0(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_58; // 0x3618(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64; // 0x3768(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63; // 0x37e0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62; // 0x3858(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_57; // 0x38d0(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_96; // 0x3a20(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_95; // 0x3ac0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_94; // 0x3b60(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_15; // 0x3c00(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_14; // 0x3cb0(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61; // 0x3ce0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_13; // 0x3d58(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60; // 0x3d88(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x3e00(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x3e30(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35; // 0x3ee0(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_93; // 0x3fe8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_92; // 0x4088(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x4128(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x4170(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_62; // 0x41b8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_167; // 0x4270(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_166; // 0x4298(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_91; // 0x42c0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_90; // 0x4360(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_32; // 0x4400(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34; // 0x4420(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_31; // 0x4528(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_89; // 0x4548(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33; // 0x45e8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32; // 0x46f0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31; // 0x47f8(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_88; // 0x4900(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_31; // 0x49a0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_30; // 0x49c0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_87; // 0x49e0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_29; // 0x4a80(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_30; // 0x4aa0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_86; // 0x4ac0(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21; // 0x4b60(0x28)
	struct FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot; // 0x4b88(0x90)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x4c18(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59; // 0x4c48(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x4cc0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x4cf0(0xb0)
	bool __CustomProperty_StringMantlesTogether_461224144FFC5A148A9487A371F95429; // 0x4da0(0x01)
	char UnknownData_4DA1[0x3]; // 0x4da1(0x03)
	float __CustomProperty_Max2StoryMantleHt_461224144FFC5A148A9487A371F95429; // 0x4da4(0x04)
	float __CustomProperty_MaxMantleHt_461224144FFC5A148A9487A371F95429; // 0x4da8(0x04)
	char UnknownData_4DAC[0x4]; // 0x4dac(0x04)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_4; // 0x4db0(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_14; // 0x4e50(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_61; // 0x4f00(0xb8)
	bool __CustomProperty_Enable Zipline Eng Aims_E3950B524F93AEA4F112E2B3A71E8E86; // 0x4fb8(0x01)
	char UnknownData_4FB9[0x7]; // 0x4fb9(0x07)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_3; // 0x4fc0(0xa0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_10; // 0x5060(0x1b0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_9; // 0x5210(0x1b0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_8; // 0x53c0(0x1b0)
	enum class EKSMovementDirection __CustomProperty_MeleeLowerBodyDirection_3741820D49F2DBC1518975A785322FAF; // 0x5570(0x01)
	bool __CustomProperty_bEnableMeleeLowerBody_3741820D49F2DBC1518975A785322FAF; // 0x5571(0x01)
	bool __CustomProperty_bCanTransitionDirections_3741820D49F2DBC1518975A785322FAF; // 0x5572(0x01)
	bool __CustomProperty_PrototypeLocomotionGraphEnable_3741820D49F2DBC1518975A785322FAF; // 0x5573(0x01)
	bool __CustomProperty_MasterWeaponIsGrenade_3741820D49F2DBC1518975A785322FAF; // 0x5574(0x01)
	char UnknownData_5575[0x3]; // 0x5575(0x03)
	float __CustomProperty_CachedPivotAngle_3741820D49F2DBC1518975A785322FAF; // 0x5578(0x04)
	float __CustomProperty_Cached Stop Angle_3741820D49F2DBC1518975A785322FAF; // 0x557c(0x04)
	bool __CustomProperty_Dodge Rolling BP_3741820D49F2DBC1518975A785322FAF; // 0x5580(0x01)
	char UnknownData_5581[0x3]; // 0x5581(0x03)
	float __CustomProperty_Cached Angle_3741820D49F2DBC1518975A785322FAF; // 0x5584(0x04)
	bool __CustomProperty_Starting a Pivot_3741820D49F2DBC1518975A785322FAF; // 0x5588(0x01)
	bool __CustomProperty_StringMantlesTogether_3741820D49F2DBC1518975A785322FAF; // 0x5589(0x01)
	char UnknownData_558A[0x2]; // 0x558a(0x02)
	float __CustomProperty_MaxMantleHt_3741820D49F2DBC1518975A785322FAF; // 0x558c(0x04)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance_2; // 0x5590(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_85; // 0x5630(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x56d0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x5718(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30; // 0x5760(0x108)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_23; // 0x5868(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_165; // 0x5928(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_60; // 0x5950(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_164; // 0x5a08(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_29; // 0x5a30(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29; // 0x5a50(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_84; // 0x5b58(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x5bf8(0x48)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_83; // 0x5c40(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_163; // 0x5ce0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_59; // 0x5d08(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_58; // 0x5dc0(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_82; // 0x5e78(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20; // 0x5f18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19; // 0x5f40(0x28)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_56; // 0x5f68(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58; // 0x60b8(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_55; // 0x6130(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57; // 0x6280(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_81; // 0x62f8(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x6398(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x63c8(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_2; // 0x64a8(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x6698(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned; // 0x6778(0x1f0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_80; // 0x6968(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x6a08(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x6a38(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28; // 0x6ae8(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_79; // 0x6bf0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_162; // 0x6c90(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_57; // 0x6cb8(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_78; // 0x6d70(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_56; // 0x6e10(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_77; // 0x6ec8(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x6f68(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_161; // 0x6fb0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_55; // 0x6fd8(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_76; // 0x7090(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_75; // 0x7130(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_28; // 0x71d0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27; // 0x71f0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_28; // 0x72f8(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x7318(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_54; // 0x73d8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_160; // 0x7490(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_159; // 0x74b8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x74e0(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x7528(0x48)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26; // 0x7570(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_27; // 0x7678(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_27; // 0x7698(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_158; // 0x76b8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25; // 0x76e0(0x108)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_74; // 0x77e8(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_26; // 0x7888(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_53; // 0x78a8(0xb8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_25; // 0x7960(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_73; // 0x7980(0xa0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24; // 0x7a20(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26; // 0x7b28(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_25; // 0x7b48(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23; // 0x7b68(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22; // 0x7c70(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_24; // 0x7d78(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24; // 0x7d98(0x20)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_7; // 0x7db8(0x1b0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_157; // 0x7f68(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x7f90(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_156; // 0x8050(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5; // 0x8078(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x8148(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_52; // 0x8208(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_72; // 0x82c0(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_54; // 0x8360(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56; // 0x84b0(0x78)
	char UnknownData_8528[0x8]; // 0x8528(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_3; // 0x8530(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_155; // 0x86c0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_51; // 0x86e8(0xb8)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_12; // 0x87a0(0x1b0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_50; // 0x8950(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_154; // 0x8a08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_153; // 0x8a30(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_8; // 0x8a58(0x188)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_49; // 0x8be0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_152; // 0x8c98(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_7; // 0x8cc0(0x188)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13; // 0x8e48(0xb0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_6; // 0x8ef8(0x188)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_5; // 0x9080(0x188)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10; // 0x9208(0xc8)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_4; // 0x92d0(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_3; // 0x93c0(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x94b0(0xf0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x95a0(0xf0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_48; // 0x9690(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_151; // 0x9748(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_150; // 0x9770(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_47; // 0x9798(0xb8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_23; // 0x9850(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_149; // 0x9870(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_148; // 0x9898(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_23; // 0x98c0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_46; // 0x98e0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_45; // 0x9998(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_147; // 0x9a50(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_44; // 0x9a78(0xb8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_22; // 0x9b30(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_146; // 0x9b50(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_145; // 0x9b78(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_22; // 0x9ba0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_43; // 0x9bc0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_42; // 0x9c78(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_144; // 0x9d30(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21; // 0x9d58(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_41; // 0x9e60(0xb8)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4; // 0x9f18(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_143; // 0x9fe8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_142; // 0xa010(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3; // 0xa038(0xd0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0xa108(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0xa1c8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_40; // 0xa288(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_39; // 0xa340(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_141; // 0xa3f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_140; // 0xa420(0x28)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_11; // 0xa448(0x1b0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_21; // 0xa5f8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_21; // 0xa618(0x20)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_10; // 0xa638(0x1b0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_139; // 0xa7e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_138; // 0xa810(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20; // 0xa838(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19; // 0xa940(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_137; // 0xaa48(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0xaa70(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_136; // 0xaab8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_38; // 0xaae0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_135; // 0xab98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_134; // 0xabc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_133; // 0xabe8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_71; // 0xac10(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4; // 0xacb0(0x188)
	struct FKSAnimNode_Mirror KSAnimGraphNode_Mirror; // 0xae38(0x110)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_20; // 0xaf48(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_20; // 0xaf68(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_70; // 0xaf88(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_132; // 0xb028(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_131; // 0xb050(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_37; // 0xb078(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0xb130(0x48)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0xb178(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_130; // 0xb238(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_19; // 0xb260(0x20)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_9; // 0xb280(0x1b0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_8; // 0xb430(0x1b0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_7; // 0xb5e0(0x1b0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_6; // 0xb790(0x1b0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0xb940(0xc0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_5; // 0xba00(0x1b0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_4; // 0xbbb0(0x1b0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_3; // 0xbd60(0x1b0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_69; // 0xbf10(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_19; // 0xbfb0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_129; // 0xbfd0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_36; // 0xbff8(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12; // 0xc0b0(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_68; // 0xc160(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_53; // 0xc200(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55; // 0xc350(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_52; // 0xc3c8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54; // 0xc518(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_35; // 0xc590(0xb8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_10; // 0xc648(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53; // 0xc710(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_51; // 0xc788(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_67; // 0xc8d8(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_9; // 0xc978(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52; // 0xca40(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_50; // 0xcab8(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_34; // 0xcc08(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_128; // 0xccc0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_127; // 0xcce8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_126; // 0xcd10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_125; // 0xcd38(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_66; // 0xcd60(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_65; // 0xce00(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_33; // 0xcea0(0xb8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8; // 0xcf58(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51; // 0xd020(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_49; // 0xd098(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_64; // 0xd1e8(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7; // 0xd288(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50; // 0xd350(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_48; // 0xd3c8(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_32; // 0xd518(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_63; // 0xd5d0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_62; // 0xd670(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_31; // 0xd710(0xb8)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6; // 0xd7c8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49; // 0xd890(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_47; // 0xd908(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_61; // 0xda58(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5; // 0xdaf8(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48; // 0xdbc0(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_46; // 0xdc38(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_30; // 0xdd88(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_60; // 0xde40(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_45; // 0xdee0(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47; // 0xe030(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_44; // 0xe0a8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46; // 0xe1f8(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_43; // 0xe270(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45; // 0xe3c0(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_42; // 0xe438(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44; // 0xe588(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_124; // 0xe600(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_123; // 0xe628(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_122; // 0xe650(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_121; // 0xe678(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_120; // 0xe6a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_119; // 0xe6c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_118; // 0xe6f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_117; // 0xe718(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0xe740(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_116; // 0xe800(0x28)
	char UnknownData_E828[0x8]; // 0xe828(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0xe830(0x190)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0xe9c0(0x190)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_59; // 0xeb50(0xa0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_18; // 0xebf0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_18; // 0xec10(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_17; // 0xec30(0x20)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil_2; // 0xec50(0x1b0)
	struct FKSAnimNode_Recoil KSAnimGraphNode_Recoil; // 0xee00(0x1b0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_58; // 0xefb0(0xa0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_16; // 0xf050(0x20)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0xf070(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0xf130(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_115; // 0xf1e8(0x28)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_41; // 0xf210(0x150)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4; // 0xf360(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0xf428(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43; // 0xf4e0(0x78)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0xf558(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_114; // 0xf610(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_113; // 0xf638(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11; // 0xf660(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_112; // 0xf710(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_111; // 0xf738(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0xf760(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_57; // 0xf818(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0xf8b8(0xb8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_15; // 0xf970(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_110; // 0xf990(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_17; // 0xf9b8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_109; // 0xf9d8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_16; // 0xfa00(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0xfa20(0xb8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14; // 0xfad8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_108; // 0xfaf8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_15; // 0xfb20(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_107; // 0xfb40(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14; // 0xfb68(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_106; // 0xfb88(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_105; // 0xfbb0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0xfbd8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_104; // 0xfc90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_103; // 0xfcb8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_102; // 0xfce0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_101; // 0xfd08(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10; // 0xfd30(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42; // 0xfde0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41; // 0xfe58(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40; // 0xfed0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_56; // 0xff48(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_55; // 0xffe8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_54; // 0x10088(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39; // 0x10128(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38; // 0x101a0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37; // 0x10218(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_100; // 0x10290(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x102b8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_99; // 0x10370(0x28)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_40; // 0x10398(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_39; // 0x104e8(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_38; // 0x10638(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_37; // 0x10788(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_36; // 0x108d8(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_35; // 0x10a28(0x150)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x10b78(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_53; // 0x10c38(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_98; // 0x10cd8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_97; // 0x10d00(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_96; // 0x10d28(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x10d50(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_95; // 0x10e10(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_94; // 0x10e38(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3; // 0x10e60(0xc8)
	bool __CustomProperty_bIsLobby_9FDD1A7146055937A755E6ACD99BC318; // 0x10f28(0x01)
	bool __CustomProperty_bIsServer_9FDD1A7146055937A755E6ACD99BC318; // 0x10f29(0x01)
	char UnknownData_10F2A[0x6]; // 0x10f2a(0x06)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance; // 0x10f30(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x10fd0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_93; // 0x11088(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_92; // 0x110b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_91; // 0x110d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x11100(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_90; // 0x111b8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_52; // 0x111e0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x11280(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_89; // 0x11338(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_88; // 0x11360(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_51; // 0x11388(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_87; // 0x11428(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_86; // 0x11450(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_85; // 0x11478(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x114a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x114c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x114f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x11518(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x11540(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_50; // 0x11568(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_49; // 0x11608(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_48; // 0x116a8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_47; // 0x11748(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_46; // 0x117e8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_45; // 0x11888(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x11928(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x11970(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x11998(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x119c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x119e8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_44; // 0x11a10(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_43; // 0x11ab0(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_34; // 0x11b50(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36; // 0x11ca0(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_33; // 0x11d18(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35; // 0x11e68(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x11ee0(0x28)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9; // 0x11f08(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x11fb8(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3; // 0x11fe0(0x188)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_42; // 0x12168(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x12208(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x12230(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x122f0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18; // 0x12318(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13; // 0x12420(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17; // 0x12440(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x12548(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13; // 0x12570(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x12590(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x12648(0xb8)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x12700(0x188)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x12888(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x128b0(0xb8)
	char UnknownData_12968[0x8]; // 0x12968(0x08)
	struct FAnimNode_RigidBodySkipServer AnimGraphNode_RigidBodySkipServer; // 0x12970(0x590)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12; // 0x12f00(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x12f20(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12; // 0x12f48(0x20)
	struct FAnimNode_BlendByLOD AnimGraphNode_BlendByLOD_2; // 0x12f68(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x13008(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x13030(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x13058(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x13080(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x130a8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x130d0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x130f8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x13120(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0x13148(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0x13170(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x13198(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x131c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x131e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x13210(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x13238(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x13260(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x13288(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x132b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x132d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x13300(0x28)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_32; // 0x13328(0x150)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9; // 0x13478(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_41; // 0x13540(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8; // 0x135e0(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_40; // 0x136a8(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7; // 0x13748(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_39; // 0x13810(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6; // 0x138b0(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_38; // 0x13978(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_37; // 0x13a18(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34; // 0x13ab8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33; // 0x13b30(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32; // 0x13ba8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31; // 0x13c20(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_31; // 0x13c98(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_30; // 0x13de8(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_29; // 0x13f38(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_28; // 0x14088(0x150)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5; // 0x141d8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_36; // 0x142a0(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x14340(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_35; // 0x14408(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x144a8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_34; // 0x14570(0xa0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x14610(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_33; // 0x146d8(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8; // 0x14778(0xb0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_27; // 0x14828(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_26; // 0x14978(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_25; // 0x14ac8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0x14c18(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x14c90(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x14d08(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x14d80(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7; // 0x14df8(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x14ea8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x14ed8(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_24; // 0x14f50(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_23; // 0x150a0(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x151f0(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_22; // 0x15268(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x153b8(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_21; // 0x15430(0x150)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32; // 0x15580(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x15620(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x15698(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x15710(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x15788(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_20; // 0x15800(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_19; // 0x15950(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_18; // 0x15aa0(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_17; // 0x15bf0(0x150)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x15d40(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16; // 0x15df0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11; // 0x15ef8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11; // 0x15f18(0x20)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x15f38(0x78)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x15fb0(0xb0)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_8; // 0x16060(0x110)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10; // 0x16170(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10; // 0x16190(0x20)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_7; // 0x161b0(0x110)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9; // 0x162c0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9; // 0x162e0(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x16300(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x16330(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x163a8(0x30)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_16; // 0x163d8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x16528(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x165a0(0x30)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_15; // 0x165d0(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x16720(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x16798(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x167c8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x16840(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x168b8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x16930(0x78)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15; // 0x169a8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8; // 0x16ab0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14; // 0x16ad0(0x108)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x16bd8(0xb0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x16c88(0x20)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_6; // 0x16ca8(0x110)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_5; // 0x16db8(0x110)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_4; // 0x16ec8(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13; // 0x16fd8(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x170e0(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12; // 0x17100(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x17208(0x20)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_3; // 0x17228(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8; // 0x17338(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x17358(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x17378(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x17398(0x20)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_14; // 0x173b8(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_13; // 0x17508(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_12; // 0x17658(0x150)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_11; // 0x177a8(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x178f8(0x30)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_10; // 0x17928(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x17a78(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x17af0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x17b20(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31; // 0x17bd0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x17c70(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11; // 0x17c98(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x17da0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x17e58(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30; // 0x17e80(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x17f20(0x28)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2; // 0x17f48(0xd0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x18018(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_9; // 0x18090(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x181e0(0xb8)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_2; // 0x18298(0x110)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x183a8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x183d0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x183f0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29; // 0x18410(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x184b0(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10; // 0x184d8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9; // 0x185e0(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x186e8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x18708(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28; // 0x18728(0xa0)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp; // 0x187c8(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0x188d8(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0x189e0(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x18ae8(0x28)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x18b10(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x18c18(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x18d20(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27; // 0x18d48(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x18de8(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x18ea0(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x18f58(0xb8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x19010(0xb0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x190c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x190e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x19110(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x19138(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x19160(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x19188(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26; // 0x191b0(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x19250(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x19308(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x193c8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25; // 0x193f0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x19490(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x194b8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x194e0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x195a0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24; // 0x195c8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x19668(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x19690(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x196b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x196e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x19708(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x19730(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x197d0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x19888(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x198b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x198d8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x19900(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x199a0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x19a58(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x19a80(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x19aa8(0xc0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x19b68(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x19c70(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x19c90(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x19cb0(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x19db8(0x108)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x19ec0(0x28)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x19ee8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x19fb0(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_8; // 0x1a050(0x150)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x1a1a0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x1a1c8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x1a280(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x1a2a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x1a2d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x1a2f8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x1a320(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x1a398(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x1a458(0x28)
	struct FAnimNode_BlendByLOD AnimGraphNode_BlendByLOD; // 0x1a480(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x1a520(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x1a548(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x1a600(0xa0)
	struct FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive; // 0x1a6a0(0xd0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x1a770(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x1a798(0x48)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x1a7e0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x1a858(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x1a8f8(0x48)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x1a940(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x1a9f8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x1aa20(0x28)
	struct FAnimNode_LegIK AnimGraphNode_LegIK; // 0x1aa48(0xf8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x1ab40(0xa0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x1abe0(0xb0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_6; // 0x1ac90(0x1b0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_5; // 0x1ae40(0x1b0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_4; // 0x1aff0(0x1b0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x1b1a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x1b1c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x1b1f0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x1b218(0xa0)
	struct FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph; // 0x1b2b8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x1b358(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x1b380(0x28)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1b3a8(0x30)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_3; // 0x1b3d8(0x1b0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x1b588(0x108)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1b690(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1b6b0(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x1b6d0(0xa0)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_7; // 0x1b770(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1b8c0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x1b938(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1b9d8(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1ba20(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x1ba68(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x1ba90(0x28)
	struct FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel; // 0x1bab8(0x68)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x1bb20(0xc8)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1bbe8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x1bc98(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x1bd38(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x1bd60(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x1be00(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x1bea0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x1bf40(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_6; // 0x1bfb8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1c108(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_5; // 0x1c180(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1c2d0(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_4; // 0x1c348(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1c498(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_3; // 0x1c510(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1c660(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_2; // 0x1c6d8(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1c828(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned; // 0x1c8a0(0x150)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1c9f0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x1caa8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x1cad0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1caf8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x1cb98(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x1cbc0(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x1cc60(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x1cd20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x1cd48(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x1cd70(0xc8)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned_2; // 0x1ce38(0x1b0)
	struct FAnimNode_AimOffsetSkinned AnimGraphNode_AimOffsetSkinned; // 0x1cfe8(0x1b0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x1d198(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x1d1c0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1d1e8(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x1d2a0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x1d360(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x1d388(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1d428(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x1d4e0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x1d508(0xa0)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1d5a8(0x188)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x1d730(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x1d7d0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1d870(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x1d898(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1d8c0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x1d8e8(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1d988(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1d9b0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1da70(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1db30(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1dbd0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1dc90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1dcb8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1dce0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1dd08(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1dd30(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1dd58(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1de18(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1deb8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1df70(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1df98(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1e038(0x28)
	float Time; // 0x1e060(0x04)
	float Movement Direction; // 0x1e064(0x04)
	float Aim Pitch; // 0x1e068(0x04)
	float Aim Yaw; // 0x1e06c(0x04)
	float Save Last Yaw; // 0x1e070(0x04)
	float Turn Value; // 0x1e074(0x04)
	struct AKSCharacter* Character; // 0x1e078(0x08)
	struct FRotator ADS Rotator; // 0x1e080(0x0c)
	float 1P_Aim_Pitch; // 0x1e08c(0x04)
	float 1P_Aim Yaw; // 0x1e090(0x04)
	struct FName Step Type; // 0x1e094(0x08)
	struct FName Material Type; // 0x1e09c(0x08)
	struct FName Shoe Type; // 0x1e0a4(0x08)
	struct FName Clothing Type; // 0x1e0ac(0x08)
	float 1p Pitch Offset; // 0x1e0b4(0x04)
	bool Turning the Character; // 0x1e0b8(0x01)
	bool Turn Left; // 0x1e0b9(0x01)
	bool Turn Right; // 0x1e0ba(0x01)
	char UnknownData_1E0BB[0x1]; // 0x1e0bb(0x01)
	struct FName Roll Direction; // 0x1e0bc(0x08)
	char UnknownData_1E0C4[0x4]; // 0x1e0c4(0x04)
	struct UAnimMontage* Cached Dodge Roll; // 0x1e0c8(0x08)
	float Desired Component Yaw Old; // 0x1e0d0(0x04)
	float Turn In Place Recovery Speed; // 0x1e0d4(0x04)
	float World Space Aim Yaw; // 0x1e0d8(0x04)
	bool Turn In Place Active; // 0x1e0dc(0x01)
	char UnknownData_1E0DD[0x3]; // 0x1e0dd(0x03)
	struct FRotator Applied Turn In Place Rotator Old; // 0x1e0e0(0x0c)
	struct FRotator World Turn In Place Rotator Old; // 0x1e0ec(0x0c)
	float MantleTimer; // 0x1e0f8(0x04)
	float MantleTimerMax; // 0x1e0fc(0x04)
	struct FRotator Control Rotation; // 0x1e100(0x0c)
	char UnknownData_1E10C[0x4]; // 0x1e10c(0x04)
	struct UAnimSequenceBase* Start Moving A; // 0x1e110(0x08)
	struct UAnimSequenceBase* Stop Moving A; // 0x1e118(0x08)
	struct UAnimSequenceBase* Pivot; // 0x1e120(0x08)
	struct UAnimSequenceBase* Current Direction Pivot; // 0x1e128(0x08)
	struct UAnimSequence* TurnWounded; // 0x1e130(0x08)
	float TurnInPlaceMinThreshold_1; // 0x1e138(0x04)
	float TurnValue; // 0x1e13c(0x04)
	struct UAnimSequenceBase* Current Stop Moving Crouch; // 0x1e140(0x08)
	struct UAnimSequenceBase* current direction Pivot crouch; // 0x1e148(0x08)
	struct UAnimSequenceBase* Pivot crouch; // 0x1e150(0x08)
	float WeaponADSSpeedModifier; // 0x1e158(0x04)
	float WeaponWalkSpeedModifier; // 0x1e15c(0x04)
	float CurrentMaxSpeed; // 0x1e160(0x04)
	bool 3PADS; // 0x1e164(0x01)
	char UnknownData_1E165[0x3]; // 0x1e165(0x03)
	struct UAnimSequenceBase* Current Stop Moving; // 0x1e168(0x08)
	struct UAnimSequenceBase* Start moving Crouch B; // 0x1e170(0x08)
	struct UAnimSequenceBase* Start Moving B; // 0x1e178(0x08)
	float Cached Angle; // 0x1e180(0x04)
	char UnknownData_1E184[0x4]; // 0x1e184(0x04)
	struct UAnimSequenceBase* Start moving Crouch A; // 0x1e188(0x08)
	float AimYawInterpSpeed; // 0x1e190(0x04)
	bool bCanResetAimYaw; // 0x1e194(0x01)
	char UnknownData_1E195[0x3]; // 0x1e195(0x03)
	float AimYawInterpSpeedTarget; // 0x1e198(0x04)
	char UnknownData_1E19C[0x4]; // 0x1e19c(0x04)
	struct FTimerHandle AimYawResetTimer; // 0x1e1a0(0x08)
	float Cached Stop Angle; // 0x1e1a8(0x04)
	char UnknownData_1E1AC[0x4]; // 0x1e1ac(0x04)
	struct UAnimSequenceBase* Stop Moving B; // 0x1e1b0(0x08)
	struct UAnimSequenceBase* Stop Moving Crouch A; // 0x1e1b8(0x08)
	struct UAnimSequenceBase* Stop Moving Crouch B; // 0x1e1c0(0x08)
	float World Height; // 0x1e1c8(0x04)
	float CharZatStart; // 0x1e1cc(0x04)
	struct FMulticastInlineDelegate OnMagThrow; // 0x1e1d0(0x10)
	float Turn in place Error Tolerance; // 0x1e1e0(0x04)
	float AimYawCache; // 0x1e1e4(0x04)
	bool bIsAdjustingAimYaw; // 0x1e1e8(0x01)
	bool Dodge Rolling BP; // 0x1e1e9(0x01)
	bool Left PropB Scale; // 0x1e1ea(0x01)
	bool Right PropB Scale; // 0x1e1eb(0x01)
	float TabletScaleAlphaOLD; // 0x1e1ec(0x04)
	struct UKSWeaponComponent* Master Weapon Ref; // 0x1e1f0(0x08)
	int32_t Randomized Int; // 0x1e1f8(0x04)
	char UnknownData_1E1FC[0x4]; // 0x1e1fc(0x04)
	struct TArray<struct UMaster_WeaponComponent_C*> Back Holster Inventory; // 0x1e200(0x10)
	bool bInteraction; // 0x1e210(0x01)
	char UnknownData_1E211[0x3]; // 0x1e211(0x03)
	float Weapon Vs World Alpha; // 0x1e214(0x04)
	enum class EKSMovementDirection locoStartDir; // 0x1e218(0x01)
	char UnknownData_1E219[0x7]; // 0x1e219(0x07)
	struct UAnimSequenceBase* Start Disable Moving A; // 0x1e220(0x08)
	struct UAnimSequenceBase* Start Disable Moving B; // 0x1e228(0x08)
	struct UAnimSequenceBase* Start Disable Moving; // 0x1e230(0x08)
	struct UAnimSequenceBase* Stop Disable Moving A; // 0x1e238(0x08)
	struct UAnimSequenceBase* Stop Disable Moving B; // 0x1e240(0x08)
	struct UAnimSequenceBase* Current Stop Disable Moving; // 0x1e248(0x08)
	struct UAnimSequenceBase* CurrentDisablePivot; // 0x1e250(0x08)
	struct UAnimSequenceBase* DisablePivot; // 0x1e258(0x08)
	float AimYawDelta; // 0x1e260(0x04)
	char UnknownData_1E264[0x4]; // 0x1e264(0x04)
	struct UAnimMontage* InteractionMontage; // 0x1e268(0x08)
	float InitialDistanceFromJumpLand; // 0x1e270(0x04)
	enum class EKSMovementDirection locoStopDir; // 0x1e274(0x01)
	char UnknownData_1E275[0x3]; // 0x1e275(0x03)
	struct UAnimSequenceBase* Post Pivot; // 0x1e278(0x08)
	struct UAnimSequenceBase* Post Pivot Crouch; // 0x1e280(0x08)
	struct UAnimSequenceBase* Post Disable Pivot; // 0x1e288(0x08)
	bool Starting a Pivot; // 0x1e290(0x01)
	char UnknownData_1E291[0x3]; // 0x1e291(0x03)
	float IKHandOffsetL; // 0x1e294(0x04)
	struct UAnimSequence* Vault Anim; // 0x1e298(0x08)
	float MinMantleHt; // 0x1e2a0(0x04)
	float MaxMantleHt; // 0x1e2a4(0x04)
	float Min2StoryMantleHt; // 0x1e2a8(0x04)
	float Max2StoryMantleHt; // 0x1e2ac(0x04)
	bool bIgnoreIdleWeaponUnhide; // 0x1e2b0(0x01)
	char UnknownData_1E2B1[0x7]; // 0x1e2b1(0x07)
	struct UAkAudioEvent* Cached Pickup Sound; // 0x1e2b8(0x08)
	bool StringMantlesTogether; // 0x1e2c0(0x01)
	char UnknownData_1E2C1[0x7]; // 0x1e2c1(0x07)
	struct UAnimSequenceBase* Start Moving Melee Lower Body A; // 0x1e2c8(0x08)
	struct UAnimSequenceBase* Start Moving Melee Lower Body B; // 0x1e2d0(0x08)
	float MeleeLowerBodyStartTwist; // 0x1e2d8(0x04)
	float IKHandOffsetR; // 0x1e2dc(0x04)
	float IKFootOffsetL; // 0x1e2e0(0x04)
	float IKFootOffsetR; // 0x1e2e4(0x04)
	float IKRootOffset; // 0x1e2e8(0x04)
	bool EnableIKRootFix; // 0x1e2ec(0x01)
	bool IsMartialArtistTarget; // 0x1e2ed(0x01)
	char UnknownData_1E2EE[0x2]; // 0x1e2ee(0x02)
	struct FVector LHand_MantlePoleVector; // 0x1e2f0(0x0c)
	struct FVector RHand_MantlePoleVector; // 0x1e2fc(0x0c)
	bool DisableAimArray; // 0x1e308(0x01)
	bool CatchingWeapon; // 0x1e309(0x01)
	char UnknownData_1E30A[0x2]; // 0x1e30a(0x02)
	struct FRotator StoppedRootRotation; // 0x1e30c(0x0c)
	struct FVector StoppedRootLocation; // 0x1e318(0x0c)
	float RagdollToMontageTime; // 0x1e324(0x04)
	struct UAnimSequence* GetUpSequence; // 0x1e328(0x08)
	struct UAnimMontage* GetUpMontage; // 0x1e330(0x08)
	char UnknownData_1E338[0x8]; // 0x1e338(0x08)
	struct FTransform RagdollPelvisTransform; // 0x1e340(0x30)
	float RagdollPelvisTransformAlpha; // 0x1e370(0x04)
	bool EnableRagdollPelvisTransform; // 0x1e374(0x01)
	char UnknownData_1E375[0x3]; // 0x1e375(0x03)
	float MartialArtistChargeTime; // 0x1e378(0x04)
	char UnknownData_1E37C[0x4]; // 0x1e37c(0x04)
	struct UAnimMontage* DownedMontage; // 0x1e380(0x08)
	struct UAnimSequenceBase* Start Walking B; // 0x1e388(0x08)
	struct UAnimSequenceBase* Start Walking A; // 0x1e390(0x08)
	bool Disable upper body lands; // 0x1e398(0x01)
	char UnknownData_1E399[0x7]; // 0x1e399(0x07)
	struct UAnimSequenceBase* Start Eng Stand A; // 0x1e3a0(0x08)
	struct UAnimSequenceBase* Start Eng Stand B; // 0x1e3a8(0x08)
	struct UAnimSequenceBase* Stop Eng Stand A; // 0x1e3b0(0x08)
	struct UAnimSequenceBase* Stop Eng Stand B; // 0x1e3b8(0x08)
	struct UAnimSequenceBase* Stop Eng Stand; // 0x1e3c0(0x08)
	struct UAnimSequenceBase* Start Eng Crouch A; // 0x1e3c8(0x08)
	struct UAnimSequenceBase* Start Eng Crouch B; // 0x1e3d0(0x08)
	struct UAnimSequenceBase* Stop Eng Crouch A; // 0x1e3d8(0x08)
	struct UAnimSequenceBase* Stop Eng Crouch B; // 0x1e3e0(0x08)
	struct UAnimSequenceBase* Stop Eng Crouch; // 0x1e3e8(0x08)
	bool bWantsToNoseDive; // 0x1e3f0(0x01)
	bool bCanChangeNoseDiveState; // 0x1e3f1(0x01)
	bool bFreeFallIntroComplete; // 0x1e3f2(0x01)
	char UnknownData_1E3F3[0x1]; // 0x1e3f3(0x01)
	float FreeFallDiveAlpha; // 0x1e3f4(0x04)
	struct UAnimSequenceBase* Turn Eng; // 0x1e3f8(0x08)
	struct UAnimSequenceBase* Turn Eng Crouch; // 0x1e400(0x08)
	bool bCrouchingTransitioned1P; // 0x1e408(0x01)
	bool DisableTurnInPlaceCounterRotate; // 0x1e409(0x01)
	bool bIsStill_OLD; // 0x1e40a(0x01)
	bool bShouldSplitUpperBody_1; // 0x1e40b(0x01)
	float AdditiveLandsAlphaOLD; // 0x1e40c(0x04)
	bool bIsInPowerSlideBP; // 0x1e410(0x01)
	char UnknownData_1E411[0x3]; // 0x1e411(0x03)
	float ExitPowerSlideBlendTime; // 0x1e414(0x04)
	struct FRotator RootMantleWallFacing; // 0x1e418(0x0c)
	bool bIsUsingBruteStrength; // 0x1e424(0x01)
	char UnknownData_1E425[0x3]; // 0x1e425(0x03)
	float HitDirectionPrimary_Fwd; // 0x1e428(0x04)
	float HitDirectionPrimary_Right; // 0x1e42c(0x04)
	float HitDirectionSecondary_Fwd; // 0x1e430(0x04)
	float HitDirectionSecondary_Right; // 0x1e434(0x04)
	float CachedPivotAngle; // 0x1e438(0x04)
	struct FRecoilInfo Melee Recoil; // 0x1e43c(0x60)
	int32_t Melee Recoil Counter; // 0x1e49c(0x04)
	float HitReactionAlpha; // 0x1e4a0(0x04)
	bool Any Grip Override Active; // 0x1e4a4(0x01)
	bool Left Hand Grip Override; // 0x1e4a5(0x01)
	bool Right Hand Grip Override; // 0x1e4a6(0x01)
	char UnknownData_1E4A7[0x1]; // 0x1e4a7(0x01)
	struct FVector EngClavOffset; // 0x1e4a8(0x0c)
	bool AnimMirrorDelay; // 0x1e4b4(0x01)
	enum class ECameraShoulder CurrentShoulderBP; // 0x1e4b5(0x01)
	bool bIsHitReacting; // 0x1e4b6(0x01)
	bool bIsServer; // 0x1e4b7(0x01)
	bool bUseCollar; // 0x1e4b8(0x01)
	char UnknownData_1E4B9[0x3]; // 0x1e4b9(0x03)
	float CollarDirection; // 0x1e4bc(0x04)
	bool Use EngHeadMod; // 0x1e4c0(0x01)
	bool Master Weapon Is Grenade; // 0x1e4c1(0x01)
	char UnknownData_1E4C2[0x2]; // 0x1e4c2(0x02)
	struct FVector ADS Hand Position L; // 0x1e4c4(0x0c)
	struct FVector ADS Hand Position R; // 0x1e4d0(0x0c)
	struct FRotator ADS Hand Rotation L; // 0x1e4dc(0x0c)
	struct FRotator ADS Hand Rotation R; // 0x1e4e8(0x0c)
	enum class ADSRollControlsEnum ADS Roll Controls; // 0x1e4f4(0x01)
	char UnknownData_1E4F5[0x3]; // 0x1e4f5(0x03)
	float ADS Roll Interp speed; // 0x1e4f8(0x04)
	float ADS Bump Looping Speed; // 0x1e4fc(0x04)
	float ADS Bump Interp speed; // 0x1e500(0x04)
	float Stop Max; // 0x1e504(0x04)
	float Stop Min; // 0x1e508(0x04)
	float ADS Bump Time; // 0x1e50c(0x04)
	bool ADS Bump Start; // 0x1e510(0x01)
	char UnknownData_1E511[0x3]; // 0x1e511(0x03)
	float Ads Bump Start Time Delay; // 0x1e514(0x04)
	float Ads Bump Stop Time Delay; // 0x1e518(0x04)
	bool ADS Bump Stop; // 0x1e51c(0x01)
	char UnknownData_1E51D[0x3]; // 0x1e51d(0x03)
	struct FTimerHandle ADS Bump start Run Timer; // 0x1e520(0x08)
	struct FTimerHandle ADS Bump stop Run Timer; // 0x1e528(0x08)
	float NonComOffset; // 0x1e530(0x04)
	bool ChildPhysicsAssetEnable; // 0x1e534(0x01)
	bool SkinUseCharacterScale; // 0x1e535(0x01)
	char UnknownData_1E536[0x2]; // 0x1e536(0x02)
	struct FVector CharacterScale; // 0x1e538(0x0c)
	bool UseRightHandGrenadeAddative; // 0x1e544(0x01)
	char UnknownData_1E545[0x3]; // 0x1e545(0x03)
	float ExitWoundedBlendOutTime; // 0x1e548(0x04)
	float Constant_2; // 0x1e54c(0x04)
	bool EngHeadAdditiveSecondaryActive; // 0x1e550(0x01)
	bool EnableAdditiveIdles; // 0x1e551(0x01)
	bool PrototypeLocomotionGraphEnable; // 0x1e552(0x01)
	bool Enable Zipline Eng Aims; // 0x1e553(0x01)
	struct FName K2Node_CustomEvent_NotifyName; // 0x1e554(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID; // 0x1e55c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate; // 0x1e560(0x10)
	int32_t Temp_int_Variable; // 0x1e570(0x04)
	struct FName Temp_name_Variable; // 0x1e574(0x08)
	struct FName K2Node_CustomEvent_NotifyName_19; // 0x1e57c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_19; // 0x1e584(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_2; // 0x1e588(0x10)
	struct FName K2Node_CustomEvent_NotifyName_20; // 0x1e598(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_20; // 0x1e5a0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_3; // 0x1e5a4(0x10)
	struct FName Temp_name_Variable_2; // 0x1e5b4(0x08)
	int32_t Temp_int_Variable_2; // 0x1e5bc(0x04)
	struct FName K2Node_CustomEvent_NotifyName_21; // 0x1e5c0(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_21; // 0x1e5c8(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_4; // 0x1e5cc(0x10)
	struct FName K2Node_CustomEvent_NotifyName_22; // 0x1e5dc(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_22; // 0x1e5e4(0x04)
	struct FName K2Node_CustomEvent_NotifyName_23; // 0x1e5e8(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_23; // 0x1e5f0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_5; // 0x1e5f4(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_6; // 0x1e604(0x10)
	struct FName K2Node_CustomEvent_NotifyName_24; // 0x1e614(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_24; // 0x1e61c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_7; // 0x1e620(0x10)
	struct FName K2Node_CustomEvent_NotifyName_25; // 0x1e630(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_25; // 0x1e638(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_8; // 0x1e63c(0x10)
	struct FName Temp_name_Variable_3; // 0x1e64c(0x08)
	struct FName K2Node_CustomEvent_NotifyName_2; // 0x1e654(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_2; // 0x1e65c(0x04)
	int32_t Temp_int_Variable_3; // 0x1e660(0x04)
	struct FName K2Node_CustomEvent_NotifyName_26; // 0x1e664(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_26; // 0x1e66c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_9; // 0x1e670(0x10)
	struct FName K2Node_CustomEvent_NotifyName_27; // 0x1e680(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_27; // 0x1e688(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_10; // 0x1e68c(0x10)
	struct FName K2Node_CustomEvent_NotifyName_28; // 0x1e69c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_28; // 0x1e6a4(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_11; // 0x1e6a8(0x10)
	struct FName K2Node_CustomEvent_NotifyName_29; // 0x1e6b8(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_29; // 0x1e6c0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_12; // 0x1e6c4(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_13; // 0x1e6d4(0x10)
	struct FName K2Node_CustomEvent_NotifyName_30; // 0x1e6e4(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_30; // 0x1e6ec(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_14; // 0x1e6f0(0x10)
	struct FName Temp_name_Variable_4; // 0x1e700(0x08)
	int32_t Temp_int_Variable_4; // 0x1e708(0x04)
	struct FName K2Node_CustomEvent_NotifyName_31; // 0x1e70c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_31; // 0x1e714(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_15; // 0x1e718(0x10)
	struct FName K2Node_CustomEvent_NotifyName_32; // 0x1e728(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_32; // 0x1e730(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_16; // 0x1e734(0x10)
	struct FName K2Node_CustomEvent_NotifyName_33; // 0x1e744(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_33; // 0x1e74c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_17; // 0x1e750(0x10)
	struct FName K2Node_CustomEvent_NotifyName_34; // 0x1e760(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_34; // 0x1e768(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_18; // 0x1e76c(0x10)
	struct FName K2Node_CustomEvent_NotifyName_35; // 0x1e77c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_35; // 0x1e784(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_19; // 0x1e788(0x10)
	struct FName Temp_name_Variable_5; // 0x1e798(0x08)
	int32_t Temp_int_Variable_5; // 0x1e7a0(0x04)
	struct FName K2Node_CustomEvent_NotifyName_36; // 0x1e7a4(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_36; // 0x1e7ac(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_20; // 0x1e7b0(0x10)
	struct FName K2Node_CustomEvent_NotifyName_3; // 0x1e7c0(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_3; // 0x1e7c8(0x04)
	struct FName K2Node_CustomEvent_NotifyName_37; // 0x1e7cc(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_37; // 0x1e7d4(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_21; // 0x1e7d8(0x10)
	struct FName K2Node_CustomEvent_NotifyName_38; // 0x1e7e8(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_38; // 0x1e7f0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_22; // 0x1e7f4(0x10)
	struct FName K2Node_CustomEvent_NotifyName_39; // 0x1e804(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_39; // 0x1e80c(0x04)
	struct FName K2Node_CustomEvent_NotifyName_40; // 0x1e810(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_40; // 0x1e818(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_23; // 0x1e81c(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_24; // 0x1e82c(0x10)
	float CallFunc_BreakVector2D_X; // 0x1e83c(0x04)
	float CallFunc_BreakVector2D_Y; // 0x1e840(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_25; // 0x1e844(0x10)
	struct FName Temp_name_Variable_6; // 0x1e854(0x08)
	int32_t Temp_int_Variable_6; // 0x1e85c(0x04)
	struct FName K2Node_CustomEvent_NotifyName_41; // 0x1e860(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_41; // 0x1e868(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_26; // 0x1e86c(0x10)
	struct FName K2Node_CustomEvent_NotifyName_42; // 0x1e87c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_42; // 0x1e884(0x04)
	struct FName K2Node_CustomEvent_NotifyName_43; // 0x1e888(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_43; // 0x1e890(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_27; // 0x1e894(0x10)
	struct FName K2Node_CustomEvent_NotifyName_44; // 0x1e8a4(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_44; // 0x1e8ac(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_28; // 0x1e8b0(0x10)
	struct FName K2Node_CustomEvent_NotifyName_4; // 0x1e8c0(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_4; // 0x1e8c8(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_29; // 0x1e8cc(0x10)
	struct FName K2Node_CustomEvent_NotifyName_45; // 0x1e8dc(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_45; // 0x1e8e4(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_30; // 0x1e8e8(0x10)
	struct FName Temp_name_Variable_7; // 0x1e8f8(0x08)
	int32_t Temp_int_Variable_7; // 0x1e900(0x04)
	struct FName K2Node_CustomEvent_NotifyName_46; // 0x1e904(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_46; // 0x1e90c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_31; // 0x1e910(0x10)
	bool Temp_bool_Has_Been_Initd_Variable; // 0x1e920(0x01)
	char UnknownData_1E921[0x3]; // 0x1e921(0x03)
	struct FName K2Node_CustomEvent_NotifyName_47; // 0x1e924(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_47; // 0x1e92c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_32; // 0x1e930(0x10)
	struct FName K2Node_CustomEvent_NotifyName_48; // 0x1e940(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_48; // 0x1e948(0x04)
	bool Temp_bool_IsClosed_Variable; // 0x1e94c(0x01)
	char UnknownData_1E94D[0x3]; // 0x1e94d(0x03)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_33; // 0x1e950(0x10)
	struct AKSCharacter* K2Node_DynamicCast_AsKSCharacter; // 0x1e960(0x08)
	bool K2Node_DynamicCast_bSuccess; // 0x1e968(0x01)
	char UnknownData_1E969[0x3]; // 0x1e969(0x03)
	float K2Node_Event_Duration; // 0x1e96c(0x04)
	struct FVector2D K2Node_Event_Direction; // 0x1e970(0x08)
	float CallFunc_BreakRotator_Roll; // 0x1e978(0x04)
	float CallFunc_BreakRotator_Pitch; // 0x1e97c(0x04)
	float CallFunc_BreakRotator_Yaw; // 0x1e980(0x04)
	float CallFunc_BreakRotator_Roll_2; // 0x1e984(0x04)
	float CallFunc_BreakRotator_Pitch_2; // 0x1e988(0x04)
	float CallFunc_BreakRotator_Yaw_2; // 0x1e98c(0x04)
	struct FName K2Node_Event_NewInteractState; // 0x1e990(0x08)
	float K2Node_Event_NewInteractHeight; // 0x1e998(0x04)
	float K2Node_Event_NewInteractTime; // 0x1e99c(0x04)
	bool K2Node_SwitchName_CmpSuccess; // 0x1e9a0(0x01)
	char UnknownData_1E9A1[0x3]; // 0x1e9a1(0x03)
	struct FName K2Node_Event_OldInteractState; // 0x1e9a4(0x08)
	bool K2Node_SwitchName_CmpSuccess_2; // 0x1e9ac(0x01)
	char UnknownData_1E9AD[0x3]; // 0x1e9ad(0x03)
	struct FVector K2Node_Event_PivotLocation; // 0x1e9b0(0x0c)
	struct FName K2Node_CustomEvent_NotifyName_49; // 0x1e9bc(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_49; // 0x1e9c4(0x04)
	struct TArray<struct USkeletalMeshComponent*> CallFunc_GetAncillaryMeshes_ReturnValue; // 0x1e9c8(0x10)
	struct TArray<struct USkeletalMeshComponent*> CallFunc_GetAncillaryMeshes_ReturnValue_2; // 0x1e9d8(0x10)
	struct USkeletalMeshComponent* CallFunc_Array_Get_Item; // 0x1e9e8(0x08)
	struct USkeletalMeshComponent* CallFunc_Array_Get_Item_2; // 0x1e9f0(0x08)
	struct UMasterWeapon_ABP_C* K2Node_DynamicCast_AsMaster_Weapon_ABP; // 0x1e9f8(0x08)
	bool K2Node_DynamicCast_bSuccess_2; // 0x1ea00(0x01)
	char UnknownData_1EA01[0x3]; // 0x1ea01(0x03)
	struct FVector K2Node_CustomEvent_RootLocation; // 0x1ea04(0x0c)
	struct FRotator K2Node_CustomEvent_RootRotation; // 0x1ea10(0x0c)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_34; // 0x1ea1c(0x10)
	struct FVector K2Node_Event_StopLocation; // 0x1ea2c(0x0c)
	struct FVector K2Node_Event_StartLocation; // 0x1ea38(0x0c)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_35; // 0x1ea44(0x10)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID; // 0x1ea54(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x1ea58(0x08)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_2; // 0x1ea60(0x04)
	char UnknownData_1EA64[0x4]; // 0x1ea64(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x1ea68(0x08)
	bool CallFunc_IsValid_ReturnValue_3; // 0x1ea70(0x01)
	bool CallFunc_IsValid_ReturnValue_4; // 0x1ea71(0x01)
	char UnknownData_1EA72[0x2]; // 0x1ea72(0x02)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_3; // 0x1ea74(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x1ea78(0x08)
	bool CallFunc_IsValid_ReturnValue_5; // 0x1ea80(0x01)
	char UnknownData_1EA81[0x3]; // 0x1ea81(0x03)
	struct FName K2Node_CustomEvent_NotifyName_50; // 0x1ea84(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_50; // 0x1ea8c(0x04)
	enum class EKSMovementDirection K2Node_Event_OldDirection; // 0x1ea90(0x01)
	enum class EKSMovementDirection K2Node_Event_NewDirection; // 0x1ea91(0x01)
	char UnknownData_1EA92[0x2]; // 0x1ea92(0x02)
	float K2Node_Event_InMantleHeight; // 0x1ea94(0x04)
	bool K2Node_Event_bInVault; // 0x1ea98(0x01)
	char UnknownData_1EA99[0x3]; // 0x1ea99(0x03)
	float K2Node_Event_InVaultDrop; // 0x1ea9c(0x04)
	float K2Node_Event_InUpDuration; // 0x1eaa0(0x04)
	float K2Node_Event_InAcrossDuration; // 0x1eaa4(0x04)
	float K2Node_Event_InDownDuration; // 0x1eaa8(0x04)
	struct FName K2Node_Event_InMantleName; // 0x1eaac(0x08)
	struct FName K2Node_CustomEvent_NotifyName_5; // 0x1eab4(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_5; // 0x1eabc(0x04)
	float K2Node_Event_DeltaTimeX; // 0x1eac0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_36; // 0x1eac4(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_37; // 0x1ead4(0x10)
	char UnknownData_1EAE4[0x4]; // 0x1eae4(0x04)
	struct AMainCharacter_C* K2Node_DynamicCast_AsMain_Character; // 0x1eae8(0x08)
	bool K2Node_DynamicCast_bSuccess_3; // 0x1eaf0(0x01)
	char UnknownData_1EAF1[0x3]; // 0x1eaf1(0x03)
	struct FName Temp_name_Variable_8; // 0x1eaf4(0x08)
	int32_t Temp_int_Variable_8; // 0x1eafc(0x04)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_4; // 0x1eb00(0x04)
	char UnknownData_1EB04[0x4]; // 0x1eb04(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_4; // 0x1eb08(0x08)
	bool CallFunc_IsValid_ReturnValue_7; // 0x1eb10(0x01)
	char UnknownData_1EB11[0x3]; // 0x1eb11(0x03)
	struct FName K2Node_CustomEvent_NotifyName_6; // 0x1eb14(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_6; // 0x1eb1c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_38; // 0x1eb20(0x10)
	bool Temp_bool_Variable; // 0x1eb30(0x01)
	bool Temp_bool_Variable_2; // 0x1eb31(0x01)
	char UnknownData_1EB32[0x2]; // 0x1eb32(0x02)
	float Temp_float_Variable; // 0x1eb34(0x04)
	struct FName K2Node_CustomEvent_NotifyName_7; // 0x1eb38(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_7; // 0x1eb40(0x04)
	bool Temp_bool_Variable_3; // 0x1eb44(0x01)
	char UnknownData_1EB45[0x3]; // 0x1eb45(0x03)
	float Temp_float_Variable_2; // 0x1eb48(0x04)
	float K2Node_Select_Default; // 0x1eb4c(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_39; // 0x1eb50(0x10)
	struct FName K2Node_CustomEvent_NotifyName_8; // 0x1eb60(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_8; // 0x1eb68(0x04)
	bool Temp_bool_Variable_4; // 0x1eb6c(0x01)
	char UnknownData_1EB6D[0x3]; // 0x1eb6d(0x03)
	float K2Node_Select_Default_2; // 0x1eb70(0x04)
	float Temp_float_Variable_3; // 0x1eb74(0x04)
	float K2Node_Select_Default_3; // 0x1eb78(0x04)
	float K2Node_Select_Default_4; // 0x1eb7c(0x04)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_5; // 0x1eb80(0x04)
	char UnknownData_1EB84[0x4]; // 0x1eb84(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_5; // 0x1eb88(0x08)
	bool CallFunc_IsValid_ReturnValue_8; // 0x1eb90(0x01)
	char UnknownData_1EB91[0x3]; // 0x1eb91(0x03)
	float Temp_float_Variable_4; // 0x1eb94(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_40; // 0x1eb98(0x10)
	bool CallFunc_GetSkinnedAnimSequence_bHasOverride; // 0x1eba8(0x01)
	bool CallFunc_GetSkinnedAnimSequence_bHasOverride_2; // 0x1eba9(0x01)
	bool CallFunc_GetSkinnedAnimSequence_bHasOverride_3; // 0x1ebaa(0x01)
	bool Temp_bool_Has_Been_Initd_Variable_2; // 0x1ebab(0x01)
	bool Temp_bool_Variable_5; // 0x1ebac(0x01)
	char UnknownData_1EBAD[0x3]; // 0x1ebad(0x03)
	float K2Node_Select_Default_5; // 0x1ebb0(0x04)
	char UnknownData_1EBB4[0x4]; // 0x1ebb4(0x04)
	struct UKSCharacterAnimInst* K2Node_DynamicCast_AsKSCharacter_Anim_Inst; // 0x1ebb8(0x08)
	bool K2Node_DynamicCast_bSuccess_4; // 0x1ebc0(0x01)
	char UnknownData_1EBC1[0x7]; // 0x1ebc1(0x07)
	struct UKSCharacterAnimInst* K2Node_DynamicCast_AsKSCharacter_Anim_Inst_2; // 0x1ebc8(0x08)
	bool K2Node_DynamicCast_bSuccess_5; // 0x1ebd0(0x01)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride; // 0x1ebd1(0x01)
	char UnknownData_1EBD2[0x2]; // 0x1ebd2(0x02)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_6; // 0x1ebd4(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_6; // 0x1ebd8(0x08)
	bool CallFunc_IsValid_ReturnValue_12; // 0x1ebe0(0x01)
	char UnknownData_1EBE1[0x7]; // 0x1ebe1(0x07)
	struct UKSCharacterAnimInst* K2Node_DynamicCast_AsKSCharacter_Anim_Inst_3; // 0x1ebe8(0x08)
	bool K2Node_DynamicCast_bSuccess_6; // 0x1ebf0(0x01)
	enum class EKSPowerSlideEndReason K2Node_Event_EndReason; // 0x1ebf1(0x01)
	bool K2Node_SwitchEnum_CmpSuccess; // 0x1ebf2(0x01)
	char UnknownData_1EBF3[0x1]; // 0x1ebf3(0x01)
	struct FName K2Node_CustomEvent_NotifyName_9; // 0x1ebf4(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_9; // 0x1ebfc(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_41; // 0x1ec00(0x10)
	enum class EKSMovementDirection K2Node_CustomEvent_NewMoveDirection_2; // 0x1ec10(0x01)
	enum class EKSMovementDirection K2Node_CustomEvent_NewMoveDirection; // 0x1ec11(0x01)
	char UnknownData_1EC12[0x2]; // 0x1ec12(0x02)
	struct FName K2Node_CustomEvent_NotifyName_10; // 0x1ec14(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_10; // 0x1ec1c(0x04)
	enum class ECombatState K2Node_Event_NewCombatState; // 0x1ec20(0x01)
	bool K2Node_Event_bBlockCooldown; // 0x1ec21(0x01)
	bool K2Node_Event_bForce; // 0x1ec22(0x01)
	char UnknownData_1EC23[0x5]; // 0x1ec23(0x05)
	struct UAnimMontage* K2Node_Event_ReviveMontage; // 0x1ec28(0x08)
	bool K2Node_Event_bIsInAir; // 0x1ec30(0x01)
	bool Temp_bool_IsClosed_Variable_2; // 0x1ec31(0x01)
	char UnknownData_1EC32[0x2]; // 0x1ec32(0x02)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_7; // 0x1ec34(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_7; // 0x1ec38(0x08)
	struct UKSWeaponComponent* K2Node_Event_Weapon_2; // 0x1ec40(0x08)
	bool CallFunc_IsValid_ReturnValue_14; // 0x1ec48(0x01)
	char UnknownData_1EC49[0x7]; // 0x1ec49(0x07)
	struct UKSWeaponComponent* K2Node_Event_Weapon; // 0x1ec50(0x08)
	struct AKSCharacter* K2Node_CustomEvent_In_Character; // 0x1ec58(0x08)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_42; // 0x1ec60(0x10)
	struct AKSCharacter* K2Node_CustomEvent_Character; // 0x1ec70(0x08)
	struct FDamageEffect K2Node_CustomEvent_Response; // 0x1ec78(0x50)
	struct FVector CallFunc_ProcessTakePointHitDamage_WorldHitLocation; // 0x1ecc8(0x0c)
	struct FVector CallFunc_ProcessTakePointHitDamage_WorldHitNormal; // 0x1ecd4(0x0c)
	struct FVector CallFunc_ProcessTakePointHitDamage_VectorToHitSource; // 0x1ece0(0x0c)
	enum class EKSMovementDirection CallFunc_ProcessTakePointHitDamage_HitDirection; // 0x1ecec(0x01)
	char UnknownData_1ECED[0x3]; // 0x1eced(0x03)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_43; // 0x1ecf0(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_44; // 0x1ed00(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_45; // 0x1ed10(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_46; // 0x1ed20(0x10)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_2; // 0x1ed30(0x01)
	char UnknownData_1ED31[0x3]; // 0x1ed31(0x03)
	struct FName Temp_name_Variable_9; // 0x1ed34(0x08)
	char UnknownData_1ED3C[0x4]; // 0x1ed3c(0x04)
	struct UKSCharacterAnimInst* CallFunc_Map_Find_Value; // 0x1ed40(0x08)
	struct UAnimMontage* CallFunc_GetDownedTransitionMontage_OutAnimMontage; // 0x1ed48(0x08)
	bool Temp_bool_Has_Been_Initd_Variable_3; // 0x1ed50(0x01)
	enum class EKSTurnInPlaceAnimationVariant K2Node_Event_AnimationVariant; // 0x1ed51(0x01)
	char UnknownData_1ED52[0x2]; // 0x1ed52(0x02)
	float K2Node_Event_DelayTime; // 0x1ed54(0x04)
	bool K2Node_SwitchEnum_CmpSuccess_2; // 0x1ed58(0x01)
	char UnknownData_1ED59[0x3]; // 0x1ed59(0x03)
	struct FName Temp_name_Variable_10; // 0x1ed5c(0x08)
	bool Temp_bool_IsClosed_Variable_3; // 0x1ed64(0x01)
	char UnknownData_1ED65[0x3]; // 0x1ed65(0x03)
	struct FName Temp_name_Variable_11; // 0x1ed68(0x08)
	struct FName Temp_name_Variable_12; // 0x1ed70(0x08)
	struct FName Temp_name_Variable_13; // 0x1ed78(0x08)
	int32_t Temp_int_Variable_9; // 0x1ed80(0x04)
	bool Temp_bool_Has_Been_Initd_Variable_4; // 0x1ed84(0x01)
	char UnknownData_1ED85[0x3]; // 0x1ed85(0x03)
	struct TSet<struct FName> K2Node_CustomEvent_Keywords; // 0x1ed88(0x50)
	struct FName K2Node_CustomEvent_NotifyName_11; // 0x1edd8(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_11; // 0x1ede0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_47; // 0x1ede4(0x10)
	struct FName K2Node_CustomEvent_NotifyName_12; // 0x1edf4(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_12; // 0x1edfc(0x04)
	bool Temp_bool_IsClosed_Variable_4; // 0x1ee00(0x01)
	bool K2Node_SwitchEnum_CmpSuccess_3; // 0x1ee01(0x01)
	char UnknownData_1EE02[0x2]; // 0x1ee02(0x02)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_48; // 0x1ee04(0x10)
	struct FName K2Node_CustomEvent_NotifyName_13; // 0x1ee14(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_13; // 0x1ee1c(0x04)
	struct FName K2Node_CustomEvent_NotifyName_14; // 0x1ee20(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_14; // 0x1ee28(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_49; // 0x1ee2c(0x10)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_50; // 0x1ee3c(0x10)
	struct FName K2Node_CustomEvent_NotifyName_15; // 0x1ee4c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_15; // 0x1ee54(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_51; // 0x1ee58(0x10)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_3; // 0x1ee68(0x01)
	char UnknownData_1EE69[0x3]; // 0x1ee69(0x03)
	struct FName Temp_name_Variable_14; // 0x1ee6c(0x08)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_4; // 0x1ee74(0x01)
	bool K2Node_CustomEvent_IsSprinting; // 0x1ee75(0x01)
	char UnknownData_1EE76[0x2]; // 0x1ee76(0x02)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_52; // 0x1ee78(0x10)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_5; // 0x1ee88(0x01)
	char UnknownData_1EE89[0x7]; // 0x1ee89(0x07)
	struct TSet<struct FName> CallFunc_GetAllSkinKeywords_InOutKeywords; // 0x1ee90(0x50)
	bool CallFunc_GetSkinnedAnimSequence_bHasOverride_4; // 0x1eee0(0x01)
	char UnknownData_1EEE1[0x3]; // 0x1eee1(0x03)
	int32_t Temp_int_Variable_10; // 0x1eee4(0x04)
	struct FName K2Node_CustomEvent_NotifyName_16; // 0x1eee8(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_16; // 0x1eef0(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_53; // 0x1eef4(0x10)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_6; // 0x1ef04(0x01)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_7; // 0x1ef05(0x01)
	char UnknownData_1EF06[0x2]; // 0x1ef06(0x02)
	struct FName K2Node_CustomEvent_NotifyName_17; // 0x1ef08(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_17; // 0x1ef10(0x04)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_54; // 0x1ef14(0x10)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_8; // 0x1ef24(0x01)
	bool CallFunc_GetSkinnedAnimMontage_bHasOverride_9; // 0x1ef25(0x01)
	char UnknownData_1EF26[0x2]; // 0x1ef26(0x02)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_8; // 0x1ef28(0x04)
	char UnknownData_1EF2C[0x4]; // 0x1ef2c(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_8; // 0x1ef30(0x08)
	bool CallFunc_IsValid_ReturnValue_17; // 0x1ef38(0x01)
	char UnknownData_1EF39[0x3]; // 0x1ef39(0x03)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_9; // 0x1ef3c(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_9; // 0x1ef40(0x08)
	int32_t CallFunc_CreateProxyObjectForPlayMontage_CreatedInstanceID_10; // 0x1ef48(0x04)
	char UnknownData_1EF4C[0x4]; // 0x1ef4c(0x04)
	struct UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_10; // 0x1ef50(0x08)
	bool CallFunc_IsValid_ReturnValue_18; // 0x1ef58(0x01)
	bool CallFunc_IsValid_ReturnValue_19; // 0x1ef59(0x01)
	char UnknownData_1EF5A[0x2]; // 0x1ef5a(0x02)
	struct FName K2Node_CustomEvent_NotifyName_18; // 0x1ef5c(0x08)
	int32_t K2Node_CustomEvent_MontageInstanceID_18; // 0x1ef64(0x04)
	struct UAnimMontage* CallFunc_Get_Roll_Animation_Set_Cached; // 0x1ef68(0x08)
	struct FDelegate K2Node_CreateDelegate_OutputDelegate_55; // 0x1ef70(0x10)

	void OnMagThrow__DelegateSignature(); // DelegateFunction PCM_Hero_ABP.PCM_Hero_ABP_C.OnMagThrow__DelegateSignature
	void ZipLineTurnReset(); // Function PCM_Hero_ABP.PCM_Hero_ABP_C.ZipLineTurnReset
	void Update Eng Head Additive Secondary Active(); // Function PCM_Hero_ABP.PCM_Hero_ABP_C.Update Eng Head Additive Secondary Active
	void UpdateWeaponLimitedMovement(struct UKSWeaponComponent* bpp__InWeaponComponent__pf); // Function PCM_Hero_ABP.PCM_Hero_ABP_C.UpdateWeaponLimitedMovement
	void UpdateSkinDependantVariables(struct TSet<struct FName> bpp__DataTableRows__pf__const); // Function PCM_Hero_ABP.PCM_Hero_ABP_C.UpdateSkinDependantVariables
	void UpdateRagdollPelvis(); // Function PCM_Hero_ABP.PCM_Hero_ABP_C.UpdateRagdollPelvis
	void UpdateIKHandRuleset(struct UKSWeaponComponent* bpp__InWeaponComponent__pf); // Function PCM_Hero_ABP.PCM_Hero_ABP_C.UpdateIKHandRuleset
