// DynamicClass Sub_Hero_ABP_Face.Sub_Hero_ABP_Face_C
// Size: 0x2720 (Inherited: 0x1010)
struct USub_Hero_ABP_Face_C : public UKSFaceAnimInst {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1010(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1040(0x28)
	struct FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned_6; // 0x1068(0x160)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6; // 0x11c8(0x48)
	struct FAnimNode_BlendPoseNodeSkinned AnimGraphNode_BlendPoseSkinned_2; // 0x1210(0xc8)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x12d8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x1308(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1380(0xc0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1440(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x14b8(0xc0)
	struct FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned_5; // 0x1578(0x160)
	struct FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned_4; // 0x16d8(0x160)
	struct FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned_3; // 0x1838(0x160)
	struct FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned_2; // 0x1998(0x160)
	struct FAnimNode_SeqEvalSkinned AnimGraphNode_SeqEvalSkinned; // 0x1af8(0x160)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5; // 0x1c58(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4; // 0x1ca0(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x1ce8(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x1d30(0x48)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1d78(0x48)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x1dc0(0xb0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1e70(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1ea0(0xb0)
	struct FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose; // 0x1f50(0x78)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1fc8(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2088(0xa0)
	struct FAnimNode_BlendByLOD AnimGraphNode_BlendByLOD; // 0x2128(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x21c8(0xa0)
	struct FAnimNode_BlendPoseNodeSkinned AnimGraphNode_BlendPoseSkinned; // 0x2268(0xc8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x2330(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x23e8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x2410(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x2438(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x2460(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x2500(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2528(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x25e0(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2608(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x26c8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x26f0(0x28)
	enum class EKSEmotion emotionTest; // 0x2718(0x01)
	bool bIsServer; // 0x2719(0x01)
	bool bIsLobby; // 0x271a(0x01)
	char UnknownData_271B[0x5]; // 0x271b(0x05)

	void ExecuteUbergraph_Sub_Hero_ABP_Face(int32_t bpp__EntryPoint__pf); // Function Sub_Hero_ABP_Face.Sub_Hero_ABP_Face_C.ExecuteUbergraph_Sub_Hero_ABP_Face
	void AnimGraph(struct FPoseLink bpp__InPose__pf, struct FPoseLink bpp__AnimGraph__pf); // Function Sub_Hero_ABP_Face.Sub_Hero_ABP_Face_C.AnimGraph
};

