// DynamicClass Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C
// Size: 0x5bc0 (Inherited: 0x1010)
struct USub_Hero_ABP_PowerSlide_C : public UKSCharacterAnimInst {
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1010(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0x1040(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0x1068(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x1090(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x10b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x10e0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1108(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1130(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1158(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1180(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_5; // 0x11f8(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1348(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1378(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_4; // 0x13f0(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x1540(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1570(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_3; // 0x15e8(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1738(0x30)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned_2; // 0x1768(0x150)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x18b8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1930(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1960(0x78)
	struct FAnimNode_SequenceSkinned AnimGraphNode_SequenceSkinned; // 0x19d8(0x150)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x1b28(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1b58(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x1c08(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x1c30(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x1c58(0x20)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1c78(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1d80(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x1e88(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x1f90(0x20)
	struct FKSAnimNode_SpeedWarp KSAnimGraphNode_SpeedWarp_2; // 0x1fb0(0x120)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15; // 0x20d0(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_15; // 0x21b0(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14; // 0x23a0(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_14; // 0x2480(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13; // 0x2670(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_13; // 0x2750(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12; // 0x2940(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_12; // 0x2a20(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11; // 0x2c10(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_11; // 0x2cf0(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10; // 0x2ee0(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_10; // 0x2fc0(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9; // 0x31b0(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_9; // 0x3290(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8; // 0x3480(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_8; // 0x3560(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7; // 0x3750(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_7; // 0x3830(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6; // 0x3a20(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_6; // 0x3b00(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0x3cf0(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_5; // 0x3dd0(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x3fc0(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_4; // 0x40a0(0x1f0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6; // 0x4290(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5; // 0x4340(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4; // 0x43f0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3; // 0x44a0(0xb0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2; // 0x4550(0xb0)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_5; // 0x4600(0x110)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_4; // 0x4710(0x110)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_3; // 0x4820(0x110)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x4930(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x4950(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x4970(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x4990(0x20)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp_2; // 0x49b0(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x4ac0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x4ae0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x4b00(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x4b20(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x4b40(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x4b70(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_3; // 0x4c50(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x4e40(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned_2; // 0x4f20(0x1f0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5110(0xe0)
	struct FAnimNode_BlendSpacePlayerSkinned AnimGraphNode_BlendSpaceSkinned; // 0x51f0(0x1f0)
	struct FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum; // 0x53e0(0xb0)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x5490(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x5598(0x108)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x56a0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x57a8(0x20)
	struct FKSAnimNode_SpeedWarp KSAnimGraphNode_SpeedWarp; // 0x57c8(0x120)
	struct FKSAnimNode_OrientationWarp KSAnimGraphNode_OrientationWarp; // 0x58e8(0x110)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x59f8(0x20)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x5a18(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x5a48(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x5af8(0xa0)
	struct AKSCharacter* Character; // 0x5b98(0x08)
	bool bIsInPowerSlideBP; // 0x5ba0(0x01)
	char UnknownData_5BA1[0x3]; // 0x5ba1(0x03)
	float ExitPowerSlideBlendTime; // 0x5ba4(0x04)
	bool ForceResetSlide; // 0x5ba8(0x01)
	enum class EKSPowerSlideEndReason K2Node_Event_EndReason; // 0x5ba9(0x01)
	bool K2Node_SwitchEnum_CmpSuccess; // 0x5baa(0x01)
	char UnknownData_5BAB[0x5]; // 0x5bab(0x05)
	struct AKSCharacter* K2Node_DynamicCast_AsKSCharacter; // 0x5bb0(0x08)
	bool K2Node_DynamicCast_bSuccess; // 0x5bb8(0x01)
	char UnknownData_5BB9[0x7]; // 0x5bb9(0x07)

	void EventEndPowerSlide(enum class EKSPowerSlideEndReason bpp__EndReason__pf); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EventEndPowerSlide
	void EventDoPowerSlide(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EventDoPowerSlide
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_F2002302482AD25E4145C8A35E6E52A9(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_F2002302482AD25E4145C8A35E6E52A9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_9C1158CA49F8D953A3CC959E565A0B4D(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_9C1158CA49F8D953A3CC959E565A0B4D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_6340AB694822FD8029F618AABD307E22(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_6340AB694822FD8029F618AABD307E22
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_3EFDE50344F37F1823FB6183AB26579A(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_3EFDE50344F37F1823FB6183AB26579A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_0C51BCE94007B9A9160D67BE7D5836DC(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.EvaluateGraphExposedInputs_ExecuteUbergraph_Sub_Hero_ABP_PowerSlide_AnimGraphNode_TransitionResult_0C51BCE94007B9A9160D67BE7D5836DC
	void BlueprintInitializeAnimation(); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.BlueprintInitializeAnimation
	void AnimGraph(struct FPoseLink bpp__AnimGraph__pf); // Function Sub_Hero_ABP_PowerSlide.Sub_Hero_ABP_PowerSlide_C.AnimGraph
};

